{
    "newspapers": {
        "foxnews": {
            "articles": [
                {
                    "link": "https://video.foxnews.com/v/5614615980001/#sp=watch-live",
                    "title": "Watch Fox News Channel and Fox Business Network Online",
                    "text": ""
                },
                {
                    "link": "https://www.foxnews.com/us/missing-long-island-teens-found-new-york-city",
                    "title": "Missing teens found in NYC after vanishing from Long Island last week",
                    "text": "Two missing New York teens have been found safe five days after they had a classmate drop them off at a suburban Long Island train station for a ride into Manhattan, according to police.\n\nVincent Abolafia and Kaileigh Catalano, both 15 and from Manorville, New York, made their way to the Long Island Rail Road’s Ronkonkoma station after school on Dec. 9, according to police. They left their cellphones and vaccination cards behind.\n\nWitnesses later spotted them at New York City’s Times Square and other Manhattan locations, but they failed to return home – prompting their parents to report them both missing later that evening.\n\nSuffolk County police said Tuesday afternoon that the teens were still in the city when investigators found them unharmed earlier in the day. The NYPD and MTA police assisted in the investigation, authorities said.\n\nGABBY PETITO'S DAD URGES PUBLIC TO HELP FIND MISSING LONG ISLAND TEENS VINCENT ABOLAFIA AND KAILEIGH CATALANO\n\nAs recently as Monday, police said they had no new information in the case and were working to locate the children. The NYPD said it was ready to assist if needed.\n\nKaileigh's mom, Ehrin Catalano, said the parents did not yet have details about the past five days. But police said they were OK.\n\nNeither of them had ever run away before, their parents said Sunday, and their failure to return came as a shock.\n\nKaileigh’s dad, Joe Catalano, had earlier voiced concerns about the adolescents’ safety away from home for so long.\n\n\"Long Island and the city are two different animals,\" he said Sunday.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nPolice were expected to reunite the families later Tuesday.\n\nThis is a developing story. Stick with Fox News Digital for updates."
                },
                {
                    "link": "https://www.foxnews.com/politics/democratic-mayors-violence-chicago-new-york-philadelphia",
                    "title": "Democratic mayors under fire as crime, violence plagues Chicago, New York, Philadelphia",
                    "text": "NEW You can now listen to Fox News articles!\n\nDemocratic mayors are raising eyebrows with their responses to the rising crime plaguing major cities like New York City, Chicago and Philadelphia.\n\nThe U.S. murder rate rose 30% between 2019 and 2020, according to FBI data – the largest annual increase on record, with Chicago topping the list. At least 12 major cities, including New York, have already set historical murder records in 2021. Robberies and assaults are also on the rise, and retailers in major cities across the country are reporting an uptick in organized smash-and-grab crimes during the busy holiday shopping season.\n\nChicago Mayor Lori Lightfoot faced criticism last week after she responded to the recent flood of robberies in her city by blaming retailers for not better protecting their merchandise.\n\nLEFT'S PHILOSOPHY ON CRIME IS ON FULL DISPLAY IN BLUE STATES AS DEMOCRATS PROMOTE 'CHAOS': PAVLICH\n\n\"We also got to push retailers,\" she said during a Dec. 6 event. \"I'm disappointed that they are not doing more to take safety and make it a priority. For example, we still have retailers that won't institute plans like having security officers in their stores, making sure that they've got cameras that are actually operational, locking up their merchandise at night. Chaining high-end bags, these purses seem to be something that is attracting a lot of attention on these organized retail theft units.\"\n\nLightfoot's comments were blasted by retailers as misinformed.\n\nIn New York City, one of Mayor Bill de Blasio’s last acts as mayor before he hands over the reins to Mayor-elect Eric Adams is instituting a COVID-19 vaccine mandate for private businesses in the city, claiming it’s his \"job\" to \"protect\" New Yorkers.\n\nThe mandate gave businesses only three weeks to comply before it goes into effect on Dec. 27, just four days before de Blasio leaves office.\n\nDuring an appearance on \"Fox News Sunday\" over the weekend, de Blasio defended the mandate and claimed the city is \"much safer\" now than it was when he took the reins eight years ago, despite the fact that murders in the city skyrocketed last year and have remained high so far in 2021.\n\n\"Eight years I’ve been mayor, index crimes, major crimes in New York City down 11% over eight years. And we did it bringing police and community closer together,\" the mayor said. \"The bottom line is that there is today in New York City, a much safer city than we were eight years ago.\"\n\n\"I have confidence and the NYPD has confidence that we’re going to get back to the prepandemic levels soon, and then surpass, and become even safer,\" he added. \"And the statistics show it in most of the city; there are a few places where we’re struggling.\"\n\nBIDEN'S APPROVAL RATING ON CRIME TANKS AMID RISE IN SMASH-AND-GRAB ROBBERIES\n\nIn Philadelphia, where police have reported a 13% increase in homicides compared to 2020, District Attorney Larry Krasner sparked a backlash this week after he claimed the city does not have a crime problem.\n\n\"We don’t have a crisis of lawlessness, we don’t have a crisis of crime, we don’t have a crisis of violence,\" the district attorney told reporters Monday. \"It’s important that we don’t let this become mushy and bleed into the notion that there is some kind of big spike in crime. There isn't. There is not a big spike in crime. … There is not a big spike in violent crime. Neither one of these things is true.\"\n\nKrasner later walked back his comments but fell short of making an apology or changing his remarks.\n\n\"I know that some inarticulate things I said earlier this week have offended people. The message conveyed through media sound bites is not at all what I meant,\" Krasner said Thursday. \"Complete answers based on data aimed at solutions to gun violence will be edited down to sound bites. It’s my job to make sure even those sound bites are careful. As someone whose strong support is owed in part to the fact that I don’t communicate or make decisions like a career politician, it is my obligation to do better.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nLos Angeles District Attorney George Gascon also recently came under fire amid a surge in violent smash-and-grab robberies in his city. Critics blamed Gascon's zero-bail policies for releasing 14 suspects who were allegedly involved in 11 smash-and-grab robberies last month hours after their arrest.\n\nGascon defended himself during a press conference last week, blasting what he described as \"fearmongering and misinformation\" regarding crime in L.A. County, The Los Angeles Times reported.\n\nFox News’ Adam Sabes and Paul Best contributed to this report."
                },
                {
                    "link": "https://www.foxnews.com/live-news/biden-approves-emergency-aid-for-states-impacted-by-storms",
                    "title": "Kentucky, Illinois, Missouri tornado and storm damage: LIVE UPDATES",
                    "text": "Kentucky tornado survivor 'just thankful to be here' after losing home\n\nKentucky tornado survivor, Janssen Lindsey, lost her home over the weekend in the deadly storms that ripped through several states and killed over 70 people in the Bluegrass State alone.\n\nLindsey appeared on \"America's Newsroom\" Tuesday, expressing her gratitude to be alive and her many \"blessings\" despite the tragic weekend.\n\n\"We're just thankful to be here and be alive at this moment, and we've had a huge outpouring of blessings just every single day,\" Lindsey stated. \"So we just wanted to reach out and say thank you to everybody, and it's been a whirlwind, for sure.\"\n\nLindsey also told co-hosts Bill Hemmer and Dana Perino how grateful she was to be reunited with her dog, as she and her family had to leave their home abruptly before the storms hit.\n\nClick here to read more on Fox News."
                },
                {
                    "link": "https://www.foxnews.com/world/uk-british-line-up-covid-19-booster-shots-omicron-variant",
                    "title": "Rise in UK omicron cases sees long lines for COVID-19 vaccine booster shots",
                    "text": "Long lines formed Monday at vaccination centers across England as people heeded the government’s call for all adults to get booster shots to protect themselves against the omicron variant, as the U.K. recorded its first death of a patient infected with omicron.\n\nIn a televised announcement late Sunday, Prime Minister Boris Johnson said everyone 18 and up would be offered a third vaccine dose by Dec. 31 — less than three weeks away, and a month earlier than the previous target.\n\nJohnson said boosters would \"reinforce our wall of vaccine protection\" against an anticipated \"tidal wave of omicron.\" The British government raised the country’s official coronavirus threat level on Sunday, warning that the rapid spread of omicron \"adds additional and rapidly increasing risk to the public and health care services.\"\n\nFAUCI: AMERICANS MAY ‘JUST HAVE TO DEAL WITH’ MORE COVID-19 VACCINE BOOSTER SHOTS\n\nU.K. health authorities say omicron cases are doubling every two to three days in Britain, and it will replace delta as the dominant coronavirus strain within days. But it's unclear whether the expected wave of infections will inundate the country's state-funded health care system.\n\nScientists in South Africa, where omicron was first identified, say they see signs the variant may cause less severe disease than delta but caution that it's too soon to be certain. Health authorities around the world are watching Britain closely to see what an omicron surge looks like in a country with an older, more highly vaccinated population than South Africa’s.\n\nAbout 10 people are in U.K. hospitals with COVID-19 caused by omicron, and Johnson on Monday said the country's first COVID-19 death involving the variant had been confirmed.\n\n\"So I think the idea that this is somehow a milder version of the virus, I think that’s something we need to set on one side and just recognize the sheer pace at which it accelerates through the population,\" Johnson said as he visited a vaccination center in London. \"So the best thing we can do is all get our boosters.\"\n\nThe U.K. Health Security Agency says existing vaccines appear less effective in preventing symptomatic infections in people exposed to omicron, though effectiveness appears to rise to between 70% and 75% after a third dose.\n\nMore than 80% of people age 12 and up in Britain have received two vaccine doses, and 40% of adults have had three. Giving the rest boosters by the end of the month will be a huge challenge, requiring almost 1 million vaccine shots delivered a day. Johnson acknowledged that many routine medical procedures would have to be postponed to meet the goal.\n\nSome 750 soldiers and thousands of volunteer vaccinators will help give the jabs at doctors’ offices, hospitals, pharmacies and pop-up vaccination centers.\n\nWhile the online appointment booking system will not be open to under-30s until Wednesday, Johnson said any adult could show up at a walk-in center to get a booster starting Monday.\n\nLines built up at big London vaccination clinics on Monday morning. The line for shots at St. Thomas' Hospital, on the south bank of the River Thames in London, stretched across Westminster Bridge toward Parliament. At many clinics people queued patiently despite being told they faced a wait of several hours.\n\nThe government’s appointment-booking website struggled to keep up with demand, and also ran out of rapid at-home virus test kits, which have been distributed free to households during the pandemic. The website where tests can be ordered said none were available Monday. Starting Wednesday, people in England must show proof of vaccination or a negative test to enter nightclubs and other crowded venues.\n\nJohnson’s Dec. 31 target applies to England. The other parts of the U.K. — Scotland, Wales and Northern Ireland — are also expected to speed up their vaccination campaigns.\n\nWhile omicron is spreading around the world, Britain may be especially affected because it ordinarily has high levels of travel to South Africa. The omicron outbreak is also more visible because U.K. is also a world leader in genomic sequencing, the technique used to identify and track new variants.\n\nResearchers in the U.K. have sequenced about 13.3% of all positive cases, compared with 3.8% in the U.S., according to GISAID, which promotes rapid sharing of data on COVID-19 and the flu. While nations such as Iceland and Denmark have sequenced a greater percentage of their positive cases, the size of the U.K.’s population and the scope of its outbreak mean Britain has sequenced many more cases.\n\nThis surveillance provided a key piece of the evidence that Johnson and the nation’s chief medical officers used in deciding to tighten pandemic restrictions and ramp up the U.K.’s vaccination program.\n\nVACCINATED PEOPLE NO LONGER HAVE TO FOLLOW LOCKDOWN RESTRICTIONS IN AUSTRIA\n\nJohnson’s Conservative government is bringing in vaccine certificates for nightclubs and reintroducing restrictions that were lifted almost six months ago. Masks must once again be worn in most indoor settings and as of Monday, people were urged to work from home if possible.\n\nMany scientists say those measures are unlikely to be enough and are calling for tougher ones. But cafes, pubs and shops in city centers fear that plummeting commuter numbers will hammer business in the usually busy pre-Christmas period.\n\nJohnson is facing a major rebellion from unhappy Conservative lawmakers when Parliament votes on the new virus restrictions Tuesday. Dozens are expected to oppose the restrictions — especially vaccine passports, which they say are unfair and economically damaging.\n\nThe measures are still highly likely to pass, with support from the opposition Labour Party.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nRobert Read, professor of infectious diseases at the University of Southampton, said it was still unclear how severe cases of COVID-19 from omicron would be, but \"the evidence is that omicron probably requires much larger amounts of antibody in the blood in order to thwart the virus as much as possible.\"\n\n\"We need to get those third doses into as many adults as we possibly can, just in case this virus turns out to be a raging bull rather than a pussy cat,\" Read told radio station LBC."
                },
                {
                    "link": "http://video.foxnews.com/v/1241186546001",
                    "title": "Watch Fox News Channel and Fox Business Network Online",
                    "text": ""
                },
                {
                    "link": "https://video.foxnews.com/v/6286890040001/",
                    "title": "Gutfeld: Our world is run by 'but-heads'",
                    "text": ""
                },
                {
                    "link": "https://video.foxnews.com/v/6285990652001/",
                    "title": "Fox Square's All-American Christmas Tree",
                    "text": ""
                },
                {
                    "link": "https://video.foxnews.com/v/6286898965001/",
                    "title": "Biden is 'strangling' American economy with massive spending: Rep. Chip Roy",
                    "text": ""
                },
                {
                    "link": "https://video.foxnews.com/v/6286888626001/",
                    "title": "Your next lockdown",
                    "text": ""
                },
                {
                    "link": "https://video.foxnews.com/v/6286882933001/",
                    "title": "Tucker: Liz Cheney is delusional",
                    "text": ""
                },
                {
                    "link": "https://video.foxnews.com/v/6286889403001/",
                    "title": "Gutfeld: Class dismissed for cops?",
                    "text": ""
                },
                {
                    "link": "https://video.foxnews.com/v/6286876422001/",
                    "title": "Liberal media gives Kamala Harris a pass on border crisis: Miranda Devine",
                    "text": ""
                },
                {
                    "link": "https://video.foxnews.com/v/6286873661001/",
                    "title": "Will Cain: BLM takes money from companies they boycott",
                    "text": ""
                },
                {
                    "link": "https://video.foxnews.com/v/6286882423001/",
                    "title": "Dr. Oz speaks out against politicization of medicine",
                    "text": ""
                },
                {
                    "link": "https://video.foxnews.com/v/6286875811001/",
                    "title": "Tucker: What kind of work environment is CNN running",
                    "text": ""
                },
                {
                    "link": "https://www.foxnews.com/politics/biden-to-dnc-holiday-party-were-going-to-win-in-2022",
                    "title": "Biden to DNC holiday party: 'We're going to win in 2022'",
                    "text": "NEW You can now listen to Fox News articles!\n\nPresident Joe Biden spoke at the Democratic National Committee holiday party on Tuesday night and expressed optimism that his party will prevail in next year’s midterm elections.\n\n\"We have to keep making the case,\" Biden told a crowd of about 400 in Washington, D.C. \"Let me say this again: From the president, we’re going to win in 2022.\"\n\nCNN FLOATS POSSIBLE REPLACEMENTS FOR BIDEN IN 2024\n\n\"I want to tell my Republican friends: Get ready, pal. You’re in for a problem,\" Biden said, explaining that Republicans are \"against everything\" and challenging the crowd to name something the GOP is \"for.\"\n\nMany political analysts expect Republicans to roll up victories in House elections next November.\n\nDuring his speech, Biden touted his recently passed infrastructure spending package as the most significant piece of infrastructure spending since the Eisenhower administration. The president also celebrated that over 200 million Americans are vaccinated.\n\nHouse Speaker Nancy Pelosi also spoke at the event and explained how Biden is the \"perfect\" president to handle the challenging times facing the country.\n\nSEN. BLUMENTHAL SPEAKS AT COMMUNIST AWARD SHOW, TOUTS 'BUILD BACK BETTER'\n\n\"Our country could not be better served than with this most experienced and capable hands than yours, President Biden,\" the San Francisco Democrat told the crowd. \"He’s just perfect. The timing couldn’t be better.\"\n\nPresident Biden 's standing with Americans remains in negative territory heading into the final few weeks of 2021.\n\nThe president stands at 43% approval and 51% disapproval in a NPR/Marist national survey released last Thursday. A day earlier, a national poll from Monmouth University indicated a 40% approval rating and a 50% disapproval rating. Both surveys were conducted in recent days.\n\nAn average of all the most recent national polls compiled by RealClearPolitics puts Biden’s approval rating at 42% and his disapproval rating at 52%. The average included a large survey from The Wall Street Journal conducted last month that had the president well underwater, at 41%-57%.\n\nBiden joked Friday night, during an appearance on NBC's \"Tonight Show,\" that he has stopped following his approval ratings .\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Well, not anymore,\" Biden quipped during the remote interview from the White House after host Jimmy Fallon asked him how much he pays attention to poll numbers.\n\n\"I’m joking,\" the president stressed as Fallon laughed hysterically and the audience clapped. \"I was paying attention when they were in the mid-60s, but now that they’re in the 40s, I don't pay attention.\"\n\nFox News’ Paul Steinhauser and Brie Stimson contributed to this report"
                },
                {
                    "link": "https://www.foxnews.com/opinion/biden-polling-plummets-red-wave-midterms-ronna-mcdaniel",
                    "title": "Biden polling plummets and 2022 midterm red wave gathers strength",
                    "text": "NEW You can now listen to Fox News articles!\n\nPresident Joe Biden’s job approval rating is in free fall – and it’s not just Republicans saying so.\n\nA recent USA TODAY/Suffolk Poll found 59% of voters disapprove of Biden’s job performance, while Vice President Kamala Harris’ approval rating sits at an embarrassing 28%. A stunning 46% of those surveyed believe Biden is doing a worse job as president than expected, including 16% who supported him at the ballot box last year.\n\nThe latest Harvard- Harris Poll found that voters overwhelmingly reject Biden’s agenda, too, with nearly 60% of voters opposing Biden’s socialist spending package. And according to CNN’s latest poll, a majority of Americans say Biden isn't paying attention to the nation's most important issues.\n\nBIDEN BLAMES SOARING GAS PRICES ON BIG OIL AS HE KEEPS UP HIS WAR ON FOSSIL FUELS\n\nThese results shouldn’t be a surprise. The Biden-Harris administration has failed at every opportunity.\n\nJust look at our economy. November’s jobs report was the worst of the year and the lowest number of Biden’s administration. The economy added back just 210,000 jobs – less than half what economists had predicted. Nearly four million Americans who lost their jobs during the pandemic are still jobless.\n\nMeanwhile, the latest data from the Labor Department shows consumer prices skyrocketed 6.2% in October – the largest spike in more than 30 years. Rising prices are making everything more expensive: gasoline is up almost 50% since last year and used vehicles have risen by 26%. And if you hosted a holiday dinner last month, you might’ve emptied your wallet: according to the Farm Bureau, Thanksgiving dinner cost families 14% more than last year.\n\nDespite Biden’s assurances that inflation was temporary, the latest numbers indicate that inflation is here to stay – and will likely get worse. Economists project that high inflation will last well into 2022.\n\nAs we look ahead to the 2022 midterm elections, Democrats have every reason to worry.\n\nBut these aren’t just statistics. Higher prices have a tangible impact on family finances and hit lower and middle-class Americans the most. Joe Biden’s disastrous economic policies punish hard-working Americans and demonstrate just how out of touch they are with average citizens.\n\nThere’s also the crisis unfolding at our southern border. A stunning 164,303 illegal immigrants were caught trying to illegally enter the U.S. in October, making it the highest October number in the history of the Department of Homeland Security. In fact, more than 1.4 million illegal migrants have been apprehended crossing the border since Biden took office, while at least 400,000 have successfully snuck into the U.S. illegally in the last 12 months.\n\nThe consequences are serious. The massive influx of migrants has prompted a humanitarian crisis that has overwhelmed our border agents and a national security nightmare that poses a threat to our citizens. And yet, Biden has proved himself either unable or unwilling to act, while \"border czar\" Kamala Harris has consistently avoided a trip to the epicenter of the crisis.\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nAs if these issues weren’t bad enough, consider the Biden administration’s open disdain for parents alarmed by public schools’ radical indoctrination of their children. In a letter to the Biden Department of Justice, the National School Boards Association complained of threats made to school board members by outraged parents and suggested the federal government investigate them as domestic terrorists. In response, Attorney General Merrick Garland announced the DOJ would look into the matter and potentially prosecute parents.\n\nThe public backlash came so quickly that the NSBA apologized, but the DOJ has yet to do the same. In fact, internal emails reveal that the NSBA coordinated with the White House to give the federal government cause for investigation.\n\nAnd while Garland told lawmakers that the DOJ and FBI did not use counterterrorism measures against parents, whistleblower emails reveal that the FBI’s Counterterrorism and Criminal Divisions created a \"threat tag\" to track troublesome parents. Far from legitimate concerns about violence, it seems the letter was a despicable political ploy to intimidate parents into silence.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nScandals and crises like these are why voters in cities and states across the country cast their ballots for Republicans earlier this month. GOP candidates swept all three of Virginia’s top offices and gained the majority in the state legislature. In deep blue Seattle, voters elected a Republican city attorney for the first time in more than 30 years. And all over the Empire State, New Yorkers backed Republican candidates in races for city council, mayor and district attorney. The reason is clear. In less than a year, voters have seen enough of Joe Biden and Democrats to know their policies have failed the American people.\n\nWith Biden underwater, a red wave is coming. As we look ahead to the 2022 midterm elections, Democrats have every reason to worry."
                },
                {
                    "link": "https://www.foxnews.com/media/the-five-democrats-flee-biden-over-fears-of-being-smoked-in-the-midterms",
                    "title": "'The Five': Democrats flee Biden over fears of being 'smoked in the midterms'",
                    "text": "Many congressional Democrats are increasingly fleeing the shadow of their party's leader, President Biden, while the United States continues to socioeconomically falter under his leadership amid anxiety over a possible 2010-like Republican wave in the quickly approaching 2022 midterms.\n\nThe panel on \"The Five\" discussed how Biden's ineffective and unpopular leadership is becoming even more of a drag on a fractured Democratic Party.\n\nOne notable Democrat, Maine Rep. Jared Golden – who holds a seat in an expansive, mostly rural district with a Cook PVI of Republican+6 – said he is not concerned with Biden's popularity because he is personally eclipsing the president by 30 points in his region.\n\nGolden was also the only House Democrat to join Republicans and vote against Biden's socioeconomic overhaul package dubbed \"Build Back Better.\" In 2018, he voted against Rep. Nancy Pelosi, D-Calif., in her bid to remain Speaker of the House, instead casting a vote for Illinois Democratic Sen. Tammy Duckworth.\n\n\"Things [are] getting pretty lonely for President Biden in his own party. Democrats are worried Biden scary poll numbers will lead to a midterm bloodbath and some are making sure to distance themselves from the commander-in-chief,\" host Dana Perino said. Perino added that people in \"vulnerable\" districts like Golden's are distancing themselves from the president.\n\nShe also pointed out that left-wing elected prosecutors in Democratic-run cities nationwide continue to propagate soft-on-crime policies.\n\n\"We saw … with ‘Uncle Larry’ Krasner in Philadelphia spending his whole press conference saying ‘we don’t have a problem, there is nothing happening here, you don’t believe your own eyes, the crime is not up,'\" she said, alluding to recent remarks by the Philadelphia district attorney amid what is the highest murder rate in Pennsylvania's largest city since 1990.\n\nPhiladelphia recently surpassed 500 homicides this year under the watch of Krasner and fellow Democrat Mayor James Kenney. Last week, Kenney blamed Pennsylvania's Second Amendment-friendly Republican-led House and Senate in part for the spike in gun crime, claiming they \"don't care how many people get killed.\"\n\n]Perino and the rest of \"The Five\" panelists said it is also local Democratic officials like Krasner and his Los Angeles counterpart George Gascon who are creating a political issue for national Democrats.\n\nHost Jesse Watters, a Philadelphia native, ripped both Krasner and Biden, saying that the district attorney should \"feel the pain, not spin the pain\" of southeastern Pennsylvanians, while the president separately appears \"out of touch\" with the fears of Americans living with a national crime spike.\n\n\"The [people] feel like the country is going down, down, down and that’s where he looks like he is out of touch,\" Watters said. \"If I was a Democrat running for the reelection, you know what I would do? I would retire and become a lobbyist.\"\n\n\"[W]hy would I want to sit around and dial for dollars if I’m going to get smoked in the midterms? … The donors don’t want to give me any money, they know I’m getting smoked, so what am I going to run for reelection [for]?\"\n\nCLICK TO GET THE FOX NEWS APP\n\nHe added that few Democrats outside of safe districts will want the president to campaign with them, which is a blow to the typical support felt by lawmakers aligned with a president's party.\n\nWatters said that if he were a Democratic lawmaker, he might instead invite Michelle Obama or Secretary of Transportation Pete Buttigieg as a proxy for Biden.\n\n\"[Biden] is not Barack [Obama] … he is not Donald Trump – they were historic and both had huge bases and both of their parties got crushed in the midterms,\" he argued. \"What does Joe have going for him?\""
                },
                {
                    "link": "https://www.foxnews.com/media/democrats-panic-midterms-2024-ingraham",
                    "title": "Democrats in 'hypersonic' panic over the midterms and 2024: Ingraham",
                    "text": "Democrats are headed toward a \"Thelma and Louise\"-like ending, Laura Ingraham said in Friday's opening monologue of \"The Ingraham Angle.\"\n\n\"The old party of FDR and JFK is now more like the party of Thelma and Louise,\" the host said, referencing the 1991 buddy crime movie. Like its titular characters, \"the Democrats are headed full speed ahead to the cliff’s edge,\" she said.\n\n'BOOMING' BIDEN ECONOMY? 'THE FIVE' BLAST LIBERAL MEDIA, DEMS FOR FLATTERING INFLATION COVERAGE\n\nIngraham reported the Republican Party boasts a double-digit lead over Democrats on the generic midterm ballot for the first time ever in the CNBC All-America Economic survey.\n\nWith President Biden's approval rating at 41% and his economic approval rating down 19%, Ingraham noted that suburban residents \"like safe streets, a strong economy and strong border.\"\n\nShe cited a poll that found \"the most important issues for voters are inflation [and] immigration. Dems have bombed on each one,\" she added.\n\nnext Image 1 of 3\n\nprev next Image 2 of 3\n\nprev Image 3 of 3\n\nThe Fox News host continued, saying that Vice President Harris puts the left \"between a rock and a hard place,\" calling her \"an unqualified, unintelligent and unlikable woman as [the] presumptive front-runner\" if Biden does not run for reelection.\n\nSecretary of Transportation Pete Buttigieg puts Democrats \"in even deeper trouble,\" with a predicted 11-percentage-point loss to former President Trump if he ran in 2024.\n\n\"This is what happens when you put diversity over merit,\" Ingraham said. \"Talent and experience always win out.\"\n\n\"The lesson for Republicans is obvious: Trump’s policies worked. There’s no going back to the old perpetual war, open borders, globalist views of yesteryear,\" she continued.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nIngraham said Republicans should \"[U]nveil a new 21st-century contract with America — cut middle class taxes, revive the oil and gas industry through exploration, shake up education, advance small businesses [and] re-invigorate American manufacturing.\""
                },
                {
                    "link": "https://www.foxnews.com/media/joe-concha-red-tsunami-2022-elections-biden-approval-rating",
                    "title": "Joe Concha: 'Red tsunami' coming in 2022 as Biden approval rating plummets",
                    "text": "Fox News contributor Joe Concha predicted there will be a \"red tsunami\" during the 2022 midterm elections as President Biden's approval nosedives to new lows among various topics. Concha joined \"Fox & Friends First\" on Monday, arguing the Biden White House does not want to \"answer the tough questions\" and American voices \"will be heard\" during the elections next year as a result.\n\nBIDEN'S APPROVAL RATING ON CRIME TANKS AMID RISE IN SMASH-AND-GRAB ROBBERIES\n\nJOE CONCHA: We had a massacre in Waukesha, grandmothers and children run over by a murderous madman who never should have been out on bail, and at a time where we can tenuously [have] smash-and-grab looting. We're at a time [when] homicides are skyrocketing in cities from Philadelphia to Chicago to Austin to Los Angeles, and dozens in between. The president doesn't offer up that solution… He takes the weekend off outside of running to Jimmy Fallon on Friday night and then to an award show at the Kennedy Center on Sunday night. Kamala Harris, also at the Kennedy Center, can't be bothered to visit the U.S. southern border or speak with any leaders from Mexico or Nicaragua or Guatemala. Nor she, as a former district attorney and attorney general in California, can be bothered to address crime in any way, shape or form. This is an administration who believes they could ignore a problem or lie about it, and it will eventually go away. They don't want to do the hard work or answer the tough questions and poll after poll, after poll, the American people show they know it and their voices will be heard, believe me, in 2022 in the form of a red tsunami in the House and the Senate.\n\nCLICK HERE TO WATCH THE FULL INTERVIEW:"
                },
                {
                    "link": "https://www.foxnews.com/entertainment/black-juror-jussie-smollett-trial-panel-noose-suspicious",
                    "title": "Black juror in Jussie Smollett trial found one behavior suspicious: 'It didn't add up'",
                    "text": "The only Black juror on the panel that convicted Jussie Smollett of lying to Chicago police said he couldn't get past what the actor did not do after he claimed attackers looped a noose around his neck: Rip it off and keep it off.\n\nIf others saw the noose as Smollett's clumsy effort to portray his attackers as racist, Andre Hope saw much more.\n\n\"As an African American person, I'm not putting that noose back on at all,\" Andre Hope told WLS-TV. At trial, Smollett testified that after the attack in downtown Chicago in January 2019, he returned home and put the rope back around his neck so police who came to his apartment soon after could see it.\n\nHope was not the only Black person who struggled with Smollett's use of such a potent symbol of racism in the U.S. to convince authorities he was the victim of a hate crime.\n\nJUSSIE SMOLLETT'S ‘EMPIRE’ CO-STAR TERRENCE HOWARD SAYS HATE-CRIME HOAX COULD HAVE GOTTEN ‘VERY SCARY,' ‘UGLY’\n\nIn an interview with NewsNation Now after Smollett was found guilty last Thursday, Eddie Johnson — who was Chicago police superintendent in January 2019 when Smollett said he was attacked — said virtually the same thing.\n\n\"I was concerned because I don’t think there’s many Black people in America with a noose around their neck and wouldn’t immediately take it off,\" Johnson said.\n\nHope said the evidence against Smollett was overwhelming. At trial, two brothers testified that Smollett recruited them to carry out the fake attack. Hope said the counter narrative put forth by Smollett's attorneys that the pair had actually planned the attack on Smollett did not make sense.\n\n\"When you just use your common sense as what’s there, yeah it just, it didn’t add up,\" said Hope a 63-year-old father of two who lives in suburban Bellwood, west of Chicago.\n\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\nHope listened to prosecutors argue Smollett staged the hoax because he was angry that the studio where he filmed the television program \"Empire\" did not take hate mail he received seriously. But after all the evidence was presented, after all the witnesses testified, Hope still has one big question.\n\n\"I still have not figured out a motive for why he did, why this had to even happen,\" Hope said. \"He was a star.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSmollett faces up to three years in prison when he returns to court next year for sentencing. But experts have said it is far more likely that he will be placed on probation and ordered to perform community service.\n\nThat would be fine with Hope, who thinks Smollett does not deserve to go to prison. And, he said, he hopes the actor — who testified that he has lost his livelihood — would be given a chance to resume his career."
                },
                {
                    "link": "https://www.foxnews.com/entertainment/beyonce-mom-tina-knowles-jussie-smollett-compassion-sentencing",
                    "title": "Beyonce’s mom, Tina Knowles, says Jussie Smollett should be treated ‘with compassion’ during sentencing",
                    "text": "Tina Knowles, the mother of superstar Beyonce, believes Jussie Smollett should be treated with \"compassion\" during his sentencing.\n\nThe actor was convicted of five counts of disorderly conduct for lying to Chicago police about being the victim of a racist, anti-gay attack near his home in downtown Chicago. The 39-year-old maintains his innocence, and his attorney has said he will appeal the verdict.\n\nWhile the charges carry a possible sentence of three years behind bars, legal experts have said the former \"Empire\" star is unlikely to get prison time for the low-level felonies. Instead, they believe he’s more likely to be sentenced to probation and ordered to perform community service.\n\nKnowles took to Instagram on Monday and posted a screenshot of an article about the case. It also cites the case of Amy Cooper, a white woman arrested last year for calling 911 on a Black birdwatcher in New York City’s Central Park.\n\nJUROR IN JUSSIE SMOLLETT’S TRIAL SAYS THEY WERE DOING HIM ‘A FAVOR’ BY NOT CONVICTING HIM ON 6TH COUNT\n\nHer criminal case was thrown out in February after completing a diversionary counseling program that prosecutors said was meant to educate her on the harm of her actions. Assistant District Attorney Joan Illuzzi-Orbon said Manhattan prosecutors were satisfied with Cooper’s participation in the program and were not seeking to pursue the case any further.\n\n\"The article goes on to say both were wrong but Jussie faces possible prison time and Amy Cooper The woman who called the police and lied about the black man that was Bird watching in Central Park was trying to attack her,\" captioned the 67-year-old.\n\n\"Leading to the potential arrest of the man where in the history of black men In Custody could have led to his death !!\" she shared. \"Amy Cooper got off with public service . We will see the outcome of this for this Black man . Will he get the same compassion as Amy Cooper?\"\n\nKnowles said that she’s not condoning Smollett’s actions. However, she wondered if his race will ultimately result in a harsher sentencing.\n\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\n\"I am not condoning what Mr Smollet was found guilty of,\" wrote the matriarch. \"I am just asking will he get the same compassion and understanding of knowingly lying to police.\"\n\nShe also cited Kyle Rittenhouse, the 18-year-old who was acquitted of all charges in November after testifying he acted in self-defense in the deadly Kenosha shootings. That verdict was met with anger and disappointment among those who saw Rittenhouse as a vigilante and a wannabe cop.\n\nRittenhouse was originally charged with homicide, attempted homicide and reckless endangering for killing two men and wounding a third with an AR-style semi-automatic rifle in the summer of 2020 during a tumultuous night of protests over the shooting of a Black man, Jacob Blake, by a white Kenosha police officer.\n\nRittenhouse, a then-17-year-old former police youth cadet, said that he went to Kenosha to protect property from rioters but that he came under attack and feared for his life. He is white, as were those he shot.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Kyle Rittenhouse walked free after killing two people because the jury had compassion ?\" questioned Knowles.\n\nLawsuits that were on hold pending the outcome of the criminal case concerning Smollett may now move forward. They include a lawsuit the city of Chicago filed against Smollett to recoup over $130,000 it spent investigating what police initially believed was a terrible hate crime.\n\nJudge James Linn set a post-trial hearing for Jan. 27 and said he would schedule Smollett’s sentencing at a later date.\n\nAs for Smollett, it's unlikely he will kick off a successful Hollywood career anytime soon. After prosecutors said the alleged attack was a hoax, Smollett lost his role on \"Empire.\" He later told jurors, \"I've lost my livelihood.\"\n\nThe Associated Press contributed to this report."
                },
                {
                    "link": "https://www.foxnews.com/media/andrew-cuomo-statement-book",
                    "title": "Cuomo fires back at order forcing him to return $5.1M from COVID book: 'Political hypocrisy... at its worst'",
                    "text": "Disgraced ex-New York Gov. Andrew Cuomo remained defiant amid the order he is facing to return the money he received from the book he wrote touting his leadership during the coronavirus pandemic.\n\nNew York state's Joint Commission on Public Ethics (JCOPE) voted 12-1 demanding the Democrat to give back the $5.1 million from the release of his memoir \"American Crisis: Leadership Lessons from the COVID-19 Pandemic,\" which was widely panned as an early victory lap of his response to the virus it was still killing thousands of Americans.\n\nANDREW CUOMO ORDERED TO RETURN MILLIONS FROM PANDEMIC BOOK DEAL FOLLOWING ETHICS PANEL VOTE\n\nCuomo spokesman Rich Azzopardi issued a fiery statement defending his former boss.\n\n\"This is political hypocrisy and duplicity at its worst,\" Azzopardi wrote. \"Governor Cuomo received a JCOPE opinion and advice of counsel stating that government resources could not be used -- and they weren't -- and any staffer who assisted in this project did so on their own time, which was reflected on their timesheets.\"\n\n\"If Speaker Heastie, Majority Leader Stewart-Cousins, and Governor Hochul's JCOPE appointees have created a new standard whereby government staffers cannot volunteer their own time for non-governmental purposes, they should all be equally prosecuted under the same standard and be forced to repay the state for volunteer work on their re-election campaigns,\" Azzopardi added.\n\nCuomo will have to return $5.1 million earned to the state by next month after the watchdog ethics panel concluded that the governor had violated pledges not to use state resources or government staff to prepare the project. The resolution was drafted by commissioner David McNamara. Cuomo, McNamara said, now \"lacked the legal authority to engage in outside activity and receive compensation in regard to the book,\" the New York Post reported.\n\nJANICE DEAN SPEAKS OUT AMID REPORTS TEAM CUOMO SECRETLY PLOTTED TO DISCREDIT HER: 'THIS WON'T STOP MY MISSION'\n\nNew York Attorney General Letitia James is also investigating Cuomo's book deal, along with the FBI, and the Brooklyn US Attorney’s Office.\n\nThe Democrat enjoyed much glowing media coverage at the onset of the pandemic, with even President Biden calling his work the \"gold standard\" of leadership. But in the following months, Cuomo and his administration were condemned for the thousands of COVID-related deaths in New York nursing homes. The governor then faced several allegations of sexual harassment by former staffers. He resigned in disgrace last August following a report from the state attorney general that concluded he had sexually harassed at least 11 women from 2013 to 2020.\n\nCuomo's little brother, recently-ousted CNN anchor Chris Cuomo, was also wrapped up in the governor's scandals. Documents revealed he had helped his older brother as an unofficial adviser and even used his media influence to try and dig up dirt on the governor's accusers, in addition to spying on investigative journalists' reports on the scandal. CNN fired Chris Cuomo after these revelations.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nFollowing Chris Cuomo's firing, CNN discovered he, too, had fielded a second sexual harassment allegation following an accusation from her former ABC colleague Shelley Ross.\n\nChris Cuomo, like his older brother, has also had recent troubles with his book. In the wake of his CNN controversies, HarperCollins canceled his forthcoming title, \"Deep Denial.\"\n\nFox News' Cortney O'Brien contributed to this report."
                },
                {
                    "link": "https://www.foxnews.com/media/cuomo-ordered-return-pandemic-book-money",
                    "title": "Andrew Cuomo ordered to return milllions from pandemic book deal following ethics panel vote",
                    "text": "Disgraced ex-New York Gov. Andrew Cuomo will be forced to return the money from the proceeds of his book written during the COVID-19 pandemic after a 12-1 vote by the Joint Commission on Public Ethics.\n\nCuomo will have to return $5.1 million earned to the state by next month after the watchdog ethics panel concluded that the governor had violated pledges not to use state resources or government staff to prepare the project. The resolution was drafted by commissioner David McNamara. Cuomo, McNamara said, now \"lacked the legal authority to engage in outside activity and receive compensation in regard to the book,\" the New York Post reported.\n\nCuomo's book, titled \"American Crisis: Leadership Lessons from the COVID-19 Pandemic,\" was widely criticized when it was released in October 2020 because it seemed as though the Democratic governor was taking credit for sterling leadership while the pandemic was still raging in New York.\n\nJANICE DEAN SPEAKS OUT AMID REPORTS TEAM CUOMO SECRETLY PLOTTED TO DISCREDIT HER: 'THIS WON'T STOP MY MISSION'\n\nHe enjoyed much glowing media coverage at the onset of the pandemic, with even President Biden calling his work the \"gold standard\" of leadership. But in the following months, Cuomo and his administration were condemned for the thousands of COVID-related deaths in New York nursing homes. The governor then faced several allegations of sexual harassment by former staffers. He resigned in disgrace last August following a report from the state attorney general that concluded he had sexually harassed at least 11 women from 2013 to 2020.\n\nNew York Attorney General Letitia James is also investigating Cuomo's book deal, along with the FBI, and the Brooklyn US Attorney’s Office.\n\nNEW YORK AG LETITIA JAMES BLASTS ANDREW CUOMO'S CRITICISM OF SEXUAL HARASSMENT INVESTIGATION: ‘MOVE ON’\n\nProminent New Yorkers and lawmakers who had spoken out about Cuomo throughout his many scandals said Tuesday's news was a good first step toward accountability.\n\nCuomo's little brother Chris was also wrapped up in the governor's scandal. Documents revealed he had helped his older brother as an unofficial adviser and even used his media influence to try and dig up dirt on the governor's accusers, in addition to spying on investigative journalists' reports on the scandal. CNN fired Chris Cuomo after these revelations. Following Chris Cuomo's firing, it discovered he, too, had fielded a second sexual harassment allegation following an accusation from her former ABC colleague Shelley Ross, but it is unclear whether the alleged misconduct played a role in the termination.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nChris Cuomo, like his sibling, has also had recent troubles with book deals. In the wake of his CNN controversies, HarperCollins canceled his forthcoming title, \"Deep Denial.\""
                },
                {
                    "link": "https://www.foxnews.com/politics/house-votes-to-hold-mark-meadows-in-contempt-of-congress",
                    "title": "House votes to hold Mark Meadows in contempt of Congress",
                    "text": "NEW You can now listen to Fox News articles!\n\nThe House of Representatives voted Tuesday in favor of a resolution to hold former White House chief of staff Mark Meadows in contempt of Congress.\n\nJAN. 6 COMMITTEE VOWS CONTEMPT PROCEEDINGS IF MARK MEADOWS FAILS TO APPEAR\n\nThe vote comes a day after the House Select Committee investigating the Jan. 6 attack on the U.S. Capitol voted 9-0 to recommend Meadows for prosecution after he refused to testify before the panel. The resolution was adopted in a 222-208 vote. Reps. Adam Kinzinger and Liz Cheney voted with Democrats.\n\nThe seven Democrats on the panel were joined by its two Republicans Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois.\n\n‘THIS IS ABOUT DONALD TRUMP’: MARK MEADOWS RESPONDS TO JANUARY 6th CMTE VOTE RECOMMENDING CRIMINAL CHARGES\n\nThe House vote sends the matter to the U.S. attorney's office in Washington, where it will now be up to prosecutors in that office to decide whether to present the case to a grand jury for possible criminal charges.\n\nThe move was seen by some as a game of politics.\n\n\"Americans can barely afford groceries. Gas prices are up. Crime is skyrocketing. And what do Democrats do? Punish their political foe in the dead of night, with no one watching. Pathetic,\" Rep. Jim Jordan, R-Ohio, tweeted.\n\nThe vote occurred after the Jan. 6 Committee Chairman Bennie Thompson, D-Miss., in a 51-page report released late Sunday, blamed Meadows for being in contact with at least some of the private individuals \"who planned and organized a January 6 rally, one of whom reportedly may have expressed safety concerns to Mr. Meadows about January 6 events.\"\n\n\"Mr. Meadows used his personal cell phone to discuss the rally in the days leading up to January 6,\" he wrote.\n\nMeadows responded late Monday to the House committee's vote, telling Fox News host Sean Hannity that the recommendation from the committee is \"disappointing, but not surprising.\"\n\nMEADOWS ATTORNEY SAYS CONTEMPT CHARGE WOULD BE ‘MANIFESTLY UNJUST’\n\n\"Let’s be clear about this, this is not about me, holding me in contempt,\" said Meadows. \"It’s not even about making the Capitol safer. We’ve seen that by the selective leaks that are going on right now. This is about Donald Trump and about actually going after him once again.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nMeadows, a former North Carolina congressman who also served as the chairman of the House Freedom Caucus, was previously cooperating with the committee's investigation into the events surrounding the Jan. 6 attack on the Capitol. He later stopped working with the investigators and is now suing them.\n\nFox News' Edmund DeMarche and the Associated Press contributed to this report"
                },
                {
                    "link": "https://www.foxnews.com/entertainment/leonardo-dicaprio-meryl-streep-dont-look-up",
                    "title": "Leonardo DiCaprio opposed Meryl Streep’s nude scene in ‘Don’t Look Up’ for this reason, Adam McKay says",
                    "text": "Leonardo DiCaprio didn’t want Meryl Streep stripping down in their film \"Don’t Look Up.\"\n\nThe claim was made by the film’s director, Adam McKay, who said the actor, 47, felt the actress, 72, was too much of an icon to go nude in front of cameras for the comedy.\n\nStreep stars as President Janie Orlean, who is seen naked from behind in one scene. While the Oscar winner employed a body double, DiCaprio allegedly still felt uneasy about the idea.\n\n\"She is fearless,\" McKay recently told The Guardian. \"And yes, that is a body double. But you know who had a problem with it? Leo [DiCaprio]. Leo views Meryl as film royalty… although maybe royalty is not a compliment… but as such a special figure in the history of film.\"\n\nJULIANNE HOUGH SAID LEONARDO DICAPRIO WAS NOT ‘GOOD IN BED,’ HER NIECE CLAIMS\n\n\"He didn’t like seeing her with the lower back tattoo, walking for a second naked,\" McKay continued. \"He said something to me like, ‘Do you really need to show that?’ And I was like, ‘It’s President Orlean; it’s not Meryl Streep.’ But she didn’t even blink. She didn’t even bring it up.\"\n\nReps for DiCaprio and Streep didn’t immediately respond to Fox News’ request for comment.\n\nThe two stars have known each other for decades now. Streep played DiCaprio’s mother in the 1996 drama \"Marvin’s Room.\"\n\nDiCaprio recently told E! News that the rest of the \"Don’t Look Up\" cast was nervous to work alongside the veteran leading lady. The film also stars Jennifer Lawrence, Jonah Hill, Cate Blanchett, Tyler Perry, Ron Perlman and Timothée Chalamet among others.\n\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\n\"You get to work with the greatest living actor in the world,\" DiCaprio shared. \"Everyone’s on their toes. Everyone’s prepared, and we’re just trying to keep up with her.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nDespite her lengthy career in Hollywood, Streep has never done a full-frontal nude scene. In 1982, she was seen topless on a massage table in the film \"Still of the Night.\" However, the actress was expertly covered with a towel.\n\nIn her 1983 film \"Silkwood,\" Streep’s character flashes at her co-worker. In 1994’s \"The River Wild,\" Streep strips down for a skinny-dipping scene. And then in 1995, she had a steamy sex scene with co-star Clint Eastwood in \"The Bridges of Madison County.\""
                },
                {
                    "link": "https://www.foxnews.com/opinion/tucker-carlson-liz-cheney-january-6",
                    "title": "Tucker: Liz Cheney is lying to you about Jan. 6",
                    "text": "NEW You can now listen to Fox News articles!\n\nIf you live in Manchester, New Hampshire, first of all, congratulations, it's a really nice place. But second, we thought we'd give you an explanation for what you may have just seen. So if you live there and last month, you thought you saw Liz Cheney wandering around downtown Manchester, no, you were not hallucinating. Liz Cheney was there. And that's pretty weird if you think about it. Not a lot of people go to Manchester, New Hampshire, in November, so it probably wasn't a family vacation. Nor is it likely that Liz Cheney went up there by accident. Manchester is an eight-hour drive from her home in the D.C. suburbs, and more to the point, it's also eight hours from the CNN studios in downtown Washington that she inhabits more often than most of us go to church and much more reverently.\n\nManchester is also, not that it matters to her, more than 2,000 miles from Wyoming. That's the state that she supposedly represents in the U.S. Congress.\n\nSo the question is: What was Liz Cheney doing in Manchester, New Hampshire, and of course, there's only one conceivable answer. Liz Cheney plans to run for President of the United States.\n\nMARK MEADOWS RESPONDS TO POTENTIAL CONTEMPT CHARGES FROM JANUARY 6 COMMITTEE: ‘FISHING EXPEDITION’\n\nNow, if that sounds demented, yeah, it’s because it is, but it's also real. Now, you may be wondering if Liz Cheney were to run for president, what exactly would she run on? She doesn't like Trump. OK. But what would her platform be? We know the answer to that because Liz Cheney only cares about one thing and only ever has, and that is starting pointless wars in faraway countries. The more pointless the war, the farther away, the better it is. Droning peasants makes Liz Cheney feel powerful. It's been the great cause of her life.\n\nBut you have to ask, do a lot of voters agree with her on that? Is there a massive national constituency for more Iraq invasions? We've seen the polling on that, and in a word, no. There's not a massive national constituency for Liz Cheney's foreign policy views. Just the opposite, in fact. People live outside D.C. do not support more pointless wars that do nothing for the United States or its core interests. They're not eager to send their kids to die for eastern Ukraine, and the reason they're not is they've already done it. They fought a lot of wars like this because Liz Cheney told them to and they've had enough.\n\nYet apparently, Liz Cheney is the last person who doesn't know this. She has literally no idea. She believes she has a shot at the Republican nomination for president, and she believes that fervently enough to fly to Manchester, New Hampshire, in the middle of November. So what can we conclude from this behavior? Not looking at what she says, but what she's doing? And the only answer is Liz Cheney is delusional. She's living on another planet, and on that planet with her is the Republican Party's fading leadership class. The people who stopped assessing reality are having new thoughts of any kind, right, around 2003. That's the era in which they are frozen in amber.\n\nAnd those people are sending Liz Cheney a ton of money, huge amounts of money because they wanted to run for president. Cheney has raised millions of dollars just this year, in part from political action committees run by Mitt Romney and Mitch McConnell, and, needless to say, Lindsey Graham. Apparently, all of these geniuses think that Liz Cheney has a good shot of being president.\n\nSo Liz Cheney is this cycle's Jeb Bush, who, by the way, has also given her money because of course he has. Now you should know that none of these people, and they are the very same people who feel perfectly empowered to lecture you about what's conservative and what's not, not one of these people has said a single word about Liz Cheney’s performance on the House of Representatives January 6th Commission. That commission is now in the process of trying to hunt down and destroy anyone to the right of Adam Kinzinger, who himself is on the committee, and we should tell you, still bursting into tears quite a bit.\n\nLET THE PEOPLE BACK INTO THEIR CAPITOL\n\nThe Jan. 6 Committee has become the American version of a Soviet show trial or overstating it. You think? Well watch it for yourself on C-SPAN? Come to your own conclusions. We'll tell you this: The Jan. 6 committee has somehow awarded itself the power to seize the personal communications of its political enemies and then make them public. The arguments really simple: Turn over your text messages or we're going to send you to jail.\n\nLet's not lie about this. The point of this exercise is not to uncover crimes. The January 6 committee hasn't found any crimes, and at this point will not find any crimes. The point is to harm and humiliate the people you disagree with politically, and that's what they're doing.\n\nSo yesterday, in case you missed it, Liz Cheney found herself with a list of text messages to and from Mark Meadows. Meadows was Donald Trump's last White House chief of staff. Now, those texts showed no evidence of any crime whatsoever. But since she had them, Liz Cheney thought they might be embarrassing to conservatives, so she read them on television. Some of those texts, it turns out, were from anchors here at Fox News, and Liz Cheney took special delight in reading those.\n\nCHENEY: According to the records, multiple Fox News hosts knew the president needed to act immediately. They texted Mr. Meadows and he has turned over those texts.\n\nNotice the faux seriousness, according to the record. Now, before we get into the details of what is in those texts, just step back for a second and consider what we just saw. We now live in a country where none of your private communications are safe from the eyes of power-drunk politicians like Liz Cheney. Liz Cheney can harness the awesome power of the national security state to seize your personal text messages and then read them into the congressional record. And guess what? There's nothing you can do about it, Mr. Citizen. We don't care.\n\n‘THIS IS ABOUT DONALD TRUMP’: MARK MEADOWS RESPONDS TO JANUARY 6TH CMTE VOTE RECOMMENDING CRIMINAL CHARGES\n\nSo your texts, effectively your daily diary, now belong to Liz Cheney. And the question all of us, no matter who we voted for, have to ask ourselves is: Do we really want to live in a country like that? Well, probably we don't.\n\nPrivacy isn't just a nice thing to have, it's not an ancillary concern, privacy is morally essential. Privacy is a prerequisite for freedom. You can't have liberty without privacy. And that, needless to say, is the whole point of the spectacle. To let you know that we don't have freedom anymore, and Liz Cheney is really in charge.\n\nBut what's extra amazing about what Liz Cheney just did, and this is the reason you know this is a show trial, purely political and totally disconnected from reality, much less law, is that the text message that she read yesterday were exculpatory. They didn't make her case. They undercut her case.\n\nThree Fox anchors sent messages to Mark Meadows, and none of them cheered what was happening at the Capitol on Jan. 6. In fact, they were upset by it, even in private, when they assume no one was listening. And that shouldn't surprise you. These are principled people, what they say in public is not that far from what they say over text message.\n\nIf you get a text from Brian Kilmeade, it sounds pretty much identical to Brian Kilmeade on Fox & Friends. These are not phonies. We can personally confirm that. Whether you like them or not, they're real.\n\nSo Fox anchors on TV and in private opposed the BLM riots in the summer of 2020. Fox anchors opposed the riot on Capitol Hill in January 2021. It turns out that Fox anchors opposed riots. All riots. No matter who's rioting. And we're the only news anchors in the United States of America who do this. The other channels wait to see who the rioters voted for, and then they respond accordingly, as you may have noticed.\n\nSo the texts that Liz Cheney read aloud yesterday were a tribute to the people who wrote them, but because she is a liar, Liz Cheney attempted to twist these texts into proof of some kind of conspiracy. Part of the insurrection storyline, which, by the way, is getting very old. If Jan. 6 was an insurrection, we'll believe anything, where’s the evidence of that?\n\nCNN FLOATS POSSIBLE REPLACEMENTS FOR BIDEN IN 2024\n\nHas Liz Cheney shown that a single prominent Republican in the United States of America plotted to overthrow the government of the United States? Well, no, she hasn't. Not one. As with the prosecution of Kyle Rittenhouse, Liz Cheney is proving the defendant's case inadvertently, and of course, she's lying. They all are. The entire Jan. 6 committee is lying, and they're not even lying very artfully repeatedly in just the last few days, nearly a year after it happened. The record is settled. We know the facts, Democrats have continued to claim, contrary to the facts, that many people were killed at the Capitol on January 6th.\n\nSandy Cortez, who has some kind of power in American society, wrote that \"138 were injured, almost 10 dead\" in what she called the \"terror attack on the Capitol.\" Meanwhile, Ayanna Pressley of Massachusetts told America that the insurrection quote \"brought great trauma, injury and loss of life.\"\n\nReally great loss of life? Who are all these dead people? Can you be a lot more specific? Ayanna Pressley? AOC? Jan. 6 committee? No they can't because they're lying. Only one person was intentionally killed on January 6th. Who was that? Well, she was a Trump supporter. She was called Ashli Babbitt, and she was shot in the chest without warning by one of Liz Cheney's bodyguards. Those are the facts that they are lying about.\n\nSo how can you trust a congressional committee that tells lies this obvious? You can't. And yet the White House has endorsed all of this. Joe Biden himself claims on the basis of no evidence whatsoever that Jan. 6 was an outbreak of White supremacy.\n\nJoe Biden, October: We’re confronting the stains of what remains — the deep stain on the soul of the nation: hate and white supremacy. // The violent, deadly insurrection on the Capital nine months ago was about white supremacy in my view.\n\nSo that's just ugly race politics. By the way, that was in October, when we know all the facts. There was no racial angle to January 6. What was January 6th? Well, there was destruction of property which were totally opposed to. But what motivated why were all those people there?\n\nWell, for the most part, a year later, it's very clear January 6th was essentially what it appeared to be. Thousands of ordinary American citizens, voters, people who believe in our democracy far more fervently than Liz Cheney ever has, came to Washington because they sincerely believed democracy had been thwarted. They believed the presidential election was unfair, and they have a right to believe that, and by the way, in many ways, they were correct. The presidential election was unfair, and you don't have to get into anything about voting machines to believe that.\n\nConsider the facts that we know. As Election Day approached, Verizon, T-Mobile and AT&T shut down the Trump campaign's ability to send text messages and then Google, this has never even been reported, but it is widely known, Google prevented the Trump campaign from raising money over Gmail. There's no precedent for that. The Trump reelection campaign lost millions in donations. That was the whole point of it.\n\nSo the most powerful companies on planet Earth, heavily regulated by the government benefiting from government contracts, swung behind Joe Biden and tried to stop Donald Trump, the sitting president, in his tracks.\n\nIs that fair? Is that the democracy that Liz Cheney is always lecturing you about? Honestly, what's the answer? These are legitimate questions. Instead of answering them, Cheney has pushed to throw protesters in jail. OK, if someone broke the law, punish that person. That applies to BLM activists as much as it does to QAnon people. We’re for enforcing the law fairly, equitably. But we also think that as you do that, if a mass of people show up angry at the Capitol, you should least pause for a second if you believe in democracy and ask ‘what are they angry about?’ Maybe we should address their concerns.\n\nBut Liz Cheney won't. And those aren't the only questions that she won't answer. Here are a few other questions she won't answer. Who is the person dressed in black who we were told dropped pipe bombs all over Capitol Hill the night before on January 5th? That person, the mad bomber, is on his cell phone. Well, that's interesting because according to criminal indictments that we have seen, the feds have used cell phone geolocation to arrest dozens of people who are present on Jan. 6th. But not this person. They haven't found this person. They haven't even identified this person. They've stopped talking about this person. Why is that? Liz Cheney?\n\nAnd while we're at it, here's another question. What exactly was the role of Ray Epps in the chaos of Jan. 6th? We ask because Ray Epps is on video on both January 5th and January 6th, encouraging people to enter the Capitol building, which is to say to break federal law. And as he says this in this video, you'll notice, people in the crowd immediately identify him as a \"Fed.\"\n\nRAY EPPS JAN. 5: We need to go into the Capitol. … I’m going to put it out there, I’m probably going to go to jail for it okay? Tomorrow we need to go into the Capitol! Into the Capitol!\n\nCROWD: What? No! (chant) Fed! Fed! Fed! Fed!\n\nRAY EPPS, JAN. 6: Ok folks, spread the word. As soon as the president is done speaking, we go to the Capitol. The Capitol is this direction.\n\nWell, that's amazing. Look, we're not prosecutors, but by the standards of Jan. 6, if you take a look at what people are spending a year in jail for, that looks like a crime. Ray Epps encouraged others to breach the Capitol.\n\nAnd yet, as far as we know, Ray Epps has not been prosecuted or even charged. I mean, maybe he has. Tell us if you know differently. Liz Cheney.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nBut if he hasn't, how come? Did reps have any contact with federal law enforcement agencies before the Capitol was stormed on Jan. 6th? Liz Cheney has called us \"unpatriotic\" for asking that question. But it's not an unpatriotic question. It's a legitimate, very straightforward question. And American citizens have a right to know the answer, but Liz Cheney won't answer it. Why?\n\nWe asked her to come on our show and explain. She refused, of course, because she's a coward. Most neocons are. But until Liz Cheney answers that basic question, there is no reason to play along with her charade. There is certainly no reason that any American citizen should even consider surrendering personal text messages to her or the Jan. 6th committee. If they're going to lie to us and hide essential information from the public, there's no reason to participate, no matter what they say.\n\nThis article is adapted from Tucker Carlson's opening commentary on the December 14, 2021 edition of \"Tucker Carlson Tonight.\""
                },
                {
                    "link": "https://www.foxnews.com/sports/michele-tafoya-nbc-nfl-sunday-night-football-kaepernick-the-view",
                    "title": "Michele Tafoya’s NBC role changing after Kaepernick remarks on ‘The View’: report",
                    "text": "Michele Tafoya will no longer be the sideline reporter for NBC’s \"Sunday Night Football\" after this season, according to a report.\n\nNBC’s coverage of the upcoming Super Bowl in February is expected to be her final appearance on the sideline for the network, the New York Post reported. Her role afterward remained unclear.\n\nThe apparent decision comes several weeks after Tafoya was criticized for making comments about former NFL quarterback Colin Kaepernick during an appearance on ABC’s \"The View.\"\n\nTafoya returned to NBC for a few games after \"The View,\" but has been missing from NBC’s NFL coverage since Thanksgiving Night’s game between the Buffalo Bills and New Orleans Saints.\n\nCOLIN KAEPERNICK SAYS RITTENHOUSE VERDICT ‘VALIDATES THE NEED TO ABOLISH OUR CURRENT SYSTEM’\n\nHer absence was described by NBC as \"bye weeks\" as speculation swirled that something might be amiss in the relationship between Tafoya and the network, the Post reported.\n\nSports analyst Bill Simmons drew attention to Tafoya’s prolonged absence earlier this week on his podcast.\n\n\"She was in the conservative seat,\" Simmons said about Tafoya’s \"View\" appearance, \"Then a couple weeks later, all of a sudden, just on a bye [from NBC]. Taking a break.\"\n\nTafoya, 56, a native of California, has been with NBC for about a decade after previous stints with CBS and ABC/ESPN. She is the winner of five Emmy Awards for her sports reporting.\n\nOn Nov. 3, she and the co-hosts of \"The View\" had a debate about Kaepernick around the time that Netflix released a special titled \"Colin in Black and White.\"\n\nTafoya and \"View\" co-host Sunny Hostin clashed on the show about some comments Kaepernick had made, comparing the NFL’s draft and training camps to slavery.\n\n‘THE VIEW’ GUSHES OVER HILLARY CLINTON'S WOULD-BE 2016 VICTORY SPEECH: ‘SHE DID WIN’\n\nTafoya argued that playing in the NFL was an act of free will.\n\n\"No one pressures them,\" she said. \"They’re not forced to go into the NFL.\"\n\nLater, she added, \"I thought comparing it to the slave trade was a little rough. … These guys enter willingly. They are the most well-cared-for people. Yes, they play a hard sport, and every one of them – Black, White, Latino, whoever’s playing the sport – will tell you how much they love it and they’re willing to do it and they make a damn good living.\"\n\nHostin countered that most NFL owners are White men and most players are Black.\n\n\"That comparison that he makes to slave owners and slaves is not, sort of, totally unreasonable or out of bounds,\" she said.\n\nShe asserted that it was the league’s White owners who were preventing Kaepernick from continuing his NFL career after the 2016 season, when he launched pre-game kneeling protests of racial injustice during the playing of the national anthem. After the 2016 season, Kaepernick exercised an opt-out clause in his contract with the San Francisco 49ers and became a free agent. No NFL team signed him afterward.\n\nKaepernick and former teammate Eric Reid later reached settlement agreements with the league.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nHostin also argued that Kaepernick \"lost everything\" by taking a stand on a cause that he believed in but Tafoya countered by noting that Kaepernick had actually \"gained a lot\" since leaving the NFL, including the Netflix special and a lucrative deal with sports apparel company Nike.\n\nKathryn Tappen is said to be a top candidate to replace Tafoya as the sideline reporter on \"Sunday Night Football,\" the New York Post reported.\n\nNBC has not commented on Tafoya's role and Tafoya could not be reached, the Post reported.\n\nFox News’ Brandon Gillespie contributed to this story."
                },
                {
                    "link": "https://www.foxnews.com/us/alabama-georgia-jeremy-tremaine-williams-kamarie-holland",
                    "title": "Alabama sheriff alleges ‘sexual encounter’ as motive in 5-year-old girl's slaying, suspect held without bail",
                    "text": "A missing 5-year-old Georgia girl is dead and an acquaintance of her mother is being held without bail on a capital murder charge in an Alabama jail.\n\nKamarie Holland went missing from her Columbus, Georgia, home Monday before police found her remains that night across state lines in Phenix City, Alabama, according to authorities.\n\n\"I definitely think the motive was a sexual encounter,\" Russell County Sheriff Heath Taylor said during a news briefing on the case Tuesday, adding that the suspect had been eyed in at least three other cases with child victims.\n\nSUSPECT IN MURDER OF 5-YEAR-OLD GIRL INVOLVED IN PREVIOUS CHILD ABUSE CASES, SHERIFF SAYS\n\nInvestigators identified her suspected killer as Jeremy Tremaine Williams, who has a record of child abuse allegations in multiple states. Police arrested him at the Bamboo Motel in Phenix City, about 9 miles from the girl’s home.\n\nBy Tuesday afternoon, he found himself standing before an Alabama judge.\n\nDuring the court appearance, a public defender assigned to the case requested and received a gag order from Judge David Johnson, according to the Columbus-based WRBL.\n\nNow Williams is being held at the Russell County Jail without bond, officials there said.\n\nTaylor said deputies found Kamarie dead from asphyxiation in an abandoned home where Williams once lived in Phenix City.\n\n\"It did appear from the scene that there was some sexual abuse,\" he added.\n\nThe results of an official autopsy were pending, and the sheriff said investigators hoped to recover DNA evidence.\n\nRussell County Coroner Arthur Sumbry said Tuesday evening that he expected to have forensic findings available before the weekend.\n\nKamarie’s mother told police she woke up around 5:50 a.m. Monday and discovered her front door was open -- and her daughter was gone, Taylor said. She reported her missing to the Columbus Police Department in Georgia, and officers there zeroed in on Williams, who had ties across the state line.\n\n\"This started in Columbus, and it ended in Phenix City,\" the sheriff said.\n\nAlabama prosecutors are charging Williams with capital murder and Taylor said that additional charges against other suspects could be forthcoming.\n\nWRONG-WAY DRIVER HORRIFIES ALABAMA CHRISTMAS PARADE-GOERS\n\nWilliams’ uncle was also present at the hotel when deputies made the arrest, but investigators do not believe he was involved, the sheriff said.\n\nThe murder suspect had been acquitted of child abuse charges in Alabama in 2012, the sheriff said. The outcome of separate charges in Georgia were not immediately clear. State records show that a man with the same name currently has charges pending for alleged battery and child cruelty in connection with an incident in August 2021.\n\n\"And then we have information where he was a suspect in a 1-year-old death in Alaska, where he was a suspect but never charged because [investigators were] not able to get enough evidence in that case,\" Taylor said.\n\nHowever, he is not a registered sex offender. The investigation remains ongoing.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"It’s a sad time to have to speak about a 5-year-old,\" Taylor said. \"We’re having to work a case on a child who absolutely did nothing wrong.\"\n\nIf convicted, Williams faces a minimum sentence of life in prison without parole, according to Russell County Chief Assistant District Attorney Rick Chancey. The maximum sentence would be the death penalty."
                },
                {
                    "link": "https://www.foxnews.com/entertainment/ben-affleck-trapped-marriage-jennifer-garner-still-drinking",
                    "title": "Ben Affleck 'still would've been drinking' if he'd stayed married to Jennifer Garner",
                    "text": "Ben Affleck revealed he'd probably still be drinking if he had remained \"trapped\" in marriage with Jennifer Garner.\n\nAffleck, 49, opened up about the end of his marriage to Garner, 49, during a recent appearance on Sirius XM's \"The Howard Stern Show.\"\n\n\"We probably would’ve ended up at each other’s throats. I probably still would’ve been drinking,\" Affleck told Stern (via Page Six).\n\n\"Part of why I started drinking was because I was trapped,\" he explained.\n\nJENNIFER LOPEZ REPORTEDLY FEELS BEN AFFLECK ROMANCE IS ‘TRULY MEANT TO BE’\n\nDrinking had been Affleck's solution to dealing with his unhappy marriage.\n\n\"I was like, ‘I can’t leave because of my kids, but I’m not happy. What do I do?’ And what I did was [I] drank a bottle of scotch and fell asleep on the couch, which turned out not to be the solution.\"\n\n\"Ultimately, we tried, we tried, we tried because we had kids, but both of us felt like we didn’t want this to be the model that our kids see of marriage,\" Affleck added.\n\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\nAffleck slammed tabloids for getting the story about his divorce from Garner wrong. He also claimed the relationship ended on good terms.\n\n\"Everything you read [in the news about the divorce] was bulls---. The truth was we took our time, we made our decision … We grew apart,\" he said. \"We had a marriage that didn’t work. This happens. She’s somebody I love and respect, but to whom I shouldn’t be married any longer.\"\n\n\"We did it amicably\" Affleck said. \"We did our best. Did we have moments of tension? Did we have disagreements over custody? Was stuff difficult for us? Did we get angry? Yes, but fundamentally, it was always underpinned with a respect. I knew she was a good mom. I always hoped she knew I was a good dad. I knew I was.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSince finalizing his divorce with Garner in 2018, Affleck struggled with sobriety and reentered the dating scene. Recently, Affleck rekindled his relationship with Jennifer Lopez.\n\nThe \"Hustlers\" star and \"Argo\" director were previously engaged for roughly two years. The two split in 2004, and Affleck later married Garner in 2005."
                },
                {
                    "link": "https://www.foxnews.com/media/laura-ingraham-liz-cheney-media-meadows-texts",
                    "title": "Laura Ingraham blasts Liz Cheney, media over Meadows texts; replays her riot condemnations",
                    "text": "After Wyoming GOP Rep. Elizabeth Cheney read texts from three Fox News hosts to then-White House Chief of Staff Mark Meadows into the Congressional Record during the latest House January 6 Committee hearing, Laura Ingraham pushed back on claims and insinuations that she was being irresponsible, hypocritical or not publicly professing her true opinion of the rioting that was going on at the time.\n\nEarlier Tuesday, Cheney -- previously appointed the vice-chair of the committee by its leader, Mississippi Democratic Rep. Bennie Thompson after most of the party-leadership-assigned Republicans were blocked from participating earlier this year – read aloud text messages between Ingraham, Sean Hannity, and Brian Kilmeade to Meadows individually on the day of the riot.\n\n\"This sent the left-wing media hacks into ‘Spin & Defame’ mode. Of course the regime media was trying to twist this message to try and tar me as a liar and hypocrite who privately sounded the alarm on January 6 but privately downplayed it,\" she said.\n\nCheney, a vocal opponent of former President Trump, said in Congress Tuesday that Ingraham and others \"knew [Donald Trump] needed to act immediately\".\n\n\"Mark, the president needs to tell people in the Capitol this is hurting all of us – he is destroying his legacy,\" she read from Ingraham's messages. Meadows has since been pursued on contempt charges from the committee after halting cooperation most recently.\n\nIngraham said late Tuesday that the insinuated idea that she publicly egged on the rioters, ostensibly as a supporter of the purported pro-Trump cause, was a \"big lie\" being disseminated by Cheney and newspaper reporters like Aaron Blake of the Washington Post.\n\nShe pointed to a lengthy tweet from Blake from earlier in the day, saying he \"grossly mischaracterized what I said in an attempt to smear me.\"\n\n\"[Blake] was not alone. CNN’s chief propagandist Brian Stelter joined on the smearfest writing that ‘they all knew the truth right away by the night of January 6, Ingraham was spouting conspiracy theories… based on a lie she pushed over and over again’,\" she said, reading from Stelter's comments at one point.\n\nIngraham said she never supported election \"conspiracy theories\" about a stolen 2020 election as accused by Stelter.\n\nShe added that claims Stelter made about her claiming the Marxist group Antifa had infiltrated the protesters were indeed clarified by Ingraham upon further reportage as \"not substantiated.\"\n\n\"Another inconvenient fact those little men left out: Had they bothered to actually watch what I said the night of January 6 or read any of my public tweets from the afternoon of January 6, they couldn't have denied the truth.\n\nShe then replayed parts of her \"Angle\" from that evening's show:\n\n\"The Capitol was under siege by people who can only be described as antithetical to the MAGA movement. Now they were likely not all Trump supporters, and there were some reports that Antifa sympathizers may have been sprinkled throughout the crowd.\n\n\"The point remains, if you were a Trump supporter trying to display your support for the president, today's antics at the Capitol did just the opposite.\n\n\"Those who breached the Capitol Hill security today, whoever they were, they were criminals. I’ve been to literally dozens of Trump events, and the criminal actions we saw today do not represent this movement.\"\n\n\"Does that sound like I was downplaying it to you,\" she asked. Ingraham then read her public tweets from January 6 as well:\n\n\"Security breach at the Capitol is disgraceful and the president needs to tell everyone to leave the building now. 2:44 P.M. Anyone thinks this is gonna the MAGA movement is delusional. It hurts the movement, the Trump legacy and of course the country.\"\n\n\"The president should order [National Guard] to secure the Capitol immediately.\"\n\n\"When there’s any big crowd there will invariably be bad actors, but blame will be laid at the feet of the White House if Capitol not cleared quickly.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Now this is all public record, kids,\" Ingraham concluded. \"The real big lie is the expansive narrative of January 6th that these clowns have made the center of the political existence. So it’s time to face facts, shut down the false narrative and treat Cheney and her clique the way the American people treat them: by tuning them out.\""
                },
                {
                    "link": "https://www.foxbusiness.com/politics/elon-musk-calls-elizabeth-warren-senator-karen",
                    "title": "Elon Musk calls Elizabeth Warren 'Senator Karen' after she claimed he is 'freeloading off everyone else'",
                    "text": "Tesla CEO and SpaceX founder Elon Musk took aim at Sen. Elizabeth Warren, D-Mass., on Tuesday, referring to her as \"Senator Karen\" after she claimed he does not pay taxes and is \"freeloading off everyone else.\"\n\n\"Let’s change the rigged tax code so The Person of the Year will actually pay taxes and stop freeloading off everyone else,\" Warren wrote in a tweet attacking Musk, who was named Time's Person of the Year for 2021 on Monday.\n\nELON MUSK NAMED TIME'S 'PERSON OF THE YEAR' FOR 2021\n\n\"Stop projecting,\" Musk wrote in response, linking to a 2019 opinion piece from political consultant Bradley Blakeman, which classifies Warren as a \"fraud\" following her claims of Native American ancestry.\n\n\"You remind me of when I was a kid and my friend’s angry Mom would just randomly yell at everyone for no reason,\" added Musk, the world's richest man. \"Please don’t call the manager on me, Senator Karen.\"\n\nFurther responding to Warren's accusations that he does not pay taxes, Musk tweeted: \"And if you opened your eyes for 2 seconds, you would realize I will pay more taxes than any American in history this year.\"\n\n\"Don’t spend it all at once … oh wait you did already,\" Musk added in another tweet.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nWarren is not the first senator to find herself on the receiving end of backlash from Musk.\n\nIn November, Musk responded on Twitter to Vermont Sen. Bernie Sanders 's demands that the wealthy \"pay their fair share,\" writing: \"I keep forgetting that you’re still alive.\"\n\nThe tweet came in response to Sanders saying on Twitter, \"We must demand that the extremely wealthy pay their fair share. Period.\"\n\nMusk, now with a net worth of more than $260 billion, became the chief executive of Tesla in 2008."
                },
                {
                    "link": "https://www.foxnews.com/sports/coroner-woman-killed-in-ex-raider-crash-burned-to-death",
                    "title": "Coroner: Woman killed in ex-Raider crash burned to death",
                    "text": "The woman who died in a fiery crash that authorities blame on ex-Raiders wide receiver Henry Ruggs III driving drunk at racetrack speeds burned to death, the county coroner in Las Vegas said Tuesday.\n\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\nTina Tintor, 23, of Las Vegas, \"died from thermal injuries due to a motor vehicle collision on Nov. 2,\" according to a statement from Clark County Coroner Melanie Rouse that was released through a county spokesman.\n\n\"Other significant conditions contributing to her death were inhalation of products of combustion, fractures of the nasal bones, right sided ribs ... left forearm and (chest),\" the statement said. \"The manner of her death was accidental.\"\n\nRuggs, 22, is accused of causing the pre-dawn crash by driving drunk at speeds up to 156 mph (251 kph) with his girlfriend in his Corvette sports car before it slammed into the rear of Tintor's Toyota Rav4 on a residential street where the speed limit is 45 mph (72 kph).\n\nThe Raiders released Ruggs hours after the crash. He remains on house arrest with strict conditions after posting $150,000 bail. He has an ankle-wrapped GPS on one leg and an alcohol monitoring device on the other.\n\nAttorneys for Ruggs and his girlfriend, Kiara Je'nai Kilgo-Washington, have declined to specify the injuries that they suffered. Both were hospitalized after the wreck early Nov. 2.\n\nRuggs’ lawyers, David Chesnoff and Richard Schonfeld, have suggested through court filings that they may question whether Ruggs caused Tintor's death. They did not immediately respond Tuesday to requests for comment about the coroner's findings.\n\nThe lawyers told a judge in a court document last month that they found a witness who told them firefighters were slow to respond while flames consumed the car where Tintor and her dog, Max, died. They didn’t identify the witness.\n\nOther witnesses told police they heard screams and tried to rescue Tintor and her dog but were turned back by heat, flames and smoke.\n\nAttorney Farhan Naqvi, representing Tintor’s family, declined to comment on Tuesday.\n\nA preliminary hearing of evidence in Ruggs' case has been delayed from this week to March 10.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nClark County spokesman Erik Pappa denied in a Nov. 11 statement there were any \"delays in response or in the attack on the fire.\"\n\nThe statement said the arriving fire captain reported that the vehicle was fully involved in flames upon arrival \"and the passenger compartment was not survivable for anyone inside.\""
                },
                {
                    "link": "https://www.foxbusiness.com/lifestyle/amazon-worker-caught-camera-threatening-shoot-someone",
                    "title": "Philadelphia Amazon worker caught on camera threatening to shoot someone: ‘stop testing me’",
                    "text": "An Amazon delivery driver in Philadelphia was caught on camera Tuesday threatening to shoot someone after they complained that she was blocking the street.\n\nA witness at the scene told Fox Business that the incident happened in the 500 block of Martin St. in Philadelphia.\n\nIn the video, obtained by Fox Business, an Amazon truck can be seen parked on what appears to be a residential street, blocking traffic. A woman in an Amazon uniform is seen off to the side holding a phone while shouting at drivers who are yelling at her to move.\n\n\"I don’t know who the f--- you think I am,\" the woman shouts at a driver. She tells someone on the phone she has \"like 500 deliveries on this one block.\"\n\nA driver whose face is not visible in the footage shouts at her to move, which appears to rile her up even more.\n\nBEZOS RESPONDS, HOURS AFTER BLASTED FOR SILENCE ON AMAZON WAREHOUSE TRAGEDY IN ILLINOIS\n\n\"Bro, I will really shoot you, bro. Stop testing me, bro. Stop f---ing testing me,\" the woman shouts as she approaches a vehicle. \"I swear to God. Stop f---ing testing me.\"\n\nAnother driver can be heard shouting: \"Move your car!\"\n\nAMAZON FACILITY COLLAPSE IN ILLINOIS INVESTIGATED BY OSHA, LABOR DEPARTMENT SAYS\n\nA witness at the scene told Fox Business that the whole ordeal started because drivers had asked her to move, and she had gotten angry. He said she moved to let a woman pass but then moved the Amazon truck back to where it was, blocking the street once again.\n\nThe witness also accused the worker of punching a neighbor in the face, but this could not be independently confirmed by Fox Business. He said the whole episode lasted between 15 and 20 minutes.\n\nCLICK HERE TO GET FOX BUSINESS ON THE GO\n\nAn Amazon spokesperson told Fox Business that the company is looking into this incident and will take the appropriate course of action."
                },
                {
                    "link": "https://www.foxbusiness.com/politics/judge-dismisses-trump-block-congress-tax-records",
                    "title": "Judge dismisses Trump effort to block Congress from obtaining his taxes",
                    "text": "A federal judge on Tuesday rejected former President Donald Trump’s attempt to block House Democrats from obtaining his personal tax records.\n\nDistrict Court Judge Trevor McFadden, a Trump appointee, dismissed the case, citing Supreme Court precedent. Trump’s attorneys claimed executive privilege and argued the Democrat-led efforts to obtain his tax records were politically motivated.\n\n\"Even if the former President is right on the facts, he is wrong on the law,\" McFadden said in his ruling. \"A long line of Supreme Court cases requires great deference to facially valid congressional inquiries. Even the special solicitude accorded former Presidents does not alter the outcome. The Court will therefore dismiss this case.\"\n\nThe House Ways and Means Committee, led by Rep. Richard Neal, D-Mass., asked the IRS to release Trump’s tax returns in April 2019, kick-starting a lengthy court battle. Trump was the first sitting president not to release his tax records upon entering office in decades.\n\nThe judge paused enforcement of his ruling for 14 days to allow further discussions between the two parties and the potential filing of an appeal. McFadden said Trump’s returns should not be released during that period.\n\nIn his ruling, McFadden suggested that Neal should refrain from making Trump’s tax information public, though he noted it was the \"chairman’s right to do so.\"\n\n\"If Chairman Neal’s true interest in the former President’s tax returns is indeed to better understand the Presidential Audit Program, he will doubtless be able to accomplish this objective without publishing the returns,\" McFadden said.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nNeal praised the judge’s ruling.\n\n\"This ruling is no surprise; the law is clearly on the Committee’s side,\" Neal said in a statement. \"I am pleased that we’re now one step closer to being able to conduct more thorough oversight of the IRS’s mandatory presidential audit program.\""
                },
                {
                    "link": "https://www.foxnews.com/us/prince-andrew-asks-judge-to-toss-lawsuit-says-alleged-victim-was",
                    "title": "Prince Andrew asks judge to toss sex abuse lawsuit, says accuser was above New York age of consent",
                    "text": "Prince Andrew asked a judge this week to toss out a civil lawsuit that was filed against him in August by Virginia Roberts Giuffre, who claims that the Queen's son sexually abused her when she was 17 years old at Jeffrey Epstein's New York home, as well as in London and the U.S. Virgin Islands.\n\nGiuffre filed the suit under the New York Child Victims’ Act, which was passed in 2019 and temporarily allowed victims to sue their alleged abusers if they were younger than 18 when the abuse took place.\n\nPrince Andrew's attorneys argued in a motion filed Monday that the Child Victims’ Act is unconstitutional and Giuffre's claims are invalid because she was 17 years old when the alleged abuse took place.\n\n\"The [Child Victims’ Act] revives claims for those who allegedly suffered harm as a result of certain sexual offenses they claim were committed against them when they were under the age of eighteen, even though the age of consent in New York is seventeen,\" the attorneys wrote.\n\nThe attorneys also argued that accusers must establish lack of consent by \"implied threat,\" but there are no third parties that can testify to the alleged abuse.\n\n\"Here, the only witnesses to the purported implied threats under which Giuffre allegedly engaged in unconsented sex acts with Prince Andrew are Epstein (deceased), Maxwell (incarcerated), Prince Andrew (the accused) and Giuffre herself,\" Prince Andrew's attorneys wrote.\n\nGHISLAINE MAXWELL ALLEGEDLY TOLD TEEN SHE ‘HAD A GREAT BODY FOR MR. EPSTEIN AND HIS FRIENDS’\n\nJeffrey Epstein killed himself in a Manhattan jail cell in August 2019, a month after he was criminally charged with sex trafficking.\n\nGhislaine Maxwell, Epstein's former girlfriend and a longtime friend of Prince Andrew, is currently on trial in New York. Multiple women have testified that Maxwell groomed them to be sexually abused by Epstein when they were girls.\n\nGiuffre filed the civil lawsuit against Prince Andrew in August, saying at the time she is holding him \"accountable for what he did to me.\"\n\n\"The powerful and rich are not exempt from being held responsible for their actions. I hope that other victims will see that it is possible not to live in silence and fear, but to reclaim one’s life by speaking out and demanding justice,\" Giuffre said in a statement at the time.\n\nGHISLAINE MAXWELL TRIAL: DEFENSE COULD CALL MORE WITNESSES THAN PROSECUTION\n\nThe lawsuit, which seeks unspecified compensatory and punitive damages, says that Giuffre \"feared death or physical injury to herself or another and other repercussions for disobeying\" Epstein, Maxwell, and Prince Andrew because of their \"powerful connections, wealth, and authority.\"\n\nIt also alleges that Prince Andrew knew Giuffre was 17 years old at the time, but still abused her \"for the purpose of gratifying his sexual desires.\"\n\nSeparately, a judge ruled Tuesday that a secret 2008 settlement reached between Giuffre and Epstein should be made public. Prince Andrew's attorneys have argued that deal shields Prince Andrew from Giuffre's lawsuit.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nPrince Andrew has maintained that the allegations against him are false, telling BBC in a widely-mocked 2019 interview that he has \"no recollection\" of ever meeting Giuffre.\n\n\"I can absolutely categorically tell you it never happened,\" Andrew said at the time.\n\nThe Associated Press contributed to this report."
                },
                {
                    "link": "https://www.foxnews.com/media/cnn-floats-possible-replacements-biden-2024",
                    "title": "CNN floats possible replacements for Biden in 2024",
                    "text": "CNN's Chris Cillizza on Monday published an article in which he names Democrats who could possibly replace President Biden in the 2024 presidential elections.\n\nCillizza listed Biden's age and current political problems as the reason why he might be replaced on the Democrat ticket in 2024.\n\n\"Combine President Joe Biden's age (he'll be 82 shortly after the 2024 election) and his ongoing political struggles (he's mired in the low 40s in job approval) and you get this: a series of stories examining whether Biden runs again and, if not, who might take his place,\" Cillizza wrote.\n\n‘CNN HEROES’ FALLS FLAT WITH ONLY 422K VIEWERS FOR NETWORK’S SECOND-LEAST WATCHED SUNDAY NIGHT SINCE 1997\n\nAlthough White House Press Secretary Jen Psaki said, \"the President has every intention of running for reelection,\" Cillizza suggested Democrats who could run in Biden’s place.\n\nPossible replacements included Vice President Kamala Harris and Transportation Secretary Pete Buttigieg, both have been discussed as potential rivals for the 2024 election.\n\nRegarding Harris, Cillizza wrote that she’s \"undoubtedly struggled as vice president but she's still the most likely Democrat not named Biden to wind up as the Democratic nominee in 2024.\"\n\nCillizza also complimented Buttigieg writing, \"The most naturally talented candidate in the 2024 field, ‘Mayor Pete’ has also been front and center selling Biden's infrastructure bill.\"\n\nCillizza also listed include failed gubernatorial candidate Stacey Abrams, who recently announced another campaign for Georgia governor in 2022. Despite her previous failed run for higher office, Cillizza pushed her name as a possibility if she wins the governor’s race next year.\n\n\"Abrams talked openly about running in 2020 before passing on the race; but she needs to win the Georgia governor's mansion in 2022 before thinking too much about 2024,\" Cillizza wrote.\n\nOther Democrats Cillizza mentioned are Massachusetts Sen. Elizabeth Warren, Illinois Gov. J.B. Pritzker, Minnesota Sen. Amy Klobuchar, North Carolina Gov. Roy Cooper, former New Orleans mayor Mitch Landrieu, Commerce Secretary Gina Raimondo, Michigan Gov. Gretchen Whitmer, and New Jersey Gov. Phil Murphy.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"If Biden decides not to run, chances are we would be looking at a very crowded field of Democrats seeking to replace him,\" Cillizza concluded.\n\nPresident Biden has been facing plenty of speculation over whether he’ll run again for president due to his age and health."
                },
                {
                    "link": "https://www.foxnews.com/us/texas-man-charged-killing-mother-daughter-during-alleged-human-smuggling-attempt-near-border-identified",
                    "title": "Texas man charged with killing mother, daughter during alleged human smuggling attempt near border ID’d",
                    "text": "Mission, Texas, police have identified the suspect who crashed into a vehicle Saturday while fleeing authorities during an alleged human smuggling attempt.\n\nEsteban Cantu Jr., 18, an American citizen, is charged with murder and aggravated assault in the deaths of Mission resident Carmen Huerta Sosa, 59, and her daughter, 22-year-old Viridiana Charon Lloyd. He was charged Saturday with felony evading and human smuggling.\n\nCantu ran a stop sign Saturday while fleeing from Border Patrol agents and Texas Department of Public Safety troopers and T-boned Sosa’s car, police said.\n\nCBP OFFICERS IN TEXAS SEIZE MORE THAN $3M WORTH OF METHAMPHETAMINE AT US-MEXICO BORDER\n\nPolice said six illegal immigrants were in his vehicle. One of the immigrants flew through the windshield upon impact but survived. Cantu and the immigrants were transported to an area hospital, police said.\n\nnext Image 1 of 3\n\nprev next Image 2 of 3\n\nprev Image 3 of 3\n\nCantu was arrested, formerly charged and arraigned before Mission Municipal Court Judge Jonathan Wehrmeister after he was released from the hospital, police said. He was remanded to the Hidalgo County jail in lieu of the bonds set by Judge Wehrmeister.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nTexas Lt. Gov. Dan Patrick weighed in on Saturday’s incident, saying the blood of Sosa and Lloyd are on the hands of President Biden and Vice President Kamala Harris for their refusal to secure the border.\n\nFox News’ Peter Aitken contributed to this report."
                },
                {
                    "link": "https://www.foxnews.com/us/o-j-simpson-granted-early-release-from-parole-now-a-free-man",
                    "title": "O.J. Simpson granted early release from parole, now a free man",
                    "text": "Former NFL star and acquitted murder defendant O.J. Simpson is a free man for the first time in more than a decade after the Nevada Board of Parole granted him early release this month.\n\n\"On November 30, 2021, upon the written recommendation of the Division of Parole and Probation… the Nevada Board of Parole Commissioners conducted an Early Discharge hearing for Mr. Simpson,\" a spokesperson for the Nevada State Police told Fox News.\n\n\"A decision to grant early discharge from parole was ratified on December 6, 2021.\"\n\nHis parole was otherwise set to expire on Feb. 9 of next year.\n\nSimpson was released from prison in October 2017 after serving nine years for robbing two sports memorabilia collectors at gunpoint in 2007.\n\nOJ SIMPSON BACKS LIZ CHENEY IN GOP LEADERSHIP BATTLE: ‘I’M KIND OF A FAN'\n\nHe said during trial that he only wanted to take back personal items and family photos that were taken from him after he was acquitted in 1995 of murdering his ex-wife, Nicole Brown Simpson, and her friend, Ronald Goldman.\n\nThat murder case, dubbed \"The Trial of the Century,\" received international press attention and was recently dramatized in the popular TV show, \"The People v. O.J. Simpson.\"\n\nBefore that, \"the Juice\" was a star running back, winning the Heisman Trophy in 1968 and playing 11 seasons in the NFL for the Buffalo Bills and the San Francisco 49ers.\n\nSimpson has mostly stayed out of the spotlight after he was released from prison in 2017, but he joined Twitter in 2019, saying that he has \"a little gettin’ even to do.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nHis account, which now has close to 1 million followers, features videos of the former star opining on the NFL, fantasy football, and golf.\n\nAn attorney for Simpson could not be reached for comment on Tuesday.\n\nThe Associated Press contributed to this report."
                },
                {
                    "link": "https://www.foxnews.com/politics/nyc-mayor-elect-adams-chooses-first-woman-to-be-police-commissioner",
                    "title": "NYC Mayor-elect Eric Adams selects Keechant Sewel as the first woman to be police commissioner",
                    "text": "NEW You can now listen to Fox News articles!\n\nNew York City Mayor-elect Eric Adams selected Nassau County Chief of Detectives Keechant Sewel to serve as commissioner of the New York Police Department, making her the first woman to serve in the role.\n\n\"Keechant Sewell is a proven crime fighter with the experience and emotional intelligence to deliver both the safety New Yorkers need and the justice they deserve,\" Adams said in a statement to the New York Post Tuesday. \"Chief Sewell will wake up every day laser-focused on keeping New Yorkers safe and improving our city, and I am thrilled to have her at the helm of the NYPD.\"\n\nNYC ‘CAREER CRIMINAL’ CHARGED IN BRAZEN SHOOTING THAT WOUNDED TWO OFFICERS: ‘THERE IS NO FEAR ON THE STREETS’\n\nAdams, a former NYPD captain, said the 49-year-old Sewell was a \"gut-choice\" to lead the nation's largest police force of 52,000 members, despite her previously only having led 351 uniformed officers in her role as Nassau County Chief of Detectives for the past 15 months.\n\n\"He’s going on his instinct as an officer for 22 years and being one of the chief critics of the NYPD,\" a source close to Adams told the New York Post.\n\nAdams has long said he would tap a woman to fill the role of commissioner, launching a nationwide search and interviewing dozens of candidates before landing on Sewell. The new commissioner will take over a city that has seen a rise in crime in recent years, a problem she pledged to tackle.\n\n\"I want to let them know that we are absolutely focused on violent crime. Violent crime is the No. 1 priority,\" Sewell said.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSewell indicated she was also aware of the historic nature of her nomination, saying she was \"humbled\" by the chance to become the city's first female police commissioner.\n\n\"I’m here to meet the moment,\" Sewell said. \"I’m very humbled to even be considered for this, and it’s an extraordinary opportunity. And I take it very seriously, the historic nature of this.\""
                },
                {
                    "link": "https://www.foxbusiness.com/technology/google-memo-lays-out-plan-to-fire-employees-out-of-compliance-with-vaccine-rules-report",
                    "title": "Google memo lays out plan to fire employees out of compliance with vaccine rules: report",
                    "text": "Unvaccinated employees at Google may soon have to use the search engine to find job openings.\n\nLeadership at the Mountain View, California, tech behemoth circulated a memo that reportedly showed the steps that the company will take before firing employees who are out of compliance with the company’s vaccine policy.\n\nThe company's 150,000 employees were already expected to inform the company about their vaccine statuses or apply for some kind of accommodation, CNBC reported, citing an internal memo. Google plans to contact those who missed the deadline and those who are still unvaccinated. These employees will have until Jan. 18 to comply or be placed on paid administrative leave for about a month, the report said.\n\nThe report said the next will be unpaid personal leave for up to six months, and then termination.\n\nA Google spokesperson told Fox Business that its \"vaccination requirements are one of the most important ways we can keep our workforce safe and keep our services running.\"\n\n\"We’re committed to doing everything possible to help our employees who can get vaccinated do so, and firmly stand behind our vaccination policy,\" the spokesperson said.\n\nMany companies—like Google—were hoping to get most employees back into their offices in January, but the emergence of COVID-19 variants have dampened those hopes. About 41% of the workforce in major cities have returned to their desks, the Wall Street Journal reported, citing Kastle Systems. The security company tracks access-card swipes at office buildings.\n\nMeta Platforms Inc., formerly known as Facebook Inc., said that it will fully reopen its offices by the end of January while giving employees the option to delay their return.\n\nIn August, Google postponed a return to the office for most workers until mid-January, in addition to requiring all employees to be vaccinated once its sprawling campuses are fully reopened.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nCEO Sundar Pichai said in a blog post at the time that Google would delay its global return to offices until Jan. 10. The company has since said it will reevaluate the timing in the new year. About 90% of its offices are already opened and 40% of its employees have returned to in-person work, the company said.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nPichai said in August that the company will let countries and locations determine when to end voluntary work-from-home policies \"based on local conditions, which vary greatly across our offices.\"\n\nThe Associated Press contributed to this report"
                },
                {
                    "link": "https://www.foxnews.com/opinion/greg-gutfeld-viruses-penetrate-immune-system-habitual-liar",
                    "title": "Greg Gutfeld: The only thing viruses can't penetrate is the immune system of a habitual liar",
                    "text": "NEW You can now listen to Fox News articles!\n\nHappy Tuesday everyone. It's time for my favorite show: The But-Heads.\n\nOur world is run by buttheads. These are people who tell you one thing, then follow up with a \"but,\" that contradicts what they just said. They start with a panic line, but then condition it with: \"but we still don’t know.\" That way they get to scare your ass, then cover their own. So let's follow the \"buts\", and see where these asses take us.\n\nAccording to Axios, the website, not my Pilates instructor, the country is bracing for a terrifying wave of omicron. But, the new variant seems to be much less severe. But Boris Johnson says there is a tidal wave coming. But one of his experts adds: only ten people have been admitted to the hospital with it. But we should have known: never believe anything a person says who doesn't own a comb.\n\nHOW IS COVID GOING TO END?\n\nStill, you must get a third dose to bring the level of protection back up! Because the variant seems to spread among people who've received two jabs. But it's not a big deal for those who get it. Still, you gotta mask up and get another dose.\n\nBut this is nothing like the previous strains. Compared to delta -- you barely notice it, and it’s much less powerful. If Alec Baldwin were the first strain, this one is Billy... Or Danny... Or Steven.\n\nBut! -- new data from Europe \"hint\" that omicron is poised to explode in the US. True, they said the same thing about the metric system. But the variant is less likely to lead to hospitalization in adults! So this is the PG version of an R-rated film. Like when they cut out all the swearing and boobs from \"Old Yeller.\"\n\nFact is, more people are hospitalized for putting power tools in their butts, according to emergency rooms located near Home Depots. But two doses of Pfizer’s vaccine appear to be much less effective against severe disease -- but you should still get a booster. Although - we have not seen anyone with severe disease -- but hold on, it's coming! But, so was the medical device I ordered online, and I’m still waiting. I had to make my own using an attachment from an old vacuum.\n\nOMICRON IS BETTER AT EVADING VACCINES, NEW COVID-19 TRANSMISSIBILITY DATA CONFIRMS\n\nBut a senior Biden flack told Axios omicron will come fast! But it won't be as severe... But... There will be hospitalizations! But -- the analysis of South Africa data said that the risk of hospital admission was 30 percent lower than the first wave. But- a two-dose regimen was 70 percent effective against severe disease requiring hospital admission. But only 33 percent effective against omicron.\n\nSo- omicron is less severe – good. But it could still overwhelm the health care system even if a small percentage require hospital care! (s***!) The cases could reach a million a day here in America (s***!) But those cases could be asymptomatic and mild. (hooray!)\n\nBut --the growth of the cases could double quickly- - but it also appears to be already slowing down in other countries. But it's too soon to tell. But don't panic. But also, panic.\n\nBut maybe even in hospitalizations, adults are less sick than previous waves. But while vaccinations do help reduce infection -- but not transmission.\n\nOMICRON COVID-19 VARIANT NOW ACCOUNTS FOR 2.9% OF ALL CASES IN THE UNITED STATES\n\nIn Denmark, 75 percent of omicron cases are among fully-vaccinated people. But you can't compare countries – except when you do. But you can't!\n\nSo omicron has high transmissibility. But it appears to be mild. But it could lead to a huge projection of cases. But we don't have nearly enough data to make any firm predictions. So the people who are telling you to do something, are the same people who are talking you out of it! These people are sending more mixed messages than a straight hairdresser. So maybe call us when you know what the f*** you're talking about!\n\nBecause to quote Axios, again-- \"there is certainly a strong possibility that a lot of Americans are about to get sick... Soon.\" Someone actually wrote that sentence. Imagine if your doctor had that mentality.\n\nSkit of doctor sending mixed signals to a patient\n\nSo what's the bottom line for all the buttheads? Omicron is like that carton of Chinese food in the back of the fridge. It could be dangerous, but we can't find anyone who died from it. But we don't have enough data. So just in case, get a booster and mask up now, whether you're vaxxed or not.\n\nDR. OZ LAMENTS POLITICIZATION OF COVID, VACCINES ON ‘HANNITY’\n\nBut I thought that's why we got vaxxed? To stop with the masks. Not anymore. Look at Joe Biden. He's gotten three shots, but he still wears a mask. He's like one giant walking butt.\n\nSo even if you're alone at your desk, or alone driving a truck, or alone having sex... Mask up! But -- not if you're a politician! Then you can go to bars, parties, galas -- and do whatever you want.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSo these buttheads cover their asses by temporarily covering their mouths when a camera is near. Problem is -- how can they tell the two holes apart? You can't go by the smell of their breath.\n\nSo turns out the only thing that all these different viruses can't penetrate are the immune systems of habitual liars. But it would be nice if they could. No ifs, ands, or buts.\n\nThis article is adapted from Greg Gutfeld's opening monologue on the December 14, 2021 edition of \"Gutfeld!\""
                },
                {
                    "link": "https://www.foxnews.com/us/los-angeles-police-chase-possible-kidnapping-suspect",
                    "title": "Los Angeles possible kidnapping suspect arrested after leading police on chase in city: report",
                    "text": "LOS ANGELES--A suspect wanted in a kidnapping case was taken into custody Tuesday night after leading police on a car chase across the Los Angeles area, according to a report.\n\nPolice cars could be seen following the white SUV as it made its way through residential neighborhoods in the city.\n\nAuthorities had feared that up to two children were potentially inside the vehicle during the chase, according to FOX 11 Los Angeles.\n\nLOS ANGELES CELL PHONE STORES RANSACKED BY SMASH-AND-GRAB THIEVES, LAPD TO INCREASE PATROLS AND ADD DETECTIVES\n\nVideo taken by SkyFOX captured at least one child being escorted away from the scene, the station reported.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nA police spokesman said there are not many details available about the suspect or the other occupants in the vehicle."
                },
                {
                    "link": "https://www.foxnews.com/media/eric-swalwell-david-frum-vaccine-mandates-hospitals-air-travel-the-five",
                    "title": "'The Five' blasts Swalwell, Frum for 'despicable' new COVID restriction ideas for unvaccinated Americans",
                    "text": "Former George W. Bush speechwriter David Frum and House Intelligence Committee Member Eric Swalwell, D-Calif., floated heavily criticized new potential ways to force Americans to submit to the coronavirus vaccine injection, one of which the panel on \"The Five\" called \"despicable.\"\n\nFrum, now a writer for \"The Atlantic\" magazine, wrote a lengthy Twitter thread lamenting the lack of full compliance with vaccine recommendations and edicts, suggesting that one way to force Americans to get the jab would be to send unvaccinated patients to the back of the line if they had to go to the emergency room.\n\n\"Seems the best option is 1) Keep encouraging vaccines and boosters; 2) Impose vaccine mandates where it can be done; 3) Otherwise return to normal as fully as we can, especially the schools; and 4) Let hospitals quietly triage emergency care to serve the unvaccinated last,\" Frum wrote over the weekend.\n\n\"If, at this point, you are still unvaccinated, you are not a victim. You are a cause of the victimization of vulnerable others,\" Frum claimed.\n\nHe further described opposition to vaccines as \"dumb ass malignity\" and lamented the fact that the \"malignant minority\" is opposed to other potential mandates like \"no jab; no fly.\"\n\nThat idea came in part from Swalwell, who along with Rep. Kai Kahele, D-Hawaii, voiced support for a policy that would essentially ban American citizens from traveling by air if they chose not to get vaccinated, according to Fox Business.\n\nSwalwell pushed the idea of an air travel vaccine requirement on Twitter Sunday, writing a \"prediction\" that the country \"can go from 60% Americans vaxxed to 80% if we require vaccines to fly.\"\n\nKahele's state has also been home to one of the nation's strictest coronavirus-era entry requirements. Before the COVID vaccine, travelers from the mainland had to test negative for the coronavirus from a Honolulu-approved test vendor and then file documentation with the state's \"Safe Travels\" website.\n\nRep. Ritchie Torres, D-N.Y., furthermore recently introduced a bill co-sponsored by Swalwell, Kahele and Hawaii's other House member, Ed Case, that would \"direct the Secretary of Homeland Security to ensure that any individual traveling on a flight that departs from or arrives to an airport inside the United States… is fully vaccinated against COVID–19.\"\n\nOn \"The Five\", host Jesse Watters called the ideas from Swalwell and Frum \"COVID hysteria back in full force.\"\n\n\"Liberals are renewing their push for a forever pandemic,\" he said.\n\n\"David Frum from ‘The Atlantic’ had a truly despicable idea suggesting treating unvaxxed patients last at hospitals.\"\n\nHost Dana Perino further wondered aloud whether Frum and the proponents of the vax-to-fly policy drafted by Torres were paying any attention to the stark message the American people sent them with the recent elections in Virginia and New Jersey where Republicans overperformed in part because of voters' frustration with both socioeconomic lockdown policies and leftist school curricula.\n\n\"And you had this other problem where you have fancy people who can go to a big party and mingle around without a mask, [while] anyone who works there had to wear a mask,\" she added.\n\n\"There’s a huge disconnect … The inequality of this shaming is really big. We’ve never figured out a way to address natural immunity. We never figured out a way to talk about the fact that we do have [other] treatments.\n\n\"For an example, David Frum's idea, like as you said, is despicable, and is also ridiculous because there are easy ways to treat it now with amazing advancements in science.\"\n\nPerino concluded by saying that making the liberal firebrand Swalwell \"the face of telling Americans that you aren't allowed to travel\" would be the best way to start a nationwide popular backlash.\n\nIn other reporting on Fox News, host Tucker Carlson has pointed out Swalwell's penchant for coronavirus-era travel, including to Qatar, where he was famously pictured shirtless and looking exuberant atop a camel while its handler stood in the photo's foreground.\n\n\"The Five\" host Greg Gutfeld remarked that the controversial emergency room policy proposal is proof that Frum is \"a broken man\" and that the Bush-era politico has been \"suffering from irrelevance\" as of late.\n\n\"He is pretty much just lashing out,\" he said. \"Everybody knows people who haven't been vaccinated for legitimate reasons and there are therapeutics that can help and so on. So he’s doing this because he is a sad, sad, loser.\"\n\nFox Business' Houston Keene contributed to this report."
                },
                {
                    "link": "https://www.foxnews.com/media/miranda-devine-kamala-harris-border-crisis-office-decor",
                    "title": "Kamala Harris doesn't want to talk about the border crisis, just her office décor: Miranda Devine",
                    "text": "Miranda Devine slammed the liberal media for not asking Vice President Kamala Harris tough questions when they get interviews with her on \"Tucker Carlson Tonight\" Tuesday.\n\nOne of the pressing issues of the day, in Devine's view, is the border crisis. In March, President Biden appointed Harris to handle the border crisis amid rising encounters between illegal immigrants and Border Patrol.\n\nAmid an exodus from her office, a report the veep is a \"bully,\" and a crisis at the border, the San Francisco Chronicle instead focused on Harris' new office design in a recent article.\n\nSURGE OF MIGRANTS CROSSING INTO US CREATES LOGISTICS NIGHTMARE FOR BORDER AGENTS\n\nDevine said that the piece focused on the color of Harris' walls and the art pieces she chose rather than the issue with which she is tasked – overseeing the border.\n\n\"It's pretty rare to get a one-on-one interview with Kamala Harris and the San Francisco Chronicle – to their great credit – managed to score one. But they didn't ask [Harris] … about the border crisis … [which] is supposed to be something she's fixing. Apparently, there was nothing to talk about,\" she said.\n\nOn the design, Tucker Carlson remarked, \"Kamala Harris has horrible taste. Don't let her near your house.\"\n\nTucker asked, \"She's this feminist leader, she's breaking glass ceilings, she's inspiring America's women … And yet the one interview she gives us is about interior decorating?\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Yeah … it's pretty sexist … when you think about … [Harris] should be up in arms. But that's what she's all about,\" said Devine. \"She's all about … frivolity, and she never wants to talk about anything serious like the border. [She has] no plan to visit [and] no plan to fix it … It's all about her décor.\""
                },
                {
                    "link": "https://www.foxnews.com/media/espn-bubba-wallace-noose",
                    "title": "ESPN dragged for reviving debunked narrative Bubba Wallace found a 'noose' in NASCAR garage last year",
                    "text": "ESPN was accused of spreading \"misinformation\" after it shared a clip from its new TV special about NASCAR driver Bubba Wallace.\n\nWallace, made national headlines in June 2020 after he asserted that someone had hanged a noose in his garage at Talladega Superspeedway in the wake of the unrest following the murder of George Floyd.\n\nDays later, an investigation from the FBI concluded that the rope attached to his garage door had been there since at least October 2019 and that \"nobody could have known\" that Wallace would be assigned that specific garage to hang a noose.\n\nFBI: NOOSE FOUND IN BUBBA WALLACE'S NASCAR GARAGE WAS THERE SINCE 2019\n\nOn Tuesday, however, ESPN shared a clip from \"Fistful of Steel\" in a tweet that fueled the already debunked narrative.\n\n\"Last year, a noose was found in Bubba Wallace's stall at Talladega Superspeedway. The next day, the NASCAR community stood with him in unity,\" ESPN tweeted.\n\n\"I was like, 'Holy s---, it's the whole garage.' ... That's when I lost it,\" the tweet read quoting Wallace from an interview.\n\nThe dramatic clip, which was dominated with melodramatic music, also included interviews from NASCAR All-Star Jimmie Johnson, NASCAR President Steve Phelps and Wallace's mother, Desiree Wallace, marveling at the unity that occurred within the sport after the noose claim drew national attention.\n\nThe clip shared on Twitter made no mention that Wallace's claim was debunked.\n\nCritics dragged ESPN for reviving the false narrative.\n\n\"It wasn’t a noose tho…\" Washington Free Beacon reporter Chuck Ross reacted.\n\n\"This is misinformation,\" National Review senior writer Dan McLaughlin declared.\n\n\"It was a pull rope that long predated Wallace's assignment to that garage. Pretending it was more than that is evil,\" Babylon Bee CEO Seth Dillon tweeted.\n\n\"Holy hell the lie continues! It was a door pull in his garage. Shame on @espn,\" Fox News contributor Katie Pavlich wrote.\n\n\"How do you do an entire special on something that everyone knows was an imaginary hate crime?\" conservative writer A.G. Hamilton asked.\n\n\"It was a garage pull cord that had been there for months, you dishonest, race-baiting, race-hoaxing clowns,\" The Federalist co-founder Sean Davis bashed ESPN.\n\nOthers used ESPN's report about the FBI's investigation concluding Wallace's claim was false against the network with the headline, \"FBI says rope had been in Talladega garage since October; Bubba Wallace not victim of hate crime.\"\n\nESPN did not immediately respond to Fox News' request for comment."
                },
                {
                    "link": "https://www.foxnews.com/sports/warriors-steph-curry-breaks-nba-career-3-point-record",
                    "title": "Warriors' Steph Curry breaks the NBA career 3-point record",
                    "text": "Move over Ray Allen, Stephen Curry is officially the greatest shooter of all time.\n\nThe Golden State Warriors superstar drained the 2,974th 3-pointer of his Hall of Fame career during the first quarter of a game against the New York Knicks at Madison Square Garden on Tuesday night.\n\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\nWith 7:33 to go in the opening quarter, Curry nailed a shot from the right wing, and he waved his arms celebrating while running back down the opposite side of the court. The Warriors quickly committed a foul and called a timeout so Curry and the rest of his teammates could celebrate the accomplishment.\n\nNETS' KYRIE IRVING POSTS CRYPTIC VIDEO SIGNALING A POSSIBLE RETURN TO THE COURT\n\nCurry shared hugs with Warriors head coach Steve Kerr, teammate Draymond Green and Allen, who was in attendance at the arena. Curry also ran off the court and threw the record-breaking basketball to his father, Dell Curry.\n\nCurry already owns two of the top three seasons for 3-pointers — including the only season with 400 3s — and now has the career record that Allen had held since passing Indiana Pacers great Reggie Miller in 2011.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"I think fans are attracted to him just because of his humility and his story and how hard he’s had to work, so from that standpoint, it transcends sports somewhat,\" Kerr said before the game.\n\nAfter Curry set the record, Under Armour released a commercial commemorating the accomplishment.\n\n\"2,974 and counting…Congratulations to @Stephencurry30 on becoming the greatest 3-point shooter EVER. To commemorate this milestone and in our ongoing effort to Change the Game for GOOD, #CurryBrand is building 3 new courts in Oakland, Charlotte, and New York City,\" the company wrote on Twitter."
                },
                {
                    "link": "https://www.foxnews.com/media/will-cain-black-lives-matter-black-xmas",
                    "title": "Will Cain: BLM will call you a racist for shopping at stores they have no problem taking money from",
                    "text": "\"Fox News Primetime\" host Will Cain called out the Black Lives Matter \"Black Xmas\" campaign Monday for boycotting stores they have accepted donations from in the past.\n\nWILL CAIN: America can't escape the framework of skin color because instead of spreading cheer and joy this holiday season, Black Lives Matter is asking its followers to participate in segregation. They called their mission \"Black Xmas.\" And its goal is pretty simple, fight \"white supremacist capitalism.\" Now you're probably wondering what is white supremacist capitalism? And that also is simple: it's any business owned by a White person.\n\nSo if you want to celebrate \"Black Xmas\" this year, all you have to do is stay away from those white supremacist stores and spend money exclusively at Black-owned businesses. BLM will call you a racist for shopping at businesses not owned by Black people, they have no problem accepting millions of dollars in donations from what they consider white supremacists.\n\nAfter the death of George Floyd, companies like Apple, Amazon, Microsoft, Google, Coca-Cola, they lined up to give Black Lives Matter millions, and BLM happily accepted. In fact, they raised more than $90 million in 2020 …. We know it didn't go to help any Black people, unless you count the co-founder of BLM, who bought four mansions after her nonprofit raked in all that cash.\n\nCLICK HERE TO GET THE FOX NEWS APP"
                },
                {
                    "link": "https://www.foxnews.com/politics/nyc-vaccine-mandate-injunction-dealt-new-blow-by-federal-judge",
                    "title": "NYC vaccine mandate exemption effort dealt blow by federal judge",
                    "text": "NEW You can now listen to Fox News articles!\n\nA federal judge in the Southern District of New York denied a motion Tuesday from New York City public school employees for a preliminary injunction against COVID-19 mandates on the basis of religious exemption.\n\nDistrict Judge Valerie Caproni ruled that because the plaintiffs \"have not shown irreparable harm or a likelihood of success on the merits, their motion for a preliminary injunction is DENIED,\" according to her ruling.\n\n\"With no basis for a preliminary injunction, the Court also denies Plaintiffs’ motion that Defendants be ordered to immediately reinstate them to their original positions prior to the enforcement of the vaccine mandate,\" the judge continued.\n\nIf Caproni, who was appointed by former President Barack Obama, had granted the motion, her injunction would have blocked the city from mandating vaccinations for public school employees while they await the court to hear other arguments for vaccine exemptions on religious grounds.\n\nNYC MAYOR DE BLASIO ANNOUNCES COVID-19 VACCINE MANDATE FOR PRIVATE SECTOR WORKERS\n\nCaproni also denied the requests from the plaintiffs for provisional certification of a class of all Department of Education (DOE) employees who assert religious objections to the vaccine mandate.\n\n\"IT IS FURTHER ORDERED that Plaintiffs’ motion to certify a class of all DOE employees who assert religious objections to the vaccine mandate is DENIED without prejudice because it is premature,\" she said.\n\nNEW YORKERS REACT TO DE BLASIO'S VACCINE MANDATES ON PRIVATE SECTOR: ‘DISASTER’ OR ‘ABOUT TIME’?\n\nCaproni's ruling comes a day after the Supreme Court refused to block a New York regulation mandating COVID-19 vaccinations for health care workers.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe vaccine mandate for health care workers, which went into effect in August, allows for medical exemptions but not religious ones. The Supreme Court turned away two applications from doctors and nurses in the state for injunctive relief to allow religious exemptions while litigation continues in the lower courts over the mandate's constitutionality.\n\nFox News' Marta Dhanis and Jessica Chasmar contributed to this report."
                },
                {
                    "link": "https://www.foxnews.com/media/laura-ingraham-biden-democrats-crackdown-freedom",
                    "title": "Ingraham: Biden and Democrats are planning their next crackdown on freedom",
                    "text": "Laura Ingraham said President Biden and the Democrats are planning their next move to infringe on Americans' freedoms on Tuesday's \"Ingraham Angle.\"\n\nThe Fox News host argued the Democrats' hysteria over climate change is a ruse to expand the government's power over daily life. \"We won’t be locked down again – not by a COVID emergency and not by a climate emergency,\" she said.\n\n\"'Soon COVID will be behind us,' you’re thinking. … You can’t wait for the old normal to be back. We’re all looking forward to the end of shaming and recriminations.\"\n\nDESANTIS VOWS NO LOCKDOWNS OR MANDATES IN FLORIDA AS OMICRON VARIANT HITS THE STATE\n\nNot so fast, Ingraham said.\n\nShe cautioned that the left is planning an end to private vehicular travel. \"The trendy climate change thinking in Europe will come here, wrapped in a public health emergency. It’s just another attempt to foist new rules on you without your consent.\"\n\nShe raised remarks by Trudy Harrison, a member of U.K. Parliament, who recently said that private travel is an outdated system.\n\nBRITISH PM JOHNSON FACING CRISIS AS NATION REACTS TO GOVERNMENT PARTIES HELD DURING COVID LOCKDOWNS\n\n\"The CCP (Chinese Communist Party) would be proud\" of that agenda, Ingraham said. \"[The left's] ultimate goal: limiting your ability to travel with convenience – when you want, where you want. This would mean the end to private car ownership as we’ve known it and loved it for decades. It’s the image of the middle-class American dream … that liberal elites have hated for a long time.\"\n\nShe said the fervor for government dependency existed before COVID-19, but Biden and his party intend to exploit it. Biden revealed this himself, she said, that he \"wants to get as many cars off the road as possible\" in order to fight climate change.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nBiden said that taking \"millions of automobiles off the road\" would clean up the air and save oil. \"This is not hyperbole. This is a fact. These are facts,\" he added.\n\n\"Politicians who are supporting this climate agenda must be beaten at the polls and beaten badly,\" Ingraham concluded."
                },
                {
                    "link": "https://www.foxbusiness.com/markets/jpmorgan-tells-unvaccinated-workers-to-stay-home",
                    "title": "JPMorgan tells unvaccinated workers to stay home",
                    "text": "JPMorgan Chase & Co. told unvaccinated employees in New York that they must work from home starting Tuesday.\n\nThe bank had previously allowed unvaccinated staff to work in its Manhattan offices if they were tested twice a week. It had already limited their ability to travel and attend meetings, either internally or with clients. And it had said they would bear some of the expense by paying higher healthcare costs in 2022.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\n\"We also agree with health authorities that being vaccinated against Covid-19 is the best way to keep ourselves and our loved ones safe—especially as we face the winter months and a new variant,\" the bank’s Return to the Office Task Force said in a memo to unvaccinated employees Monday night.\n\nNew York Gov. Kathy Hochul said Friday that New Yorkers must wear masks in public indoor places unless those places require people to be vaccinated against Covid-19. That requirement went into effect Monday.\n\nTuesday, JPMorgan began requiring vaccination proof for all employees and visitors to enter its New York office buildings, a step other banks had taken before.\n\nJPMORGAN IN TALKS TO PAY $200 MILLION FINE OVER EMPLOYEE TEXT MESSAGES\n\nThe work-from-home order is considered temporary and the bank is studying potential other solutions to deal with the state order.\n\nJPMorgan also relaxed mask requirements for vaccinated employees in the New York corporate offices.\n\n\"It seems unfair to require our vaccinated employees to wear masks all day at their desks,\" the bank said in the memo. More than 90% of JPMorgan staff based in Manhattan are vaccinated, according to the memo.\n\nTicker Security Last Change Change % JPM JPMORGAN CHASE & CO. 159.13 +1.21 +0.77%\n\nThe memo was previously reported by Reuters.\n\nJPMorgan, the biggest bank in the U.S., has taken a relatively hard-line approach on curtailing work-from-home, telling many workers this summer that they needed to come back to the office. Chief Executive Jamie Dimon has said that remote work doesn’t make sense for clients or employees.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nThe Omicron variant has muddled the picture for many companies. In recent days, companies as varied as Facebook parent Meta Platforms Inc., Ford Motor Co. and Alphabet Inc.’s Google have delayed return-to-office dates or given employees the option to stay home longer.\n\nWrite to David Benoit at david.benoit@wsj.com"
                },
                {
                    "link": "https://www.foxbusiness.com/politics/senate-votes-raise-debt-ceiling-2-5t",
                    "title": "House votes to raise debt ceiling, sends bill to Biden’s desk",
                    "text": "The U.S. House of Representatives voted to lift the federal debt ceiling by $2.5 trillion early Wednesday and will send the bill to President Biden's desk for final approval.\n\nThe House voted 221-209 in favor of the increase after the Senate voted to avoid a U.S. default. The votes followed months of discord on Capitol Hill. The Senate vote was also along party lines, 50-49.\n\nLawmakers expect the increase, which raises the debt ceiling to roughly $31.5 trillion, to last beyond the upcoming midterm elections and into 2023. Treasury Secretary Janet Yellen said lawmakers had until Wednesday to raise the debt ceiling or risk a potential default on U.S. obligations.\n\nEarlier, Republicans agreed to a one-time exception to the filibuster, allowing the Democrats to pass the debt hike by a simple majority vote rather than meeting the 60-vote threshold.\n\n\"This is about paying debt accumulated by both parties, so I’m pleased Republicans and Democrats came together,\" Senate Majority Leader Chuck Schumer, D-NY, said on the floor ahead of the vote.\n\nThe House is expected to sync up with the Senate in a vote on raising the debt limit that could occur as soon as Tuesday. From there, the bill will proceed to President Biden’s desk for final approval.\n\nThe Senate vote followed weeks of contentious negotiations between Schumer and Minority Leader Mitch McConnell, R-Ky. Many Republicans say Democrats should raise the debt ceiling without their help, arguing any increase will facilitate increased spending on social and climate programs the country can’t afford.\n\n\"Later today, every Senate Democrat is going to vote on party lines to raise our nation's debt limit by trillions of dollars,\" McConnell said ahead of the vote. \"If they jam through another reckless taxing and spending spree, this massive debt increase will just be the beginning.\"\n\nThe one-time exception to filibuster rules allowed Democrats to avoid raising the debt ceiling through the budget reconciliation process. Schumer said that process would be too risky and complicated.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nMcConnell faced some Republican pushback over the agreement, with GOP critics accusing the minority leader of caving to political pressure.\n\nFox News' Edmund DeMarche and the Associated Press contributed to this report."
                },
                {
                    "link": "https://www.foxbusiness.com/lifestyle/vegas-welcomes-a-new-name-harry-reid-international-airport",
                    "title": "Vegas welcomes a new name: Harry Reid International Airport",
                    "text": "Former U.S. Sen. Harry Reid of Nevada didn't attend a renaming ceremony on Tuesday making him the namesake of the busy international airport in Las Vegas, but praise was heaped upon him for his foresight and state infrastructure advocacy.\n\n\"He knew it was the gateway to boosting tourism,\" Carlos Monje, U.S. transportation undersecretary, told family members, elected leaders and administrators gathered at the facility known since December 1948 as McCarran International Airport.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\n\"By investing in infrastructure all around the Las Vegas Strip, visitors are able to more easily (access) the properties and generate millions and billions of revenue for the state,\" Monje said.\n\nReid’s son, former Clark County Commission chairman and Democratic gubernatorial candidate Rory Reid, said his father \"regretted not being able to be here\" to mark the new name, Harry Reid International Airport, but said he \"understands what an incredible honor this is for him.\" Rory Reid declined comment later when reached by The Associated Press.\n\nThe Las Vegas Review reported the 82-year-old Reid and his wife, Landra, decided not to attend because of the ongoing threat of COVID-19. Reid was diagnosed with pancreatic cancer in 2018. Landra Reid is a cancer survivor.\n\nMGM RESORTS TO SELL MIRAGE HOTEL AND CASINO FOR $1.08 BILLION TO HARD ROCK\n\nHarry Reid served in the U.S. Senate for 30 years, including eight years as Democratic majority leader from 2007 to 2015. He was the longest-serving senator in Nevada history when he retired in 2017. He also served from 1983 to 1987 in the U.S. House of Representatives.\n\nIn a statement, the native of Searchlight, Nevada, recalled his first airplane ride at the airport in 1958 and his more than three decades of trips home from Washington.\n\n\"I worked hard during my years in Congress to help build and grow the airport, and it is a source of tremendous pride to me,\" Reid said in the statement. \"It is the indispensable ingredient to Las Vegas’ success; it’s the gateway through which millions come from every corner of the world to see our city, which is like no other place on earth.\"\n\nLAS VEGAS EVENTS, VENUES BEGIN REQUIRING COVID-19 VACCINATION PROOF\n\nReid pushed for development of the Terminal 3 international arrivals annex, which opened in June 2012 and served as the site of Tuesday’s ceremony.\n\nThe airport handled 51.5 million passengers in pre-coronavirus 2019, including some 3.8 million from cities including London, Amsterdam, Mexico City, Frankfurt, Germany, and Tel Aviv, Israel. The airport ranks among the 10 busiest in the U.S.\n\nThe airport was founded as Alamo Field in 1942. It was named 73 years ago for then-U.S. senator from Nevada Pat McCarran, a Democrat whose legacy is clouded by accounts of racism, xenophobia and antisemitism during his time in public office. McCarran also owned the airport, and he lobbied for commercial aviation, federal public works and benefits for his home state. He died in 1954.\n\nClark County now owns the airport and elected local lawmakers voted unanimously in February to make the name change after years of advocacy led by Clark County Commissioner Tick Segerblom.\n\n\"Sen. McCarran, in retrospect, was not a perfect human being and did and said a lot of bad things,\" Segerblom said Tuesday. \"We are not the Nevada Senator McCarran worked at or lived in. We are a very multicultural, diverse, a multiracial, a multi-ethnic city.\"\n\nOfficials have said the expected $7.2 million cost to rename the airport is being privately raised, with some $3 million still to come to be used for changing signs and markers from curb to gate at the airport, and for vehicle decals, uniforms and administrative costs.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nThe airport’s Federal Aviation Administration designator remains LAS, but the FAA began listing the Reid name on aviation charts in June.\n\nAirport spokesman Joe Rajchel said passengers will notice changes on airport social media channels including Facebook and Twitter, although its Twitter handle remains @LASairport."
                },
                {
                    "link": "https://www.foxnews.com/entertainment/scarlett-johansson-daughter-feels-about-brother",
                    "title": "Scarlett Johansson reveals how 7-year-old daughter feels about newborn brother",
                    "text": "Scarlett Johansson has one big happy family.\n\nThe 37-year-old actress recently welcomed a young boy Cosmo, whom she shares with her husband and \"Saturday Night Live\" star Colin Jost. She is also mother to a daughter Rose, whom she shares with her ex-husband Romain Dauriac.\n\nThe \"Black Widow\" star appeared on \"The Ellen DeGeneres Show\" on Tuesday and opened up about life with her new little guy.\n\nWhen asked how Rose feels about having a little brother, Johansson said, \"She's pretty neutral about it.\"\n\nSCARLETT JOHANSSON GIVES BIRTH TO FIRST CHILD WITH COLIN JOST\n\n\"She'll come home, and she's just talking a mile a minute, and I have to remind her, ‘Hey say hi to your brother,’ and she's like, ‘Oh my God, he’s so cute' and is going on and on.\"\n\nCOLIN JOST SAYS HIS MOM 'WAS SLIGHTLY THROWN BY' SON'S NAME COSMO\n\nThe actress chalks Rose's indifference up to her age.\n\n\"I think being seven is pretty psychedelic,\" she joked.\n\nJohansson noted that her little guy's personality is still developing as well.\n\n\"He just discovered his feet, which is the biggest thing ever,\" she said. \"I always feel like that must be so crazy. You look down, and you're like, ‘Woah, there's feet.' You just never knew they were there.\"\n\nSCARLETT JOHANSSON SAYS 'BLACK WIDOW' MAY BE FINAL TURN AS NATASHA ROMANOFF: 'I HAVE NO PLANS TO RETURN'\n\nThe Marvel star said she assumes that her two children will grow into \"very different people.\"\n\n\"My daughter, she’s a little bossy. I don’t know where she gets that from. She’s very headstrong,\" Johansson said. \"And he’s just putting his feet in his mouth, so he’s pretty laid back.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nShe also gave fans a peek into her parent style, calling Jost, 39, an \"easy-going\" person and saying that she'll \"obviously\" be the stricter parent.\n\nCLICK HERE TO SIGN UP FOR OUR ENTERTAINMENT NEWSLETTER\n\nJohansson and Jost wed in 2020, and Cosmo was born in August."
                },
                {
                    "link": "https://www.foxnews.com/entertainment/billie-eilish-watched-violent-porn-age-exposed",
                    "title": "Billie Eilish began watching porn at age 11: 'I feel incredibly devastated that I was exposed'",
                    "text": "Billie Eilish admitted she began watching porn at 11 years old during Monday's appearance on \"The Howard Stern Show.\"\n\nEilish, 19, said she feels \"incredibly devastated\" to have been exposed to \"so much porn.\"\n\n\"As a woman, I think porn is a disgrace,\" Eilish told Stern during the interview. \"I used to watch a lot of porn, to be honest. I started watching porn when I was like 11.\"\n\n\"I think it really destroyed my brain, and I feel incredibly devastated that I was exposed to so much porn.\"\n\nBILLIE EILISH CLAIMS COVID-19 VACCINATION KEPT HER FROM DYING: ‘IT WAS BAD’\n\nEilish claimed that the more she watched porn, she began to watch \"abusive\" BDSM porn.\n\n\"It got to a point where I couldn’t watch anything else unless it was violent; I didn’t think it was attractive,\" she told Stern.\n\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\n\"I was a virgin. I had never done anything. And so, it led to problems … The first few times I had sex, I was not saying no to things that were not good. It was because I thought that’s what I was supposed to be attracted to.\"\n\nEilish spoke about how \"angry\" she is that porn is \"so loved.\"\n\n\"I’m so angry that porn is so loved,\" Eilish blasted. \"And I’m so angry at myself for thinking that it was OK.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe \"Ocean Eyes\" singer also criticized the porn industry for creating unrealistic expectations for women.\n\n\"The way that vaginas look in porn is f---ing crazy,\" Eilish said. \"No vaginas look like that. Women’s bodies don’t look like that. We don’t come like that.\""
                },
                {
                    "link": "https://www.foxweather.com/weather-news/tornado-surveys-ongoing-could-take-several-days-nws-says",
                    "title": "NWS confirms at least 41 tornadoes as storm surveys continue; could take several days to complete",
                    "text": "The National Weather Service said Sunday that due to the extent of the damage from Friday’s deadly tornadoes, their surveys could take days to finish.\n\nInitial surveys have confirmed at least 41 tornadoes, with many more surveys still ongoing over the coming days.\n\nThe seven strongest tornadoes have each been given an EF-3 rating on the Enhanced Fujita Scale, including the twisters that struck Mayfield, Kentucky; Bowling Green, Kentucky; Saloma, Kentucky; Edwardsville, Illinois; Defiance, Missouri; a long-track tornado that was on the ground for more than 71 miles from Newbern to Paris Landing, Tennessee; and another long-track tornado that tracked from Weiner, Arkansas, to Hornersville, Missouri.\n\nHOW ARE TORNADOES RATED? THE ENHANCED FUJITA SCALE EXPLAINED\n\nOne of the biggest tornadoes that has the NWS working hard to conclude its findings is the Mayfield, Kentucky, tornado. Preliminary information conducted by the Paducah NWS office shows the tornado tracked from Cayce to at least Beaver Dam.\n\nnext Image 1 of 8\n\nprev next Image 2 of 8\n\nprev next Image 3 of 8\n\nprev next Image 4 of 8\n\nprev next Image 5 of 8\n\nprev next Image 6 of 8\n\nprev next Image 7 of 8\n\nprev Image 8 of 8\n\nThe NWS found at least EF-3 damage, with a maximum width of at least three-quarters of a mile, but meteorologists said that could be revised as the survey continues this week.\n\n\"A team of experts that specialize in high-end tornado ratings are arriving over the next day or so to help with our survey. They will provide added assistance,\" the NWS Paducah office wrote. \"It will take several days. This is history, so please be patient with us.\"\n\nThe NWS in Memphis also said it has a couple of teams continuing to assess the damage.\n\n\"The first crew will focus on the initial supercell that tracked from Poinsett County, through the Missouri bootheel, and across Lake and Obion counties. The second team will survey the West Tennessee supercell that moved from Dyer to Henry County,\" NWS Memphis wrote. \"Additional areas will be surveyed over the next few days. These surveys will likely take some time to complete.\"\n\nThe NWS in St. Louis said it has a survey planned for Reynolds County, Missouri, but showed the track of the tornadoes that hit its area, including the Edwardsville, Illinois, tornado that hit an Amazon facility. That tornado was rated with EF-3 damage."
                },
                {
                    "link": "https://www.foxnews.com/lifestyle/steve-doocy-fox-friends-happy-christmas-tradition",
                    "title": "Steve Doocy of 'Fox & Friends' reveals a happy Christmas tradition in his family's household",
                    "text": "Among the essays, memories, playlists, and more contained within the pages of the engaging new book, All American Christmas, is a father-and-son dialogue by none other than Steve Doocy, a cohost of \"Fox & Friends,\" and Peter Doocy, a White House correspondent for Fox News Channel and the oldest of Steve and Kathy Doocy's three children.\n\nThe father-and-son team bring readers close to a cherished family tradition at Christmas in the new book — something many of us can identify with in one way or another and totally enjoy.\n\nThe pair's playful banter makes it even better.\n\nRACHEL CAMPOS-DUFFY: CHRISTMAS GLORY INCLUDES THE BEAUTIFUL NATIVITY SCENE\n\nCheck out their story below from the new book by Rachel Campos-Duffy and Sean Duffy. This slice is from a much longer essay by the Doocys that appears in a section of the book aptly called the \"Joy of Family.\"\n\nRead this holiday excerpt by Steve Doocy and Peter Doocy\n\nSteve Doocy in All American Christmas: Sometime in 1987, when my wife, Kathy, was pregnant with our son, Peter, I saw a story that set me on a path I hadn't considered taking before.\n\nThis gentleman had been snapping a photo of his son on the young man's birthday for twenty-five consecutive years.\n\nMore than that, he took the photo with his son standing in the exact same spot every time. It was a time-lapse family, every shot taken one year later.\n\nI know that has been done by millions of parents by now, but this was the first I'd heard of it. I didn't want to copy his idea exactly, but I liked the concept of having that year-to-year record we could all review at some point in the future.\n\nI decided then and there that I wanted to video our children coming down the stairs on Christmas morning to get to the tree and the presents beneath it.\n\nSo, the first Christmas that Peter could walk on his own, we instituted what has become an ongoing tradition.\n\nMary, our second child, joined us in time for the second year of the photo opportunity and was carried downstairs by my wife, Kathy. And then our youngest child, Sally, joined her brother and her sister for the mad dash down the stairs, a cherished family tradition that we kept alive every single year after that, right up until the 2020 pandemic, which kept Peter from joining us at the home he'd grown up in.\n\nSome of you reading this may have seen a collection of clips that I stitched together into a video that we aired on \"Fox and Friends\" about fifteen years ago.\n\nQuite a few times, Kathy and I have been out at a promotional event for one of my books or some other function. Inevitably, someone will approach us and say, \"Hey! I watched your kids grow up running down the stairs.\"\n\n\"He was like a cameraman at a NASCAR race filming us as we dashed past him, banked the turn through the dining room, and then the straightaway through the kitchen to get to the tree.\" — Peter Doocy about his dad\n\nI'm glad that treasured family moment, and such an iconic experience in many kids' lives, has been one we can share. After all, that's what Christmas is all about: giving.\n\nRight, Peter?\n\nPeter Doocy in All American Christmas: That's true, Dad.\n\nFrom my perspective, though, as kids we might not have been as charitable and loving as the season calls for.\n\nAt the top of the steps, we did engage in some jostling to get to the head of the line and be the first one down the stairs and to that tree. It was almost as if we were basketball players trying to box out our opponent and get the rebound!\n\nSteve Doocy: Peter's right; the competition was fierce. It took Mary twenty-eight years to finally get to the tree first, and she celebrated with a little end-zone dance.\n\nPeter dominated the competition for most of those years.\n\nBEST CHRISTMAS GIFT EVER: AMAZING REVEALS FROM FOX NEWS PERSONALITIES\n\nPeter Doocy: Dad should know all about it. As the cameraman/director, he wanted to be sure he got as much of the moment on tape as possible.\n\nHe was like a cameraman at a NASCAR race filming us as we dashed past him, banked the turn through the dining room, and then the straightaway through the kitchen to get to the tree …\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSteve Doocy: Being together is the magic of Christmas.\n\nExcerpted from All American Christmas by Rachel Campos-Duffy and Sean Duffy. To purchase a copy, click here."
                },
                {
                    "link": "https://www.foxnews.com/lifestyle/stories-behind-homes-favorite-holiday-movies",
                    "title": "The stories behind the homes from your favorite holiday movies",
                    "text": "Everyone wants to be home for the holidays.\n\nNot surprisingly, many Christmas movies are based around families getting together for the holidays. This has resulted in many of the most popular holiday movies being based in iconic houses.\n\nWhether it’s Macaulay Culkin being left behind while his family goes on vacation or Arnold Schwarzenegger trying to get the perfect gift for his son, many of these films were shot in real homes and locations.\n\nHome Alone\n\nThe McCallisters' house in \"Home Alone\" is a real house located in Winnetka, Illinois. Fortunately, the area isn’t known for being targeted by bandits. The house has five bedrooms and four bathrooms. Also, none of the doorknobs are electrified or overheated and there aren’t any giant spiders wandering the halls.\n\nHOLIDAY TRAVELERS TO EXCEED PRE=PANDEMIC NUMBERS, STARTING WITH THANKSGIVING\n\nA Christmas Story\n\nAnyone who had cable in the late ’90s and early 2000s has seen this movie many times. The film’s iconic house, located in Cleveland, Ohio, has been restored and a museum dedicated to the movie has also been opened across the street. Guests visiting the house may notice a memorable lamp in one of the windows.\n\nJingle All the Way\n\nIn this 1996 classic, Arnold Schwarzenegger plays a father who’s been too focused on work to spend time with his son or get him a Christmas gift. Fortunately, his character’s workaholic nature paid off and he was able to afford a nice house with four bedrooms and five bathrooms. The actual house is located in Edina, Minnesota, and is estimated to be worth over $2.5 million.\n\nFOLLOW US ON FACEBOOK FOR MORE FOX LIFESTYLE NEWS\n\nNational Lampoon's Christmas Vacation\n\nThe Griswold family just couldn’t have a nice, relaxing vacation, even when they were just staying home for the holidays. In the film, the Griswolds live near Chicago. In reality, the house was located on the Warner Brothers backlot in Burbank, California. It’s located in a neighborhood that Warner Brothers owns and uses for various movie and TV productions.\n\nDie Hard\n\n\"Die Hard\" takes place during Christmas and it’s a Christmas movie. The movie takes place in the fictional Nakatomi Plaza, located in Los Angeles. In reality, the Fox Plaza in Los Angeles stood in for the fictional tower. The building has been featured in other movies, such as \"Airheads\" and \"Fight Club.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nBatman Returns\n\nLike \"Die Hard,\" this movie takes place during Christmas and is, therefore, a Christmas movie. Unfortunately, Wayne Manor isn’t real. Gotham City isn’t real. Even so, Merry Christmas."
                },
                {
                    "link": "https://www.foxnews.com/lifestyle/fox-news-brit-hume-christmas-truly-blessed",
                    "title": "Fox News' Brit Hume on the joy of Christmas giving: 'Truly blessed'",
                    "text": "\"For me,\" says Fox News Channel's senior political analyst Brit Hume, \"Christmas remains the holiday.\"\n\nHis charming remembrances and anecdotes focused on this holiday time of year are among the many contributions featured in All American Christmas by Rachel Campos-Duffy and Sean Duffy.\n\nIn Hume's family, the Christmas tree wasn't decorated until Christmas Eve. As a kid, he would \"go to bed, struggle very much to fall asleep, and in the morning I'd come out and find that Santa had arrived,\" he says.\n\n\"There in the living room, this splendid tree was all trimmed and ready to go, complete with gifts beneath it,\" he adds. \"That was such a huge thrill for me.\"\n\nHe also notes that his appreciation \"for the joy of giving, and for surprising and delighting other people … didn't fully develop until I was older\" — something so many of can identify with, to be sure.\n\nHere, in Hume's own words, is a slice of his life as a child growing up in Washington, DC — and his grace notes about the joy that comes with both giving and receiving.\n\nEnjoy Brit Hume's memories here, from ‘All American Christmas’\n\nBrit Hume in All American Christmas: Some people — a lot of people — lament the commercialization of Christmas. For all that, Christmas is the one season when we spend more time than usual thinking about other people and their needs and wishes instead of our own.\n\nOne result is that we, as a people, make more charitable donations than at any other point in the year.\n\nWe think about friends we may not have been in frequent contact with. We may be in touch with a relative whom we've not heard from in a while.\n\nSome people decide that it's a good occasion to lay aside any upsets or differences.\n\nAnd even if it is just about thinking in an unselfish way about what we might be able to buy for someone that will delight him or her, then I believe that's a very healthy thing for us to do.\n\nCHRISTMAS AND WHAT IT REALLY MEANS: TIPS FOR KEEPING US ROOTED IN FAITH\n\nMaybe giving gifts serves as a means to offset those moments when our parents insisted that we get on the phone to thank our aunt or uncle who sent a sweater or scarf that as kids we couldn't have cared less about — and we barely managed to dredge up an ounce of genuine appreciation from the bottom of our gratitude barrel.\n\n\"I know that I've been truly blessed and I wish the same to all.\" — Brit Hume in the new book ‘All American Christmas’\n\nOr maybe we want to replicate the generosity and timeliness of gifts we received like the ones I did from my father's brother, my uncle \"Smoke,\" as he was nicknamed.\n\nFOX NEWS' JANICE DEAN REVEALS THE TRUTH ABOUT THE ‘UGLY CHRISTMAS SWEATER’\n\nI could always count on him.\n\nOnce, he sent me a toy filling station that had opening garage doors and realistic-looking gas pumps. He understood the heart of a child.\n\nI know that I've been truly blessed and wish the same to all, and to all a good night.\n\nGET THE FOX NEWS APP HERE\n\nI hope you wake up on Christmas Day to a fully decorated tree, presents that delight you, and genuine gratitude that makes those thank-you calls as easy as mine were to Uncle Smoke.\n\nExcerpted from All American Christmas by Rachel Campos-Duffy and Sean Duffy. To purchase a copy, click here."
                },
                {
                    "link": "https://www.foxnews.com/lifestyle/viral-gift-wrapping-hacks-holiday-season",
                    "title": "Viral gift wrapping hacks for this holiday season",
                    "text": "A lot of work goes into wrapping gifts in fancy paper that people are just going to rip off anyway.\n\nWrapping gifts is an essential part of celebrating Christmas. There’s nothing more special than coming down on Christmas morning and finding a bunch of presents under the tree.\n\nUnfortunately, getting those gifts all nicely wrapped can be a lot more work than people realize.\n\nThankfully, social media users are sharing their various gift wrapping hacks online. Whether they involve secret techniques for oddly shaped gifts or showing off unique gadgets that help make the process easier, these tips will help make the holidays a lot less stressful.\n\nSERVE THESE THANKSGIVING SIDE DISHES ON THE BIG DAY\n\nLindsay Roggenbuck shared a video on her page that shows how to wrap an oddly shaped gift. Instead of trying to fit the paper around a stuffed animal, she instead folds the wrapping paper into a small bag. Then she simply puts the toy in the bag and tapes the top shut.\n\nNeatly wrapping a tube-shaped gift can also give a lot of people trouble. Lennia, the \"folding queen,\" showed a trick for making the ends look nice and neat. After cutting the paper to size with the tube, she then cuts the ends into tabs. Then she just presses each individual tab down once the paper is wrapped around the tube, giving it a nice clean edge.\n\nFOLLOW US ON FACEBOOK FOR MORE FOX LIFESTYLE NEWS\n\nThe TikTok page Make Life Simpler showed off a method for folding paper in a way that doesn’t require any tape. This is a good skill to learn because everyone’s had that moment where they run out of tape halfway through wrapping gifts.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nAnother TikTok user named Molly, posting under the name The Renegade Home, shared a tip for people that have trouble measuring the right amount of paper for a gift. If the paper ends up being too small, she recommends turning the item diagonally before making any folds. This can help take up less paper in the wrapping process."
                },
                {
                    "link": "https://www.foxbusiness.com/personal-finance/democrats-military-student-loan-forgiveness-biden",
                    "title": "Senators urge Biden administration to simplify military student loan forgiveness program",
                    "text": "A group of prominent Democratic lawmakers are calling on the Biden administration to make it easier for military personnel to have their federal student loans forgiven.\n\nIn a Nov. 17 letter addressed to Education Secretary Miguel Cardona, 14 senators urged the Department of Education to offer student debt relief for military service members under the recently-overhauled Public Service Loan Forgiveness program (PSLF). The letter is signed by progressives like Elizabeth Warren, Bernie Sanders and Amy Klobuchar.\n\nAbout 200,000 military members owe more than $2.9 billion in student loan debt, the letter stated. Yet 94% of service members and civilian employees of the Department of Defense (DOD) who previously applied for the PSLF program have been denied, it continued, citing a report from the Government Accountability Office.\n\nKeep reading to learn more about student loan forgiveness for military service members and consider the alternative debt repayment options like refinancing. You can compare student loan refinance rates on Credible for free without impacting your credit score.\n\nSTUDENT LOAN BORROWERS IN NONPROFIT SECTOR WILL FACE DIFFICULTY WHEN PAYMENTS RESUME\n\nRecent changes to military student loan repayment programs\n\nThe Education Department announced in October an overhaul to the PSLF program that made it easier for 550,000 federal student loan borrowers to qualify for student debt forgiveness, as long as they enroll in a Direct Consolidation Loan by Oct. 31, 2022.\n\nUnder the PSLF program, eligible public servants — including military personnel — can apply to have the remainder of their federal Direct loan debt discharged after making 120 consecutive qualifying payments. The temporary PSLF waiver, which is in effect for a limited time as a result of the COVID-19 national emergency, made it so any prior payment made by eligible PSLF borrowers would count as a qualifying payment.\n\nAdditionally, the Department indicated that it would \"develop and implement a process to address periods of student loan deferments and forbearance for active-duty service members,\" making it easier for military members to qualify for debt forgiveness.\n\nHowever, specific details regarding updates to military student loan forgiveness have been scant. In their letter to Education Secretary Cardona, the senators asked the Department to \"move quickly\" in implementing the planned changes for military service members.\n\nThe lawmakers are also calling for the Biden administration to \"eliminate the need for service members with federal student loans [to] take additional steps in order to receive the benefits\" of PSLF, as long as they've fulfilled their years of service.\n\nThe Education Department hasn't announced any further updates to the PSLF program since the senators wrote the letter last month. Student loan borrowers who need relief now may be able to reduce their monthly payments by refinancing to a private loan at a lower rate. Keep in mind that refinancing your federal loans into a private loan would make you ineligible for select student loan forgiveness programs like PSLF.\n\nStudent loan refinance rates are near historic lows, according to data from Credible. You can browse interest rates from private student loan lenders in the table below.\n\nWHAT TO DO IF YOUR STUDENT LOAN SERVICER IS SHUTTING DOWN\n\nActive-duty military personnel automatically receive student loan relief\n\nIn August, the Education Department announced that it would automatically waive the interest on federal student loans for more than 47,000 current and former active-duty military service members. Previously, eligible military personnel had to apply for the interest waiver.\n\n\"Brave men and women in uniform serving our country can now focus on doing their jobs and coming home safely, not filling out more paperwork to access their hard-earned benefits,\" Richard Cordray of the office of Federal Student Aid (FSA) said.\n\nThe interest waiver applies to certain federal student loans disbursed on or after Oct. 1, 2008, that are held by military personnel who were deployed to hostile areas of imminent danger. Because of these restrictions, not all veterans and active-duty service members will qualify for this benefit.\n\nIf you don't meet the eligibility requirements for the student loan interest waiver or the PSLF program, consider alternative student loan repayment plans such as refinancing. You may be able to pay off your college debt faster, lower your monthly payments and save money on interest.\n\nVisit Credible to compare refi offers, and use a student loan refinancing calculator to decide if this option is right for you.\n\nBIDEN CANCELS $5.8B IN STUDENT LOAN DEBT FOR BORROWERS WITH A TOTAL AND PERMANENT DISABILITY\n\nHave a finance-related question, but don't know who to ask? Email The Credible Money Expert at moneyexpert@credible.com and your question might be answered by Credible in our Money Expert column."
                },
                {
                    "link": "https://www.foxnews.com/opinion/people-capitol-washington-dc-tommy-tuberville",
                    "title": "Let the people back into their Capitol",
                    "text": "NEW You can now listen to Fox News articles!\n\nIt’s time to allow the American people to return to their United States Capitol.\n\nIn March of 2020, Americans came together to reduce the spread of COVID-19 by temporarily closing small businesses, schools, churches, and other public places to in-person attendance. As part of that lockdown, the Capitol complex was closed to the public on March 12, 2020.\n\nGOP SENATORS FRUSTRATED WITH MCCONNELL DEAL TO RAISE DEBT LIMIT, AS MONTHSLONG STANDOFF APPEARS CLOSE TO END\n\nSince then, it has become increasingly clear that the coronavirus is not going away anytime soon. Fortunately, American ingenuity delivered safe and effective vaccines in record-breaking time, and innovation continues on promising new treatments for those infected. Even so, the American people are coming to the realization that the answer is to adapt, overcome, and move forward with their lives, not simply to shut down and wait.\n\nUnfortunately, what was originally an emergency step at the beginning of the pandemic—shuttering the U.S. Capitol and surrounding buildings—has slowly morphed into the new normal in Washington. The ultimate symbol of democracy in our country and around the world remains the Capitol’s dome, but today—in violation of the principles that dome represents—few beyond politicians, congressional staff, and well-connected lobbyists are allowed to stand below it or to visit the elected representatives who work on either side of it. Worse, Democrats in power seem content with the new rules.\n\nIt is not surprising that politicians would find comfort in an arrangement that keeps the public at arm’s length. Public access to the Capitol complex is a check on the democratic process: the people’s direct involvement in the legislative process helps keep lawmakers honest and accountable. The fact that some in office might find it inconvenient or annoying to deal with the American people is of no consequence.\n\n\n\nWith the Capitol complex closed, the number of direct meetings between citizens and their elected representatives is dramatically reduced. Much of the important work of congressional committees is off limits to the public. Public tours of the national landmark are prohibited, and the doors to the U.S Capitol Visitors Center (CVC)—which cost taxpayers $600 million to build—remain locked.\n\nSimilarly, the corresponding limitation on visitors to the Senate and House office buildings is equally frustrating. Some congressional offices, including my own, have been staffed in person throughout 2021. Since April, my office has facilitated in person meetings with constituents and stakeholders, despite the unnecessary requirement that staff meet our visitors at a security check point and escort them through the Russell Senate Office Building.\n\nProviding constituents an opportunity to be heard by their elected representatives and staff is a proud Capitol Hill tradition. As I’m sure many of my colleagues would agree, hearing directly from a constituent about how a federal law, policy, or program affects their life is among the most valuable ways Members of Congress understand public sentiment. Our guests—who express sincere gratitude for the opportunity to be heard in person. That is a worrisome development; we should never allow the norm in Congress to be that American citizens should feel \"grateful\" for a meeting with a Member of Congress or congressional staff. In many respects, our job is to listen, and, in fact, we should be grateful to public for the opportunity to serve in Washington.\n\nAnd, after months of awaiting word that public tours would resume, it was recently announced that Senate staff may lead just two tours per week, with only six people per tour, through an extremely abbreviated visit to the Capitol. It is my understanding that there is still no concrete plan in development to broadly allow visitors in the entirety of the publicly accessible areas of U.S Capitol, to reopen the CVC, or to permit regular and easy access to the Senate office buildings. That must change.\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nWhile it may be reasonable to make certain accommodations to ensure the health and safety of members, staff, and visitors, current conditions no longer justify a blanket prohibition on the public’s access to Capitol Hill. Right now, Democrats run the House and Senate, and their leadership should take all necessary steps to restore public access to the Capitol and surrounding office buildings in a manner consistent with pre-March 2020 security protocols.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nI am confident that virtual meetings with citizens who wish to communicate through those channels will continue. Additionally, individual member offices can determine if and how they receive constituents—and then be judged accordingly by their voters. But, given current health conditions and the likelihood that COVID will, in some form, persist for many years, congressional leadership should no longer allow Congress to hide behind an overly broad exclusion of the American people from in-person civic participation on Capitol Hill.\n\n\n\nIt’s time to find a way to let the people back in."
                },
                {
                    "link": "https://www.foxnews.com/opinion/covid-crime-democrats-risk-david-marcus",
                    "title": "On COVID and crime Democrats assess risk very differently",
                    "text": "NEW You can now listen to Fox News articles!\n\nFor well nigh two years now Democrats across America have urged strict restrictions and obedience from the nation in all matters regarding COVID. Turn your life upside down, send your kid to school in masks to eat lunch in chilly weather on the ground of the yard, and by all means get your two, or three, or however many vaccination jabs. If it can save just one life, and all that. But when it comes to crime, these same lefties have more risk tolerance than a drunk 22-year-old at a Vegas craps table. What gives?\n\nThink about this statement the progressive Milwaukee County District Attorney John Chisholm made when he was elected in 2007 regarding his lax approach to crime, \"Is there going to be an individual I divert, or I put into treatment program, who’s going to go out and kill somebody? You bet. Guaranteed. It’s guaranteed to happen. It does not invalidate the overall approach.\"\n\nAMERICANS WORRY ABOUT SOARING CRIME RATE -- DEMOCRATS RESPOND BY STANDING UP FOR CRIMINALS\n\nWe saw the fruits of this wrongheaded approach last month when Darrell Brooks Jr., exited the turnstile of Milwaukee County’s criminal justice system, despite a rap sheet longer than a CVS receipt, to allegedly murder 6 people at a Christmas parade.\n\nIn New York, a grad student lost his life to a knife attack to another career criminal roaming Manhattan who should have been behind bars.\n\nIt's happening all over the country. And it is making the law-abiding people of America second class citizens in their own cities. While Democrats moan and wail about the danger of the unvaccinated, even though we know that the vaccinated are perfectly capable of spreading COVID, our criminal class is coddled at every turn.\n\nCHICAGO FATHER VIOLENTLY ATTACKED, KILLED WHILE HANGING CHRISTMAS LIGHTS OUTSIDE HOME, FAMILY SAYS\n\nDemocrats and their media allies might argue that COVID and the hundreds of thousands of deaths it has wrought is on a different scale than our crime crisis. But that is little consolation to the families of those who died preventable deaths owing to woke prosecutors. And besides that, crime in our cities is a paralyzing force that rains negative outcomes down on millions of Americans.\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nSo what explains this disparity in risk tolerance? Put simply, COVID has no claim to oppressed status, except maybe in regard to what we are allowed to call it. Sacrificing Americans to COVID serves no social justice purpose, but sacrificing Americans to crime does.\n\nEven regarding COVID we see this dynamic at work. Everyone, including American citizens who enter the country legally must run a gauntlet of COVID restrictions, but those who break into the country through our spaghetti strainer of a Southern border may traipse in free of any protocols at all. The migrants, you see, are oppressed, and exemptions must be made for them.\n\nDemocrats lack the serenity to accept what they cannot change about COVID, they lack the courage to change what they can about crime and are severely lacking in the wisdom to see the difference.\n\nThe irony here is that despite our best efforts for 2 years we have no idea how to effectively stop the spread of COVID, the Florida model, the New York Model, the Sweden model, the Australia model, all have pros and cons. But in regard to crime, we know exactly how to fight it. In cities across America, led by New York, the police tactics of the 1990s chopped crime at the knees, and yet we have abandoned those police and prosecutorial practices.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nDemocrats lack the serenity to accept what they cannot change about COVID, they lack the courage to change what they can about crime, and are severely lacking in the wisdom to see the difference.\n\nThis is not a mystery that progressive prosecutors have to solve, we know how to fight crime in our major cities, it's time we get back to doing it.\n\nCLICK HERE TO READ MORE FROM DAVID MARCUS"
                },
                {
                    "link": "https://www.foxnews.com/opinion/california-colorado-covid-gavin-newsom-jared-polis-jim-breslo",
                    "title": "California could learn from Colorado's Covid choice",
                    "text": "NEW You can now listen to Fox News articles!\n\nTwo western, Democrat-run states are taking exact opposite approaches to the new Covid-19 variants. In California, a new statewide mask mandate takes effect tomorrow. In Colorado, the Governor announced this week that the Covid emergency is over.\n\nWhich decision is correct?\n\nDR. NICOLE SAPHIER: HOW IS COVID GOING TO END?\n\nCalifornia’s mandate comes not come from Governor Gavin Newsom. It comes from Dr. Tomás Aragón, the Director of the California Department of Public Health. This is an unelected position given power to issue such edicts due to the state of emergency declared by the governor almost two years ago. California has been in an ongoing state of emergency since, despite vaccines available to all and dramatic drops in infection rates.\n\nBefore becoming director earlier this year, Dr. Aragon was the health officer for the City and County of San Francisco. Before that he was in charge of public health at University of California, Berkeley, where he is still an adjunct professor. He has degrees from Berkeley and Harvard.\n\nAccording to his biography, he became the state director earlier this year with a mission of \"striving to embody and promote the universal values of dignity, equity, compassion and humility, he works through collaborative partnerships to mobilize communities and institutions to transform policies and systems towards a culture of equity, antiracism, healing and health for all people and our planet.\" Yes, he worked \"equity\" twice into the same sentence.\n\nThe new edict begins by noting that the \"vaccines remain effective in preventing serious disease, hospitalization, and death from the SARS-CoV-2 virus.\" Nonetheless, it goes on to state the Department \"is requiring masks to be worn in all indoor public settings, irrespective of vaccine status, for the next four weeks (December 15, 2021, through January 15, 2022).\"\n\nThe Order states the mandate is necessary because, \"Since Thanksgiving, the statewide seven-day average case rate has increased by 47 percent and hospitalizations have increased by 14 percent.\" But it ignores the fact that mask mandates have already long been in place in many counties in the State. The Order expands the rule to all counties.\n\nYet, it provides zero analysis of the spread of Covid in counties with the mandate versus those without it! Should this not be the most basic due diligence to conduct before issuing an order infringing on individual liberty, and which overrides decisions of local governments and impacts people from Bakersfield to Barstow and Modesto to Tahoe?\n\nCompare this to Colorado -- same virus, same human species -- where Governor Jared Polis just announced: \"The emergency is over… Frankly, people who want to be protected [have gotten vaccinated]. Those who get sick, it's almost entirely their own darn fault.\"\n\nNo new mask mandate in response to another new variant. Rather, Polis said, \"Our top goal is always to follow the science, and there was a time when there was no vaccine, and masks were all we had, and we needed to wear them. The truth is we now have highly effective vaccines that work far better than masks… You don’t tell people to wear a jacket when they go out in winter and force them to [wear it]. If they get frostbite, it’s their own darn fault.\"\n\nWow! Finally, a Democrat leader applying common sense and personal responsibility. He could not be more correct.\n\nAmericans should be free to take whatever measure they wish to stay healthy. Control their immunity through nutrition, exercise, and taking vitamins -- or not. Go out to restaurants or eat at home. Go to the movies or watch Netflix.\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nWear a mask, or two masks, or not. Get vaccinated or not. Get boosted or not.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nIn Colorado, thanks to the governor, Americans now are free to decide for themselves. While in California, Americans remain subject to the arbitrary edicts of a woke Berkeley professor."
                },
                {
                    "link": "https://www.foxnews.com/lifestyle/fbi-issues-warning-against-christmas-scams",
                    "title": "FBI issues warning against Christmas scams",
                    "text": "Nothing spoils Christmas as crime does.\n\nThe holiday season is meant to be a time of giving, but that doesn’t stop some people from trying to take advantage of others. While online shopping has made buying presents easier than ever before, it’s also given scammers more opportunities to steal people’s money.\n\nThe FBI recently issued a press release detailing ways that consumers can stay safe from seasonal shopping scams.\n\nTwo of the most common scams are non-delivery scams and non-payment scams. The first involves a transaction where a buyer sends the seller money but never receives the item. In the second situation, the seller ships out the item, but the buyer never sends the payment (or provides a fraudulent payment).\n\nVIRAL GIFT WRAPPING HACKS FOR THIS HOLIDAY SEASON\n\nIn both cases, people can avoid falling prey to these scams by using trustworthy sites and avoiding unrealistic discounts or offers.\n\nIn general, if a deal looks too good to be true, then it probably is.\n\nThe FBI also recommends regularly checking bank and credit card statements. This way, if a fraudulent charge shows up, it can be dealt with before more charges appear.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nWhen it comes to making purchases, credit cards offer the most protection. The FBI warns against buying anything from a seller that demands cryptocurrency or wire transfers. Those options allow scammers to quickly receive their funds, and usually in a way that’s impossible to refund the victim.\n\nAlso, some scammers will ask for payment solely through gift cards. As is the case with previous payment options, it’s very difficult (or impossible) to return funds to a victim through a gift card.\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\nMost importantly, the FBI states that everyone should secure all of their financial accounts with strong passwords. It’s also important to use a different password for each account."
                },
                {
                    "link": "https://www.foxnews.com/entertainment/britney-spears-slams-diane-sawyer-2003-interview-justin-timberlake-split",
                    "title": "Britney Spears slams Diane Sawyer over 2003 interview following Justin Timberlake split",
                    "text": "Britney Spears is calling out Diane Sawyer for conducting the 2003 interview that left the pop star in tears.\n\nThe songstress opened up in a lengthy Instagram caption that has since been deleted in which she calls out the ABC journalist for coming to her home shortly after her breakup with Justin Timberlake.\n\nWhile discussing the pleasure of being able to shop with her own cash for the first time in years, Spears, wrote via People, \"I do love shopping though…who doesn't??? Do we dare forget the Diane Sawyer interview in my apartment almost 20 years ago ??? What was with the ‘you’re in the wrong' approach?? Geeze…and making me cry ???\"\n\nSpears, 40, revealed that after her \"big breakup\" with Timberlake, she \"never spoke to anyone.\"\n\nBRITNEY SPEARS RELAXES ON VACATION IN CABO AFTER CONSERVATORSHIP WIN\n\n\"Something I never shared when I had that big break up years ago was that I couldn't talk afterwards … I never spoke to anyone for a very long time …I was in shock,\" Spears reportedly wrote.\n\n\"pretty lame of my dad and three men to show up at my door when I could hardly speak …two days later they put Diane Sawyer in my living room … they forced me to talk !!! I was a baby …I was almost 22 and didn't understand but I f---ing know now !!! She said ‘a woman or a girl’ … I would like to say now ‘ma’am I'm a catholic slut!!! You wanna join me at a mass and I can serve your husband my certificate on shopping for anonymous players ???'\" Spears continued.\n\nThe singer then went on to discuss how she deserves access to her own money.\n\n\n\n\"I should spend a thousand dollars if I want every day of my life and she can kiss my white a--,\" Spears continued.\n\nBRITNEY SPEARS' CONSERVATORSHIP: A TIMELINE\n\nThis isn't the first time Sawyer has been accused of alleged mistreatment of Spears from the 2003 interview. In February, viewers of the \"Framing Britney Spears\" documentary called out the media titan for painting Spears as the heartbreaker during her split from Timberlake.\n\n\"He has gone on television and pretty much said you broke his heart,\" Sawyer said to the then-22-year-old singer. \"You did something that caused him so much pain, so much suffering… What did you do?\"\n\nThe \"Toxic\" singer then went on the defensive against her family, claiming she's \"embarrassed\" for them for a number of reasons.\n\n\"I'm more embarrassed for my family for condoning the fact that I wasn't allowed to have cash for so long when I worked my little a-- off for them…I'm embarrassed for the State of California for permitting my father to have me work as hard as he worked me all those years and never seeing a dime… I'm embarrassed for all of them and I'm sad for them because I know my value and worth now …and they LOST ME !!!\" Spears continued in the deleted post. \"\n\nIn a statement to Fox News on Tuesday, Jamie Spears' attorney said, \"Mr. Spears has no idea what Ms. Spears is talking about. Jamie never set up any interview with Diane Sawyer and was not present for any such interview. He had nothing to do with Britney’s career at this point and was completely uninvolved in this interview. Jamie loves Britney very much, wishes Britney nothing but the best and hopes that she continues to seek the help that she needs to stay safe and healthy.\"\n\nCLICK HERE TO SIGN UP FOR OUR ENTERTAINMENT NEWSLETTER\n\nElsewhere in the post, Spears discussed her decision not to tour, calling life on the road \"hard,\" according to the outlet.\n\n\"My first three years in the biz and on the road were great but I'll be completely honest and say that after those three tours and the pace I was going... I don't think I ever want to do it again,\" she reportedly wrote. \"I hated it.\"\n\nReps for Sawyer did not immediately return Fox News' request for comment.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSpears' lengthy Instagram post comes nearly a week after she scored a small victory in court. One month after Judge Brenda Penny ended the singer's conservatorship, the pop star was given authority to sign her own documents.\n\nThere is another hearing set for Jan. 19 to address the same matters."
                },
                {
                    "link": "https://www.foxnews.com/entertainment/saturday-night-live-alum-chris-kattan-famous-film-cancel-culture",
                    "title": "'SNL' alum Chris Kattan weighs in on cancel culture: ‘You can’t be outrageous anymore’",
                    "text": "Chris Kattan has been keeping busy doing things his way.\n\nThe \"Saturday Night Live\" alum is starring in the theater-film hybrid \"Famous,\" which exposes the tale of fictional A-list celebrity Jason Mast who must push \"the boundaries of friendship to reveal the true cost of fame.\"\n\nWritten and directed by Michael Leoni, \"Famous\" also stars CJ Valleroy, Brooke Butler and Josh Pafchek.\n\n\"I like drama and when I’m offered something dramatic, that’s really cool,\" the comedian told Fox News. \"The [film] was originally a play and I loved the approach. The director wanted to use the same actors that were in the play and they were already so close with each other. They had such amazing energy, and it was really great to be a part of that. I do stand-up a lot, which is a solo thing, so it’s really neat when I get to work with other people and [the script] happens to be dramatic.\"\n\nCOMEDIAN CHRIS KATTAN TALKS OPIOID ADDICTION, HIS 'SATURDAY NIGHT LIVE' AUDITION\n\nStill, the 51-year-old hasn’t forgotten his comedic roots. Before finding fame, he was a member of The Groundlings in Los Angeles where his father, Kip King, served as a founding member. The theater and school, established in 1974, has launched the careers of numerous stars, such as Paul Reubens, Jon Lovitz, Lisa Kudrow, Jennifer Coolidge and Jimmy Fallon – just to name a few.\n\nThen from 1996 until 2011, Kattan starred in \"SNL\" where he did impressions of Bill Gates, Ben Affleck, Al Pacino and Queen Elizabeth II, among others. He also played notable characters, including Mango, Mr. Peepers and one-half of the dim-witted \"Roxbury\" brothers.\n\nKattan said he has seen recent episodes of \"SNL\" and thinks it’s \"great.\"\n\n\"[The cast] works so well together,\" he said. \"I love seeing that chemistry. It’s making me laugh a lot lately and it’s great that they’re allowing guests to poke fun at themselves or to just show how funny they can be too. ‘SNL’ has this great sixth sense when they can tell if someone is genuinely funny, but they haven’t had the chance to show an audience that, let alone the world. Like, look at Harry Styles. Who would have thought? ‘SNL’ allows the person to have a space where they can be funny. And it’s neat that we’re seeing that more with the guests.\"\n\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\nAs for today’s cancel culture, Kattan admitted he isn’t fazed by it because he’s not \"a provocative person.\" The star noted he relies on self-deprecating humor and focuses more on creating characters than stirring headlines.\n\n\"I write and direct shorts, but it’s really family-friendly,\" he explained. \"You just need to think about what a family would like because we’re all in this same space together. Because of COVID, we went back to the people we love and we spent more time together at home. And I think with humor, if you can look at any age or sex and they’re laughing, then I think you’re in the right place when it comes to comedy. And that’s where I almost always have been. My humor is family-friendly.\"\n\n\"The reality is that right now, everyone has to be careful about what they say or do,\" he continued. \"But [I'm] already careful… I naturally don’t swear. I say things like ‘what the frick’ or ‘dang it’ and ‘darn it.’ I don’t know why, it’s just a strange habit. Even my mom was like, ‘You’re not swearing so much lately.’ I know it’s weird.\"\n\nKattan noted that comedy has changed over the years and performers need to be mindful of what works for today’s audiences.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"If you want to do something funny, you can’t be outrageous anymore,\" he said. \"You do have to be careful, but I think family-friendly is the way to go right now. And that’s the kind of humor I like anyway. And that’s the humor I like doing.\"\n\nKattan wrote a memoir in 2019 titled \"Baby, Don’t Hurt Me,\" where he described a life-changing injury that he claimed he sustained on \"SNL.\" According to Kattan, a sketch that aired in 2001 required him to fall back in a chair. However, he landed hard on the stage and broke his neck. In the years following his injury, and the multiple surgeries that came with it, he suffered career struggles and was faced with opioid addiction.\n\nBut over the years, Kattan has relied on his love of comedy to help him through his injury and addiction. In addition to stand-up and his new film \"Famous,\" Kattan has a new sketch comedy show on YouTube, titled \"Hey Kattan!\".\n\n\"I get to do a new video every week and it’s been really fun to do,\" he said. \"That’s where I’m starting.\"\n\n'Famous' is currently in theaters and video on demand."
                },
                {
                    "link": "https://www.foxnews.com/entertainment/taylor-swift-defends-birthday-alana-haim",
                    "title": "Taylor Swift defends joint birthday party with 'Licorice Pizza' star Alana Haim: 'We tested everyone'",
                    "text": "Taylor Swift isn't letting the coronavirus pandemic get her down on her special day.\n\nThe pop star turned 32 on Monday and celebrated with a close friend of hers, HAIM band member and \"Licorice Pizza\" star Alana Haim, who will turn 30 on Wednesday, just days after receiving her first Golden Globe nomination for starring in the comedy.\n\nSwift gave fans a peek at their party by sharing two pics on social media.\n\nIn the first pic, the two singers danced with one another, as well as what seemed to be a sizable group of people. A disco ball could be seen hanging from the ceiling.\n\nPRINCE WILLIAM SAYS HE FOLLOWED TAYLOR SWIFT ‘LIKE A PUPPY’ ON STAGE TO SING WITH JON BON JOVI: ‘I’M CRINGING’\n\nIn the second shot, Swift and Haim embraced behind a pair of matching birthday cakes.\n\n\"*Don’t say it, don’t say it OKAY I’m saying it:* I’M FEELIN 32,\" Swift wrote in the caption of the photos, referencing \"22,\" one of her most popular hits. \"And Alana is feeling 30.\"\n\nThe singer then took an opportunity to get out ahead of critics and explain that despite the ongoing pandemic, she and Haim partied safely.\n\nTAYLOR SWIFT, BLAKE LIVELY SHOW MILES TELLER SUPPORT AS ACTOR SHUTS DOWN FANS' SPECULATION HE'S UNVACCINATED\n\n\"Don’t worry we tested everyone!\" add the star. \"Thank you so much for the birthday wishes, I love you all so much.\"\n\nIt's a big week for Haim, between her birthday and her Golden Globe nomination, which could put her on track to secure an Oscar nomination as well.\n\nJAKE GYLLENHAAL SHOULD RETURN TAYLOR SWIFT’S SCARF, DIONNE WARWICK SAYS: 'I WILL PAY THE COST OF POSTAGE'\n\nIn \"Licorice Pizza,\" directed by Paul Thomas Anderson, Alana stars as a young woman in the throes of young love in the San Fernando Valley in the early 1970s. She stars opposite Cooper Hoffman, son of the late Philip Seymour Hoffman.\n\nThe film also features Bradley Cooper, Tom Waits, Maya Rudolph, Sean Penn and Benny Safdie.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nHaim's sisters and bandmates Este and Danielle also have roles in the film.\n\nCLICK HERE TO SIGN UP FOR OUR ENTERTAINMENT NEWSLETTER\n\nSwift, on the other hand, is still riding the success of the re-release of her album \"Red,\" which saw her 10-minute version of \"All Too Well\" hit No. 1 on the Billboard Hot 100, becoming the longest song to do so."
                },
                {
                    "link": "https://www.foxnews.com/auto/toyota-electric-pickup-off-road-suv",
                    "title": "Toyota reveals electric pickup and off-road SUV during huge EV blast",
                    "text": "Toyota put the automotive world on notice Tuesday announcing a $70 billion plan to electrify its lineup, which includes the launch of more than dozen all-electric models by 2025 that it previewed with fleet of concept vehicles.\n\nAmong the crossover-style SUVs, like the bZ4X that will be first to market next year, were three particularly tantalizing vehicles.\n\nOne is simply designated the Pickup EV, which appears to be a Tacoma-size truck that retains traditional styling, rather than the outlandishness of something like the Tesla Cybertruck. The only indication of its propulsion system being a blanked-out grille.\n\nAn SUV called the Compact Cruiser EV is clearly inspired by the classic FJ40 Land Cruiser and FJ Cruiser that ended U.S. sales in 2014. The boxy four-door is equipped with a large skid plate and fender flares, suggesting it could launch with a modicum of off-road capability, and appears to have borrowed some styling elements from the FT-4X concept of 2017.\n\nToyota may have also given fans of the long-gone MR2 sports car something to look forward to in the form of the Sports EV. The tiny, two-seat coupe features mid-engine styling, even if cars with electric motors don't really fit that description.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nOne thing Toyota didn't announce is technical specifications for any of the vehicles, although there was a Lexus Electrified Sport grand touring concept with the Toyotas that it said would be able to accelerate to 60 mph in the 2-second range."
                },
                {
                    "link": "https://www.foxnews.com/lifestyle/mom-red-plate-hack-dinnertime-tradition",
                    "title": "Mom's 'red plate' hack is the heartfelt dinnertime tradition to adopt tonight",
                    "text": "When a red plate is placed on the table at Emily Rousell's house, her four kids know someone in the family is being celebrated that night.\n\nThe tradition was started \"three or four years ago,\" Rousell told Fox News.\n\n\"We started out using a special 'celebration' plate for family birthdays,\" she said. \"Soon we realized that there were other moments, in addition to birthdays, that we wanted to hold up as special and recognized. Our regular dinner plates are white, so red seemed like a good choice to stand out from the rest and highlight a person's spot at the table.\"\n\nRecently, Rousell shared on Facebook that her daughter had lost a student council election. She was understandably confused when her mom told her the red plate was in her honor.\n\nThe Pittsford, New York, mom wrote in part:\n\nAnd yes, maybe as far as winning that title, she'd lost.\n\nBut really she'd won.\n\nBy being willing to be brave. To be vulnerable. To go after a goal.\n\nBy hugging the friend that took the coveted spot and congratulating her.\n\nBy handling her disappointment with grace.\n\nBy learning that sometimes we win and sometimes we lose, but life's really important lessons come from the journey and not the outcome.\n\nBy jumping in a race she cared about and giving her best effort.\n\nThat's a red plate kind of dinner night.\n\nThe red plate, Rousell told Fox News, has changed the family dynamic.\n\n\"Parenting happens in layers, and as many opportunities we get or can create to positively reinforce and encourage and build them up, the better,\" she said. \"Sometimes in a bigger family it's too easy to not be seen individually - this provides one extra way for them to have an extra moment now and then when they can feel special and known as an individual and not just part of the sibling group.\"\n\nHer kids even come to their mom to share why they think one of their siblings should get a red plate.\n\n\"The red plate is quick, it doesn't require any extra time when pulling dinner together, but it definitely serves its purpose,\" Rousell said. \"We make sure that in addition to something achievement-based, like a report card or a winning game, that it comes out to celebrate true effort and heart no matter the outcome.\""
                },
                {
                    "link": "https://www.foxbusiness.com/lifestyle/costco-worker-viral-tiktok-debate-pay",
                    "title": "Costco worker's viral TikTok sparks debate about pay",
                    "text": "A Costco employee has gone viral for posting a video on TikTok talking about her pay.\n\nNatalie, a TikTok user who goes by the handle @natnatt21, posted a short clip on the social media platform last week, where she said that she makes $29.50 an hour as a Costco employee.\n\nIn the video, which appears to show Natalie and one of her co-workers in a Costco store, Natalie wrote the words \"When you make $29.50 just to draw smiley faces on receipts.\"\n\nCOSTCO REPORTEDLY RAISES MINIMUM WAGE TO $17 AN HOUR\n\nShe captioned the video: \"And it’s union.. Gotta love Costco.\"\n\nSince she posted the video on Nov. 28, Natalie’s video has been viewed more than 17.5 million times.\n\nMany people who commented on the clip seemed upset by Natalie’s pay.\n\n\"That’s more than some nurses make ain’t it? Pretty bogus,\" one person wrote.\n\n\"I’m out here saving lives and you’re putting smiley faces on paper,\" another person said.\"AND we have the same pay…. Make it make sense.\"\n\nSomeone else commented: \"Then why am I getting less than that to save lives?\"\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\nOther commenters responded saying that people who were mad shouldn’t be mad at Costco or the company’s employees.\n\n\"Don’t blame Costco blame the system,\" one commenter said.\n\nAnother wrote: \"Be mad [at] your employer who underpays you and makes you work hard for a raise.\"\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nMeanwhile, other commenters praised Costco for offering generous pay to its workers.\n\n\"My fiancé works for Costco as an Operations Supervisor,\" one person wrote. \"BEST company to work for!!!!\"\n\n\"They say one of the best retail jobs is Costco,\" someone else said.\n\nAnother person added: \"I love Costco for this reason. Also it shows that they pay their employees well. They all seem happy to work and super friendly.\"\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nCostco did not immediately respond to FOX Business's request for comment on Natalie’s video.\n\nIn October, Costco raised its starting hourly wage for new employees to $17 an hour, FOX Business previously reported.\n\nThe change was made effective on Oct. 25 of this year and applied to all new employees in the U.S., according to the report."
                },
                {
                    "link": "https://www.foxnews.com/entertainment/celebrities-christmas-lights-display-california-manisons",
                    "title": "Jamie Foxx to Kim Kardashian: Celebrities show off massive Christmas light displays on California mansions",
                    "text": "Celebrities went all out this holiday season with their outdoor Christmas lights displays.\n\nJeff Bezos, Kim Kardashian, Jamie Foxx, Kourtney Kardashian and others decorated their oversized California homes with tons of bright lights.\n\nFoxx's 40-acre property was decked out. The trees lining the drive to the actor's $10.5 million home have been decorated in blue, red, purple, green and orange lights. Other trees on the property are covered in multicolor lights.\n\nFoxx bought the property, located in the Hidden Valley area of Los Angeles, back in 2007. The 17,000 square foot home features 10 bedrooms and 12 bathrooms. The home includes a library, formal living and dining room, full gym, gourmet kitchen, a breakfast room, game rooms and family rooms, according to Variety.\n\nTHESE ARE THE DAZZLING CHRISTMAS LIGHT DISPLAYS ACROSS AMERICA\n\nBezos and Lauren Sanchez' home also featured a massive Christmas display. The trees around the $165 million home, located near Sunset Boulevard, were decorated in red, green or white lights.\n\nThe 12,254 square foot home features eight bedrooms and 10 bathrooms. The home includes a formal living room with an antique fireplace, an indoor-outdoor bar, a game room and a den with a fireplace.\n\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\nKim Kardashian, who recently paid her estranged husband Kanye West $23 million for the Hollywood Hills mansion, went all out for Christmas this year.\n\nKim made sure white lights were strung in every tree lining the property\n\nThe 15,000 square foot home is now worth $60 million after the couple previously sunk $20 million into the property for a renovation project, according to Kris Jenner. The build out added a multitude of hallways, two pools, a vineyard and a sink, as previously reported.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nKourtney Kardashian's Christmas lights display mirrored her sister's. The reality TV star's trees were also strung with warm white lights.\n\nKourtney's 11, 746 square-foot Calabasas home features six bedrooms and nine bathrooms. The mansion sits on a 1.86 acre lot and includes a chef’s kitchen, game and children’s play room, spa, sauna, elevator and theater."
                },
                {
                    "link": "https://www.foxnews.com/auto/1987-buick-gnx-muscle-car-sold-ebay-record-249999",
                    "title": "1987 Buick GNX muscle car sold for Ebay record of $249,999",
                    "text": "The Buick GNX isn’t just a quick quarter-mile muscle car, it's also firmly a quarter-million-dollar muscle car.\n\nAn example of the rare 1987 coupe was sold last week on Ebay for $249,999, marking the second-highest price paid for the quickly-appreciating classic and an Ebay record.\n\nSeveral have gone for over $200,000 this year, including one with 759 miles on the odometer that went for $236,000 and another with 8.7 miles that was auctioned at the Barrett-Jackson Las Vegas event in June for a record $275,000.\n\nThe Ebay car was number 372 of the 547 that were built during the GNX’s single model year and has been driven just 426 miles since.\n\nThe seller, avid American muscle car collector Anthony Saia, told Fox News Autos he only put four of those miles on it during the seven years since he bought it from the original owner as an investment.\n\nIt’s not the first GNX he’s flipped, but he felt the timing was right given the hot market for the car this year and got about double what he did for the last one a couple of years ago, but he doesn’t think the top has been reached yet.\n\nSaia expects a GNX to break $300,000 soon, and the trend line definitely backs up his position.\n\nOne thing he doesn’t expect to see going up is the mileage on any of these barely-driven examples, as they have clearly made the transition to appreciating assets that need to be preserved.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe GNX name is short for Grand National Experimental. The car is powered by a turbocharged 3.8-liter V6 with over 300 hp and was produced through a collaboration between Buick, McLaren Engines and ASC Incorporated.\n\nAccording to contemporary tests by Car and Driver it was the quickest American car of the day to 60 mph and second in the world only to the Porsche 911 Turbo."
                },
                {
                    "link": "https://www.foxnews.com/auto/tesla-cybertruck-spotted-giant-windshield-wiper-troubles-elon-musk",
                    "title": "New Tesla Cybertruck spotted with giant windshield wiper that 'troubles' Elon Musk",
                    "text": "It looks like the Tesla Cybertruck will drive softly and carry a big stick … to clean its enormous windshield with.\n\nA new electric Cybertruck prototype was spotted by a drone photographer being tested at Tesla's Fremont, Calif., facility equipped with several new features not seen on the original concept that debuted in 2019. Chief among them is a giant, single-arm windshield wiper parked vertically along the roof pillar, which appears to house two blades along its length.\n\nElon Musk commented on the photos on Twitter, writing, \"The wiper is what troubles me most. No easy solution. Deployable wiper that stows in front trunk would be ideal, but complex.\"\n\nTesla recently filed patents for both a laser system that could zap debris off of a windshield or camera cover, and wipers that move on electromagnetic rails instead of the traditional recirculating motors, but neither is evident on the vehicle.\n\nThe truck also now has conventional rearview mirrors that Musk said are required by law, but removable, suggesting it will also have a side-view camera system that can be used instead.\n\nTelling of its final size, there are three amber marker lights between its headlights. The lights are required for trucks wider than 80 inches, such as heavy duty pickups and also the high performance Ford F-150 Raptor and Ram 1500 TRX. The upcoming GMC Hummer EV pickup, which is launching with a heavy duty model, is also large enough to require the lights.\n\nWhat appears to be a trunk opening in the cargo bed, similar to the ones featured on the Honda Ridgeline and Hyundai Santa Cruz, can also be seen in the overhead photographs and the charging port is now integrated into the left rear fender flare.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nMusk said that \"there will be a few tweaks before production,\" and, after much online debate ensued over the wiper, added \"that is not the production wiper.\"\n\nHe also confirmed that the first version of the Cybertruck that will be available when production begins late next year will have four-motor drive and four-wheel steering that will allow it to drive sideways in the same fashion as the Hummer EV."
                },
                {
                    "link": "http://www.foxnews.com/us/we-are-alive-mayfield-survivors-describe-heart-wrenching-moments-before-after-tornadoes",
                    "title": "Mayfield, Kentucky, tornado survivors describe heart-wrenching moments before, after twisters",
                    "text": "Survivors in Mayfield, Kentucky, described the moments before and after a deadly tornado ripped through their town.\n\n\"I was in my bedroom, and my grandmam she came in yelling,\" Blake Jacoway, told Fox News. \"All we heard was a loud train noise … just rumbling.\"\n\n\"I felt like I was going to die. I didn't think, we was going to make it out of here,\" Jacoway continued.\n\nWATCH:\n\nTornadoes ripped through multiple states Friday and Saturday, flipping telephone poles, trees and cars. Kentucky was hit hardest, leaving at least 74 dead and around 100 missing, Kentucky Gov. Andy Beshear said Monday.\n\nKENTUCKY, ILLINOIS, MISSOURI TORNADO AND STORM DAMAGE: LIVE UPDATES\n\n\"Undoubtedly there will be more,\" Beshear said as the search through wreckage continued.\n\nIn Mayfield, buildings and houses were flattened.\n\n\"I was at work, we was doing the normal stuff,\" Mayfield local, Ja-sean Kocatow told Fox News. When he started getting tornado warnings on his phone, he left work, went home and changed out of his work clothes.\n\nKocatow was looking out his hallway window when he saw \"coming out of the street, just stuff just flying in the air.\" He took shelter in his basement with his family and some friends.\n\nImmediately after the tornado passed, Kaitlynn Kemp went to her grandfather and uncle's nearby sawmill.\n\n\"We were out there in the pouring rain looking for bodies,\" she told Fox News. \"We didn't expect to find anybody.\"\n\nAs she searched through the mud and rubble, Kemp said she \"didn't know if you're going to pick out something and a body was going to be under it or what was going to be under there.\"\n\nKENTUCKY CANDLE FACTORY SURVIVOR WHO LOST BOYFRIEND IN TORNADO SAYS UNIDENTIFIED 'SUPERMAN' SAVED HER LIFE\n\nKemp found members of an Amish family she knew well. The parents and two of their five kids died, Kemp told Fox News.\n\nA Mayfield police officer, Jasper Mundy, described efforts to help Kemp that night.\n\n\"There was a guy trapped under the house, but he was deceased after getting the house off the top of him,\" he said.\n\nThe police officer told Fox News numerous people were pulled from under rubble.\n\n\"I can't get it out of my head. This morning we went to church and I just saw it,\" Kemp said. \"Last weekend, I was around all of them at their Christmas party, I played cornhole with them, the kids were running around playing with everybody.\"\n\nKemp's mother, Danielle Kemp, said the community was already burdened with poverty.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"I mean a lot of these people … this is all they had,\" she said.\n\n\"It's basically going to be starting over,\" Tommy Anderson told Fox News as he sifted through the rubble of his house. \"This is our home, we raised our kids here and then our grandkids.\"\n\n\"But we are alive,\" Anderson told Fox News. \"And well. We have hope for tomorrow.\""
                },
                {
                    "link": "http://www.foxnews.com/us/chicago-rooftop-revelations-day-24-with-pastor-corey-brooks",
                    "title": "Chicago rooftop revelations: Jussie Smollett used race to divide us, South Side pastor says",
                    "text": "On Day 24 of his 100-day rooftop vigil, Pastor Corey Brooks addressed the damage he said the Jussie Smollett spectacle did to Chicago and America-at-large. Many political leaders weighed in on Smollett’s hate crime accusation, from the beginning of the hoax to the trial that found him guilty last week. But all the while, serious issues like gang violence plague the South Side where Brooks works every day to build a community center with the goal of creating more opportunities for the locals.\n\nBrooks began his rooftop revelations by reading a tweet from GQ magazine that was posted in 2019: \"The racist, homophobic attack on Jussie Smollett is far-right America’s endgame.\"\n\n\"I wonder how they must feel now after supporting a man who tried to racially divide all of America,\" Brooks said. \"Supporting someone who was not trying to make America better, but was looking at all the evil intentions and trying to abuse them to divide us even further apart.\"\n\nCHICAGO ROOFTOP REVELATIONS: DAY 23 WITH PASTOR COREY BROOKS\n\nHe continued: \"When we have so much stuff going on with all the violence, with all the shooting, [Smollett] comes to our city and uses the race card to divide us. He didn’t come here to help us deal with the issues that we're faced with, to help us deal with the violence that we're dealing with every single day. He used the race card to further divide us as an American people.\"\n\nJussie Smollett garnered sympathy from leaders like President Biden and Vice President Harris. Neither apologized for their apparent rush to judgment.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"I'm glad he got caught in his lie,\" said the pastor. He went on to say that the biggest problem that we face in America is not the racism that Smollett would argue is everywhere.\n\nInstead, the pastor said, \"learning how to be more neighborly\" is the greatest problem America faces. \"How to treat our brothers and sisters decently, learning how to be the best that we can possibly be, regardless of race, regardless of party, regardless of our economic affiliations.\"\n\nFor more information, please visit Project H.O.O.D ."
                },
                {
                    "link": "http://www.foxnews.com/politics/new-yorkers-noncitizens-vote-city-elections",
                    "title": "What do New Yorkers think about letting noncitizens vote in city elections?",
                    "text": "NEW You can now listen to Fox News articles!\n\nNew Yorkers were two-minded about a new measure that would grant almost a million noncitizens the right to vote in citywide elections.\n\n\"I think it's a good idea,\" a New Yorker in favor of the change told Fox News. \"If they're living here, but they're on a working visa, I mean, I guess they should have a say as to what's going on in the city, right?\"\n\nAnother lifelong New Yorker opposed the measure, saying, \"I do not agree with it. Why should they? They're not from here.\"\n\nThe New York City Council passed legislation Thursday to allow nearly 800,000 legal noncitizens who have lived in the city for over 30 days to vote in local elections. It would apply to green-card and work-permit holders as well as those within Deferred Action for Childhood Arrivals (DACA).\n\n\"That’s awesome … I absolutely love it,\" a first-generation American and lifelong New Yorker told Fox News.\n\n\"The 800,000 that get to vote are the people who also live here. So it's going to affect their community – they should also have their own voice,\" he continued.\n\nLETTING NONCITIZENS VOTE 'SUFFOCATES LIBERTY' BY MAKING GOVERNMENTS LARGER, ANDREW MCCARTHY SAYS\n\nOne woman also agreed with the move, saying, \"As long as they're educated about politics and politicians, then I think that's great.\"\n\nNew York City Councilman Ydanis Rodriguez, who introduced the legislation, said in a statement Thursday: \"In one of the most diverse cities in the world, we need to ensure that there is adequate representation for all New Yorkers. That starts by expanding the scope of who is allowed to vote in our local elections.\"\n\nOthers, however, questioned the city council's decision.\n\n\"An American citizen has the right to vote, and I believe that that is important that we maintain that level of integrity,\" one man said against the new legislation.\n\nAnother man told Fox News: \"It's a great country. People do want to come here and better their lives and better their families' lives … But I do think we should keep the standard as ‘citizenship is what gives you your right to vote.’\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nDespite previously criticizing the bill, outgoing Mayor Bill de Blasio has said he will not veto it.\n\nThe bill is likely to face legal challenges from Republicans.\n\n\"American citizens should decide American elections — full stop,\" Republican National Committee Chair Ronna McDaniel said in a statement Thursday. \"Today's decision in New York is the product of a radical, power-hungry Democrat Party that will stop at nothing to undermine election integrity,\"\n\nTeny Sahakian is an Associate Producer/Writer for Fox News. Follow Teny on Twitter at @tenysahakian."
                },
                {
                    "link": "http://www.foxnews.com/us/rooftop-revelations-day-23-with-pastor-corey-brooks",
                    "title": "Chicago rooftop revelations: Day 23 with Pastor Corey Brooks",
                    "text": "On Nov. 20, 2021, Pastor Corey Brooks began his rooftop vigil for 100 days and nights to help end gun violence on the South Side of Chicago. His anti-violence plan includes raising funds to build a major community center that will address violence head on. This center aims to convert gangsters into citizens, provide trauma counseling to victims of violence, fill in the education gaps left by the failing Chicago Public School system, offer vocational training for the trades and provide a safe place for the youth during after school hours.\n\nBut this not a South Side problem alone, Brooks said. He called it an American problem.\n\nThat is why for the remainder of Brooks’ stay on the freezing roof, he will broadcast his \"Rooftop Revelations\" to all of America on this site every day.\n\nCHICAGO POLICE OFFICER CHARGED WITH MURDER OF MOTHER OF HIS CHILD IN SHOOTING\n\nWe were with the pastor on Day 1.\n\nWe rejoined the pastor on Day 23. He began by describing how his neighborhood is known in Chicago and around the world, especially among Blacks, as \"O-Block.\" The name comes from a young gangster named O.D. Perry who was shot and killed on the block. The pastor wants to transform the negative connotations of the \"O\" into positive ones by creating \"Opportunity Block.\"\n\nIn his introduction video, he said transformation begins by acknowledging that \"race is not the biggest problem that we face in the United States of America, and it’s definitely not the biggest problem that we face in Chicago.\" He also said the \"government has simply failed our community on the South Side.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThis rooftop journey will include the pastor’s thoughts, as well as his conversations with CEOs, gangsters, community leaders, youths and on.\n\n\"I'm gonna be coming to you throughout the duration of these days, right here on Fox News, to talk to you about the issues, the problems, possible solutions and what we can do as American citizens to make life better for everyone,\" Brooks said.\n\n\n\nFor more information, please visit Project H.O.O.D.\n\nEli Steele is a documentary filmmaker and writer. His latest film is \"What Killed Michael Brown?\" Twitter: @Hebro_Steele"
                },
                {
                    "link": "http://www.foxbusiness.com/markets/jpmorgan-tells-unvaccinated-workers-to-stay-home",
                    "title": "JPMorgan tells unvaccinated workers to stay home",
                    "text": "JPMorgan Chase & Co. told unvaccinated employees in New York that they must work from home starting Tuesday.\n\nThe bank had previously allowed unvaccinated staff to work in its Manhattan offices if they were tested twice a week. It had already limited their ability to travel and attend meetings, either internally or with clients. And it had said they would bear some of the expense by paying higher healthcare costs in 2022.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\n\"We also agree with health authorities that being vaccinated against Covid-19 is the best way to keep ourselves and our loved ones safe—especially as we face the winter months and a new variant,\" the bank’s Return to the Office Task Force said in a memo to unvaccinated employees Monday night.\n\nNew York Gov. Kathy Hochul said Friday that New Yorkers must wear masks in public indoor places unless those places require people to be vaccinated against Covid-19. That requirement went into effect Monday.\n\nTuesday, JPMorgan began requiring vaccination proof for all employees and visitors to enter its New York office buildings, a step other banks had taken before.\n\nJPMORGAN IN TALKS TO PAY $200 MILLION FINE OVER EMPLOYEE TEXT MESSAGES\n\nThe work-from-home order is considered temporary and the bank is studying potential other solutions to deal with the state order.\n\nJPMorgan also relaxed mask requirements for vaccinated employees in the New York corporate offices.\n\n\"It seems unfair to require our vaccinated employees to wear masks all day at their desks,\" the bank said in the memo. More than 90% of JPMorgan staff based in Manhattan are vaccinated, according to the memo.\n\nTicker Security Last Change Change % JPM JPMORGAN CHASE & CO. 159.13 +1.21 +0.77%\n\nThe memo was previously reported by Reuters.\n\nJPMorgan, the biggest bank in the U.S., has taken a relatively hard-line approach on curtailing work-from-home, telling many workers this summer that they needed to come back to the office. Chief Executive Jamie Dimon has said that remote work doesn’t make sense for clients or employees.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nThe Omicron variant has muddled the picture for many companies. In recent days, companies as varied as Facebook parent Meta Platforms Inc., Ford Motor Co. and Alphabet Inc.’s Google have delayed return-to-office dates or given employees the option to stay home longer.\n\nWrite to David Benoit at david.benoit@wsj.com"
                },
                {
                    "link": "http://www.foxbusiness.com/technology/google-memo-lays-out-plan-to-fire-employees-out-of-compliance-with-vaccine-rules-report",
                    "title": "Google memo lays out plan to fire employees out of compliance with vaccine rules: report",
                    "text": "Unvaccinated employees at Google may soon have to use the search engine to find job openings.\n\nLeadership at the Mountain View, California, tech behemoth circulated a memo that reportedly showed the steps that the company will take before firing employees who are out of compliance with the company’s vaccine policy.\n\nThe company's 150,000 employees were already expected to inform the company about their vaccine statuses or apply for some kind of accommodation, CNBC reported, citing an internal memo. Google plans to contact those who missed the deadline and those who are still unvaccinated. These employees will have until Jan. 18 to comply or be placed on paid administrative leave for about a month, the report said.\n\nThe report said the next will be unpaid personal leave for up to six months, and then termination.\n\nA Google spokesperson told Fox Business that its \"vaccination requirements are one of the most important ways we can keep our workforce safe and keep our services running.\"\n\n\"We’re committed to doing everything possible to help our employees who can get vaccinated do so, and firmly stand behind our vaccination policy,\" the spokesperson said.\n\nMany companies—like Google—were hoping to get most employees back into their offices in January, but the emergence of COVID-19 variants have dampened those hopes. About 41% of the workforce in major cities have returned to their desks, the Wall Street Journal reported, citing Kastle Systems. The security company tracks access-card swipes at office buildings.\n\nMeta Platforms Inc., formerly known as Facebook Inc., said that it will fully reopen its offices by the end of January while giving employees the option to delay their return.\n\nIn August, Google postponed a return to the office for most workers until mid-January, in addition to requiring all employees to be vaccinated once its sprawling campuses are fully reopened.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nCEO Sundar Pichai said in a blog post at the time that Google would delay its global return to offices until Jan. 10. The company has since said it will reevaluate the timing in the new year. About 90% of its offices are already opened and 40% of its employees have returned to in-person work, the company said.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nPichai said in August that the company will let countries and locations determine when to end voluntary work-from-home policies \"based on local conditions, which vary greatly across our offices.\"\n\nThe Associated Press contributed to this report"
                },
                {
                    "link": "http://www.foxbusiness.com/lifestyle/vegas-welcomes-a-new-name-harry-reid-international-airport",
                    "title": "Vegas welcomes a new name: Harry Reid International Airport",
                    "text": "Former U.S. Sen. Harry Reid of Nevada didn't attend a renaming ceremony on Tuesday making him the namesake of the busy international airport in Las Vegas, but praise was heaped upon him for his foresight and state infrastructure advocacy.\n\n\"He knew it was the gateway to boosting tourism,\" Carlos Monje, U.S. transportation undersecretary, told family members, elected leaders and administrators gathered at the facility known since December 1948 as McCarran International Airport.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\n\"By investing in infrastructure all around the Las Vegas Strip, visitors are able to more easily (access) the properties and generate millions and billions of revenue for the state,\" Monje said.\n\nReid’s son, former Clark County Commission chairman and Democratic gubernatorial candidate Rory Reid, said his father \"regretted not being able to be here\" to mark the new name, Harry Reid International Airport, but said he \"understands what an incredible honor this is for him.\" Rory Reid declined comment later when reached by The Associated Press.\n\nThe Las Vegas Review reported the 82-year-old Reid and his wife, Landra, decided not to attend because of the ongoing threat of COVID-19. Reid was diagnosed with pancreatic cancer in 2018. Landra Reid is a cancer survivor.\n\nMGM RESORTS TO SELL MIRAGE HOTEL AND CASINO FOR $1.08 BILLION TO HARD ROCK\n\nHarry Reid served in the U.S. Senate for 30 years, including eight years as Democratic majority leader from 2007 to 2015. He was the longest-serving senator in Nevada history when he retired in 2017. He also served from 1983 to 1987 in the U.S. House of Representatives.\n\nIn a statement, the native of Searchlight, Nevada, recalled his first airplane ride at the airport in 1958 and his more than three decades of trips home from Washington.\n\n\"I worked hard during my years in Congress to help build and grow the airport, and it is a source of tremendous pride to me,\" Reid said in the statement. \"It is the indispensable ingredient to Las Vegas’ success; it’s the gateway through which millions come from every corner of the world to see our city, which is like no other place on earth.\"\n\nLAS VEGAS EVENTS, VENUES BEGIN REQUIRING COVID-19 VACCINATION PROOF\n\nReid pushed for development of the Terminal 3 international arrivals annex, which opened in June 2012 and served as the site of Tuesday’s ceremony.\n\nThe airport handled 51.5 million passengers in pre-coronavirus 2019, including some 3.8 million from cities including London, Amsterdam, Mexico City, Frankfurt, Germany, and Tel Aviv, Israel. The airport ranks among the 10 busiest in the U.S.\n\nThe airport was founded as Alamo Field in 1942. It was named 73 years ago for then-U.S. senator from Nevada Pat McCarran, a Democrat whose legacy is clouded by accounts of racism, xenophobia and antisemitism during his time in public office. McCarran also owned the airport, and he lobbied for commercial aviation, federal public works and benefits for his home state. He died in 1954.\n\nClark County now owns the airport and elected local lawmakers voted unanimously in February to make the name change after years of advocacy led by Clark County Commissioner Tick Segerblom.\n\n\"Sen. McCarran, in retrospect, was not a perfect human being and did and said a lot of bad things,\" Segerblom said Tuesday. \"We are not the Nevada Senator McCarran worked at or lived in. We are a very multicultural, diverse, a multiracial, a multi-ethnic city.\"\n\nOfficials have said the expected $7.2 million cost to rename the airport is being privately raised, with some $3 million still to come to be used for changing signs and markers from curb to gate at the airport, and for vehicle decals, uniforms and administrative costs.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nThe airport’s Federal Aviation Administration designator remains LAS, but the FAA began listing the Reid name on aviation charts in June.\n\nAirport spokesman Joe Rajchel said passengers will notice changes on airport social media channels including Facebook and Twitter, although its Twitter handle remains @LASairport."
                },
                {
                    "link": "http://www.foxbusiness.com/markets/neiman-marcus-split-website-stores-bergdorf-goodman",
                    "title": "Neiman Marcus looks at plan to split into 3 separate businesses: report",
                    "text": "Neiman Marcus is exploring a plan that would divide the luxury retail chain into three different businesses.\n\nThe plan would be to separate its website from its stores and include a spinning off Bergdorf Goodman, according to the New York Post.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nThe move to separate the store's website is intended to help boost its growth by freeing it from the brick-and-mortar properties.\n\nShoppers aren't expected to experience any visible changes from the move, according to people familiar with the plans.\n\nNeiman's plan is similar to one used by rival Saks Fifth Avenue, which was able to get a $500 million investment from a venture-capital firm to fuel the growth of Saks.com.\n\nCHICAGO THIEVES TARGET NEIMAN MARCUS, GAMESTOP AMID RITTENHOUSE PROTESTS\n\nNeiman is talking with AlixPartners, according to people familiar with matter. Saks hired the consulting firm to help separate its web operations from its stores. Macy’s also has recently tapped AlixPartners as it considers spinning off its e-commerce business.\n\nNeiman hired JP Morgan earlier this year to explore a possible sale of Bergdorf Goodman. By July, Neiman denied that it was looking to sell the retailer.\n\nNeiman Marcus didn’t respond to the Post for comment. Spokespersons for AlixPartners and JPMorgan declined to comment.\n\nNEIMAN MARCUS SAYS IT NOTIFIED 4.6M CUSTOMERS ABOUT DATA BREACH\n\nNeiman Marcus’ new private-equity owners include Davidson Kempner Capital Management, Sixth Street Partners and Pacific Investment Management.\n\nNeiman posted a 6% increase in same-store sales and a 7% increase in online sales for the quarter ended in July, according to the Wall Street Journal.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nIts online sales accounted for a bigger share of total sales than before the pandemic, rising to 35% in the fiscal year ended in July from 30% in fiscal 2019."
                },
                {
                    "link": "http://www.foxnews.com/media/dr-oz-politicization-covid-vaccines-hannity",
                    "title": "Dr. Oz laments politicization of COVID, vaccines on 'Hannity'",
                    "text": "Pennsylvania Senate candidate and \"The Dr. Oz Show\" host Dr. Mehmet Oz explained what happens when politics and medicine mix Tuesday on \"Hannity.\"\n\n\"You get politics,\" he said. \"That's why I'm running for the Senate. But we cannot pervert the process of science. Too many [COVID treatment] decisions are made seemingly arbitrarily with a lot of arrogance and not a lot of understanding of what really would drive success.\"\n\n\"…[W]hat we have found is that people either root for vaccines or against vaccines,\" he continued. \"In reality, we should be rooting for vaccines and solutions like the Regeneron and antibody cocktails, as well as the pills that we're now discovering. I never understood from the very get-go why we weren't all on the same page on this. We want both [vaccine and non-vaccine solutions] to exist.\"\n\n'THE DR. OZ SHOW' TO END AMID MEHMET OZ'S SENATE RUN, DAUGHTER DAPHNE OZ TO TAKE OVER WITH 'THE GOOD DISH'\n\nOz also called the political tribalism affecting medical decisions \"harmful.\"\n\nThe talk show host said vaccines are \"great,\" but vouched for therapeutic treatments for COVID referencing a Pfizer pill that has reportedly reduced coronavirus deaths and hospitalizations by 90%. He also noted a Merck pill that he said has reduced deaths and hospitalizations by 30% to 50%. That same pill \"existed before the pandemic started,\" he added.\n\nnext Image 1 of 3\n\nprev next Image 2 of 3\n\nprev Image 3 of 3\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Any doctor knows: Get me the vaccine to prevent problems, but there are going to be cases I've got to treat. Give me the tools. Give me the pills. Give me the substance,\" he said.\n\n\"The Dr. Oz Show\" is slated to end Jan. 14."
                },
                {
                    "link": "http://www.foxnews.com/us/omicron-covid-19-variant-now-accounts-for-2-9-of-all-cases-in-the-united-states",
                    "title": "Omicron COVID-19 variant now accounts for 2.9% of all cases in the United States",
                    "text": "The omicron variant of COVID-19, which was first detected in the United States at the beginning of this month, now accounts for 2.9% of all cases in the country, according to data released by the CDC on Tuesday.\n\nThe delta variant is still dominant, accounting for 96.7% of all cases for the week that ended on Dec. 11, but omicron is gaining ground as it accounted for just 0.4% the previous week.\n\nOmicron was originally discovered in South Africa, where it is currently driving a surge in infections, and was named a variant of concern by the World Health Organization on Nov. 26.\n\nAn analysis of the new variant by Discovery Health, South Africa's largest private health insurer, found that omicron may be milder than previous variants, but more resistant to the Pfizer vaccine.\n\n\"The risk of hospital admission among adults diagnosed with COVID-19 is 29% lower for the Omicron variant infection compared to infections involving the D614G mutation in South Africa’s first wave in mid-2020, after adjusting for vaccination status,\" the company said in an analysis released Tuesday.\n\nTwo doses of the Pfizer-BioNTech vaccine offered 70% protection against hospitalization and 33% protection against infection, according to the study.\n\nPfizer said last week that a third dose, or booster, provides a \"similar level of neutralizing antibodies to Omicron as is observed after two doses against… other variants that emerged before Omicron.\"\n\nOMICRON: PFIZER SAYS COVID PILL APPEARS EFFECTIVE AGAINST VARIANT\n\nWhile omicron may cause less severe disease, World Health Organization Director-General Tedros Adhanom Ghebreyesus said at a briefing Tuesday that early data suggests it is more contagious.\n\n\"Omicron is spreading at a rate we have not seen with any previous variant,\" Ghebreyesus said.\n\nAbout two dozen states have reported cases of omicron. New York and New Jersey have seen the most rapid spread, as the new variant accounts for 13% of all cases in those states, according to the CDC.\n\nCases nationwide have risen in the past two months, as the 7-day moving average for new infections stood at 117,890 on Monday, up from a low in the fall of 64,152 on Oct. 24.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe United States crossed the grim milestone of 800,000 deaths from COVID-19 on Tuesday, according to Johns Hopkins University."
                },
                {
                    "link": "http://www.foxnews.com/media/eric-swalwell-david-frum-vaccine-mandates-hospitals-air-travel-the-five",
                    "title": "'The Five' blasts Swalwell, Frum for 'despicable' new COVID restriction ideas for unvaccinated Americans",
                    "text": "Former George W. Bush speechwriter David Frum and House Intelligence Committee Member Eric Swalwell, D-Calif., floated heavily criticized new potential ways to force Americans to submit to the coronavirus vaccine injection, one of which the panel on \"The Five\" called \"despicable.\"\n\nFrum, now a writer for \"The Atlantic\" magazine, wrote a lengthy Twitter thread lamenting the lack of full compliance with vaccine recommendations and edicts, suggesting that one way to force Americans to get the jab would be to send unvaccinated patients to the back of the line if they had to go to the emergency room.\n\n\"Seems the best option is 1) Keep encouraging vaccines and boosters; 2) Impose vaccine mandates where it can be done; 3) Otherwise return to normal as fully as we can, especially the schools; and 4) Let hospitals quietly triage emergency care to serve the unvaccinated last,\" Frum wrote over the weekend.\n\n\"If, at this point, you are still unvaccinated, you are not a victim. You are a cause of the victimization of vulnerable others,\" Frum claimed.\n\nHe further described opposition to vaccines as \"dumb ass malignity\" and lamented the fact that the \"malignant minority\" is opposed to other potential mandates like \"no jab; no fly.\"\n\nThat idea came in part from Swalwell, who along with Rep. Kai Kahele, D-Hawaii, voiced support for a policy that would essentially ban American citizens from traveling by air if they chose not to get vaccinated, according to Fox Business.\n\nSwalwell pushed the idea of an air travel vaccine requirement on Twitter Sunday, writing a \"prediction\" that the country \"can go from 60% Americans vaxxed to 80% if we require vaccines to fly.\"\n\nKahele's state has also been home to one of the nation's strictest coronavirus-era entry requirements. Before the COVID vaccine, travelers from the mainland had to test negative for the coronavirus from a Honolulu-approved test vendor and then file documentation with the state's \"Safe Travels\" website.\n\nRep. Ritchie Torres, D-N.Y., furthermore recently introduced a bill co-sponsored by Swalwell, Kahele and Hawaii's other House member, Ed Case, that would \"direct the Secretary of Homeland Security to ensure that any individual traveling on a flight that departs from or arrives to an airport inside the United States… is fully vaccinated against COVID–19.\"\n\nOn \"The Five\", host Jesse Watters called the ideas from Swalwell and Frum \"COVID hysteria back in full force.\"\n\n\"Liberals are renewing their push for a forever pandemic,\" he said.\n\n\"David Frum from ‘The Atlantic’ had a truly despicable idea suggesting treating unvaxxed patients last at hospitals.\"\n\nHost Dana Perino further wondered aloud whether Frum and the proponents of the vax-to-fly policy drafted by Torres were paying any attention to the stark message the American people sent them with the recent elections in Virginia and New Jersey where Republicans overperformed in part because of voters' frustration with both socioeconomic lockdown policies and leftist school curricula.\n\n\"And you had this other problem where you have fancy people who can go to a big party and mingle around without a mask, [while] anyone who works there had to wear a mask,\" she added.\n\n\"There’s a huge disconnect … The inequality of this shaming is really big. We’ve never figured out a way to address natural immunity. We never figured out a way to talk about the fact that we do have [other] treatments.\n\n\"For an example, David Frum's idea, like as you said, is despicable, and is also ridiculous because there are easy ways to treat it now with amazing advancements in science.\"\n\nPerino concluded by saying that making the liberal firebrand Swalwell \"the face of telling Americans that you aren't allowed to travel\" would be the best way to start a nationwide popular backlash.\n\nIn other reporting on Fox News, host Tucker Carlson has pointed out Swalwell's penchant for coronavirus-era travel, including to Qatar, where he was famously pictured shirtless and looking exuberant atop a camel while its handler stood in the photo's foreground.\n\n\"The Five\" host Greg Gutfeld remarked that the controversial emergency room policy proposal is proof that Frum is \"a broken man\" and that the Bush-era politico has been \"suffering from irrelevance\" as of late.\n\n\"He is pretty much just lashing out,\" he said. \"Everybody knows people who haven't been vaccinated for legitimate reasons and there are therapeutics that can help and so on. So he’s doing this because he is a sad, sad, loser.\"\n\nFox Business' Houston Keene contributed to this report."
                },
                {
                    "link": "http://www.foxnews.com/media/andrew-cuomo-statement-book",
                    "title": "Cuomo fires back at order forcing him to return $5.1M from COVID book: 'Political hypocrisy... at its worst'",
                    "text": "Disgraced ex-New York Gov. Andrew Cuomo remained defiant amid the order he is facing to return the money he received from the book he wrote touting his leadership during the coronavirus pandemic.\n\nNew York state's Joint Commission on Public Ethics (JCOPE) voted 12-1 demanding the Democrat to give back the $5.1 million from the release of his memoir \"American Crisis: Leadership Lessons from the COVID-19 Pandemic,\" which was widely panned as an early victory lap of his response to the virus it was still killing thousands of Americans.\n\nANDREW CUOMO ORDERED TO RETURN MILLIONS FROM PANDEMIC BOOK DEAL FOLLOWING ETHICS PANEL VOTE\n\nCuomo spokesman Rich Azzopardi issued a fiery statement defending his former boss.\n\n\"This is political hypocrisy and duplicity at its worst,\" Azzopardi wrote. \"Governor Cuomo received a JCOPE opinion and advice of counsel stating that government resources could not be used -- and they weren't -- and any staffer who assisted in this project did so on their own time, which was reflected on their timesheets.\"\n\n\"If Speaker Heastie, Majority Leader Stewart-Cousins, and Governor Hochul's JCOPE appointees have created a new standard whereby government staffers cannot volunteer their own time for non-governmental purposes, they should all be equally prosecuted under the same standard and be forced to repay the state for volunteer work on their re-election campaigns,\" Azzopardi added.\n\nCuomo will have to return $5.1 million earned to the state by next month after the watchdog ethics panel concluded that the governor had violated pledges not to use state resources or government staff to prepare the project. The resolution was drafted by commissioner David McNamara. Cuomo, McNamara said, now \"lacked the legal authority to engage in outside activity and receive compensation in regard to the book,\" the New York Post reported.\n\nJANICE DEAN SPEAKS OUT AMID REPORTS TEAM CUOMO SECRETLY PLOTTED TO DISCREDIT HER: 'THIS WON'T STOP MY MISSION'\n\nNew York Attorney General Letitia James is also investigating Cuomo's book deal, along with the FBI, and the Brooklyn US Attorney’s Office.\n\nThe Democrat enjoyed much glowing media coverage at the onset of the pandemic, with even President Biden calling his work the \"gold standard\" of leadership. But in the following months, Cuomo and his administration were condemned for the thousands of COVID-related deaths in New York nursing homes. The governor then faced several allegations of sexual harassment by former staffers. He resigned in disgrace last August following a report from the state attorney general that concluded he had sexually harassed at least 11 women from 2013 to 2020.\n\nCuomo's little brother, recently-ousted CNN anchor Chris Cuomo, was also wrapped up in the governor's scandals. Documents revealed he had helped his older brother as an unofficial adviser and even used his media influence to try and dig up dirt on the governor's accusers, in addition to spying on investigative journalists' reports on the scandal. CNN fired Chris Cuomo after these revelations.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nFollowing Chris Cuomo's firing, CNN discovered he, too, had fielded a second sexual harassment allegation following an accusation from her former ABC colleague Shelley Ross.\n\nChris Cuomo, like his older brother, has also had recent troubles with his book. In the wake of his CNN controversies, HarperCollins canceled his forthcoming title, \"Deep Denial.\"\n\nFox News' Cortney O'Brien contributed to this report."
                },
                {
                    "link": "http://www.foxnews.com/opinion/covid-crime-democrats-risk-david-marcus",
                    "title": "On COVID and crime Democrats assess risk very differently",
                    "text": "NEW You can now listen to Fox News articles!\n\nFor well nigh two years now Democrats across America have urged strict restrictions and obedience from the nation in all matters regarding COVID. Turn your life upside down, send your kid to school in masks to eat lunch in chilly weather on the ground of the yard, and by all means get your two, or three, or however many vaccination jabs. If it can save just one life, and all that. But when it comes to crime, these same lefties have more risk tolerance than a drunk 22-year-old at a Vegas craps table. What gives?\n\nThink about this statement the progressive Milwaukee County District Attorney John Chisholm made when he was elected in 2007 regarding his lax approach to crime, \"Is there going to be an individual I divert, or I put into treatment program, who’s going to go out and kill somebody? You bet. Guaranteed. It’s guaranteed to happen. It does not invalidate the overall approach.\"\n\nAMERICANS WORRY ABOUT SOARING CRIME RATE -- DEMOCRATS RESPOND BY STANDING UP FOR CRIMINALS\n\nWe saw the fruits of this wrongheaded approach last month when Darrell Brooks Jr., exited the turnstile of Milwaukee County’s criminal justice system, despite a rap sheet longer than a CVS receipt, to allegedly murder 6 people at a Christmas parade.\n\nIn New York, a grad student lost his life to a knife attack to another career criminal roaming Manhattan who should have been behind bars.\n\nIt's happening all over the country. And it is making the law-abiding people of America second class citizens in their own cities. While Democrats moan and wail about the danger of the unvaccinated, even though we know that the vaccinated are perfectly capable of spreading COVID, our criminal class is coddled at every turn.\n\nCHICAGO FATHER VIOLENTLY ATTACKED, KILLED WHILE HANGING CHRISTMAS LIGHTS OUTSIDE HOME, FAMILY SAYS\n\nDemocrats and their media allies might argue that COVID and the hundreds of thousands of deaths it has wrought is on a different scale than our crime crisis. But that is little consolation to the families of those who died preventable deaths owing to woke prosecutors. And besides that, crime in our cities is a paralyzing force that rains negative outcomes down on millions of Americans.\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nSo what explains this disparity in risk tolerance? Put simply, COVID has no claim to oppressed status, except maybe in regard to what we are allowed to call it. Sacrificing Americans to COVID serves no social justice purpose, but sacrificing Americans to crime does.\n\nEven regarding COVID we see this dynamic at work. Everyone, including American citizens who enter the country legally must run a gauntlet of COVID restrictions, but those who break into the country through our spaghetti strainer of a Southern border may traipse in free of any protocols at all. The migrants, you see, are oppressed, and exemptions must be made for them.\n\nDemocrats lack the serenity to accept what they cannot change about COVID, they lack the courage to change what they can about crime and are severely lacking in the wisdom to see the difference.\n\nThe irony here is that despite our best efforts for 2 years we have no idea how to effectively stop the spread of COVID, the Florida model, the New York Model, the Sweden model, the Australia model, all have pros and cons. But in regard to crime, we know exactly how to fight it. In cities across America, led by New York, the police tactics of the 1990s chopped crime at the knees, and yet we have abandoned those police and prosecutorial practices.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nDemocrats lack the serenity to accept what they cannot change about COVID, they lack the courage to change what they can about crime, and are severely lacking in the wisdom to see the difference.\n\nThis is not a mystery that progressive prosecutors have to solve, we know how to fight crime in our major cities, it's time we get back to doing it.\n\nCLICK HERE TO READ MORE FROM DAVID MARCUS"
                },
                {
                    "link": "http://www.foxnews.com/category/media/fox-news-flash",
                    "title": "Fox News Flash",
                    "text": "This material may not be published, broadcast, rewritten, or redistributed. ©2021 FOX News Network, LLC. All rights reserved. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset. Powered and implemented by FactSet Digital Solutions. Legal Statement. Mutual Fund and ETF data provided by Refinitiv Lipper."
                },
                {
                    "link": "http://www.foxnews.com/media/laura-ingraham-biden-democrats-crackdown-freedom",
                    "title": "Ingraham: Biden and Democrats are planning their next crackdown on freedom",
                    "text": "Laura Ingraham said President Biden and the Democrats are planning their next move to infringe on Americans' freedoms on Tuesday's \"Ingraham Angle.\"\n\nThe Fox News host argued the Democrats' hysteria over climate change is a ruse to expand the government's power over daily life. \"We won’t be locked down again – not by a COVID emergency and not by a climate emergency,\" she said.\n\n\"'Soon COVID will be behind us,' you’re thinking. … You can’t wait for the old normal to be back. We’re all looking forward to the end of shaming and recriminations.\"\n\nDESANTIS VOWS NO LOCKDOWNS OR MANDATES IN FLORIDA AS OMICRON VARIANT HITS THE STATE\n\nNot so fast, Ingraham said.\n\nShe cautioned that the left is planning an end to private vehicular travel. \"The trendy climate change thinking in Europe will come here, wrapped in a public health emergency. It’s just another attempt to foist new rules on you without your consent.\"\n\nShe raised remarks by Trudy Harrison, a member of U.K. Parliament, who recently said that private travel is an outdated system.\n\nBRITISH PM JOHNSON FACING CRISIS AS NATION REACTS TO GOVERNMENT PARTIES HELD DURING COVID LOCKDOWNS\n\n\"The CCP (Chinese Communist Party) would be proud\" of that agenda, Ingraham said. \"[The left's] ultimate goal: limiting your ability to travel with convenience – when you want, where you want. This would mean the end to private car ownership as we’ve known it and loved it for decades. It’s the image of the middle-class American dream … that liberal elites have hated for a long time.\"\n\nShe said the fervor for government dependency existed before COVID-19, but Biden and his party intend to exploit it. Biden revealed this himself, she said, that he \"wants to get as many cars off the road as possible\" in order to fight climate change.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nBiden said that taking \"millions of automobiles off the road\" would clean up the air and save oil. \"This is not hyperbole. This is a fact. These are facts,\" he added.\n\n\"Politicians who are supporting this climate agenda must be beaten at the polls and beaten badly,\" Ingraham concluded."
                },
                {
                    "link": "http://www.foxnews.com/media/tom-cotton-biden-admin-inflation-meat-conglomerates-ingraham-angle",
                    "title": "Tom Cotton mocks Biden admin claim that inflation is fault of ‘meat conglomerates’",
                    "text": "The Biden administration seems to be full of excuses to explain inflated prices for items that Americans purchase every day, U.S. Sen. Tom Cotton, R-Ark., says.\n\nCotton’s remarks came Tuesday night during an appearance on Fox News’ \"The Ingraham Angle,\" after host Laura Ingraham asked him to comment on White House press secretary Jen Psaki’s assertion that \"meat conglomerates\" deserved a share of blame for rising prices.\n\nNYT COLUMNIST ROASTED AFTER QUESTIONING HOW MUCH INFLATION AFFECTS LOW-INCOME AMERICAN FAMILIES\n\nU.S. SEN. TOM COTTON, R-ARK.: They’re blaming everyone for this record inflation when it just goes back to Democratic policies.\n\nLook, we’ve had this pandemic for two years.\n\nWe didn’t have record inflation in 2020, we only had it in 2021 when the Democrats are in charge, spending trillions of dollars to make sure that there’s more money chasing fewer goods because of all the lockdowns and the capacity restrictions you still have in Democratic-governed states.\n\nFirst it was oil and gas companies, next it’s meat conglomerates. Maybe next week it’s going to the Elf on the Shelf when there aren’t enough Christmas presents under the tree.\n\nWATCH THE FULL VIDEO BELOW:"
                },
                {
                    "link": "http://www.foxnews.com/media/laura-ingraham-liz-cheney-media-meadows-texts",
                    "title": "Laura Ingraham blasts Liz Cheney, media over Meadows texts; replays her riot condemnations",
                    "text": "After Wyoming GOP Rep. Elizabeth Cheney read texts from three Fox News hosts to then-White House Chief of Staff Mark Meadows into the Congressional Record during the latest House January 6 Committee hearing, Laura Ingraham pushed back on claims and insinuations that she was being irresponsible, hypocritical or not publicly professing her true opinion of the rioting that was going on at the time.\n\nEarlier Tuesday, Cheney -- previously appointed the vice-chair of the committee by its leader, Mississippi Democratic Rep. Bennie Thompson after most of the party-leadership-assigned Republicans were blocked from participating earlier this year – read aloud text messages between Ingraham, Sean Hannity, and Brian Kilmeade to Meadows individually on the day of the riot.\n\n\"This sent the left-wing media hacks into ‘Spin & Defame’ mode. Of course the regime media was trying to twist this message to try and tar me as a liar and hypocrite who privately sounded the alarm on January 6 but privately downplayed it,\" she said.\n\nCheney, a vocal opponent of former President Trump, said in Congress Tuesday that Ingraham and others \"knew [Donald Trump] needed to act immediately\".\n\n\"Mark, the president needs to tell people in the Capitol this is hurting all of us – he is destroying his legacy,\" she read from Ingraham's messages. Meadows has since been pursued on contempt charges from the committee after halting cooperation most recently.\n\nIngraham said late Tuesday that the insinuated idea that she publicly egged on the rioters, ostensibly as a supporter of the purported pro-Trump cause, was a \"big lie\" being disseminated by Cheney and newspaper reporters like Aaron Blake of the Washington Post.\n\nShe pointed to a lengthy tweet from Blake from earlier in the day, saying he \"grossly mischaracterized what I said in an attempt to smear me.\"\n\n\"[Blake] was not alone. CNN’s chief propagandist Brian Stelter joined on the smearfest writing that ‘they all knew the truth right away by the night of January 6, Ingraham was spouting conspiracy theories… based on a lie she pushed over and over again’,\" she said, reading from Stelter's comments at one point.\n\nIngraham said she never supported election \"conspiracy theories\" about a stolen 2020 election as accused by Stelter.\n\nShe added that claims Stelter made about her claiming the Marxist group Antifa had infiltrated the protesters were indeed clarified by Ingraham upon further reportage as \"not substantiated.\"\n\n\"Another inconvenient fact those little men left out: Had they bothered to actually watch what I said the night of January 6 or read any of my public tweets from the afternoon of January 6, they couldn't have denied the truth.\n\nShe then replayed parts of her \"Angle\" from that evening's show:\n\n\"The Capitol was under siege by people who can only be described as antithetical to the MAGA movement. Now they were likely not all Trump supporters, and there were some reports that Antifa sympathizers may have been sprinkled throughout the crowd.\n\n\"The point remains, if you were a Trump supporter trying to display your support for the president, today's antics at the Capitol did just the opposite.\n\n\"Those who breached the Capitol Hill security today, whoever they were, they were criminals. I’ve been to literally dozens of Trump events, and the criminal actions we saw today do not represent this movement.\"\n\n\"Does that sound like I was downplaying it to you,\" she asked. Ingraham then read her public tweets from January 6 as well:\n\n\"Security breach at the Capitol is disgraceful and the president needs to tell everyone to leave the building now. 2:44 P.M. Anyone thinks this is gonna the MAGA movement is delusional. It hurts the movement, the Trump legacy and of course the country.\"\n\n\"The president should order [National Guard] to secure the Capitol immediately.\"\n\n\"When there’s any big crowd there will invariably be bad actors, but blame will be laid at the feet of the White House if Capitol not cleared quickly.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Now this is all public record, kids,\" Ingraham concluded. \"The real big lie is the expansive narrative of January 6th that these clowns have made the center of the political existence. So it’s time to face facts, shut down the false narrative and treat Cheney and her clique the way the American people treat them: by tuning them out.\""
                },
                {
                    "link": "http://www.foxnews.com/media/will-cain-black-lives-matter-black-xmas",
                    "title": "Will Cain: BLM will call you a racist for shopping at stores they have no problem taking money from",
                    "text": "\"Fox News Primetime\" host Will Cain called out the Black Lives Matter \"Black Xmas\" campaign Monday for boycotting stores they have accepted donations from in the past.\n\nWILL CAIN: America can't escape the framework of skin color because instead of spreading cheer and joy this holiday season, Black Lives Matter is asking its followers to participate in segregation. They called their mission \"Black Xmas.\" And its goal is pretty simple, fight \"white supremacist capitalism.\" Now you're probably wondering what is white supremacist capitalism? And that also is simple: it's any business owned by a White person.\n\nSo if you want to celebrate \"Black Xmas\" this year, all you have to do is stay away from those white supremacist stores and spend money exclusively at Black-owned businesses. BLM will call you a racist for shopping at businesses not owned by Black people, they have no problem accepting millions of dollars in donations from what they consider white supremacists.\n\nAfter the death of George Floyd, companies like Apple, Amazon, Microsoft, Google, Coca-Cola, they lined up to give Black Lives Matter millions, and BLM happily accepted. In fact, they raised more than $90 million in 2020 …. We know it didn't go to help any Black people, unless you count the co-founder of BLM, who bought four mansions after her nonprofit raked in all that cash.\n\nCLICK HERE TO GET THE FOX NEWS APP"
                },
                {
                    "link": "http://www.foxnews.com/politics/house-votes-to-hold-mark-meadows-in-contempt-of-congress",
                    "title": "House votes to hold Mark Meadows in contempt of Congress",
                    "text": "NEW You can now listen to Fox News articles!\n\nThe House of Representatives voted Tuesday in favor of a resolution to hold former White House chief of staff Mark Meadows in contempt of Congress.\n\nJAN. 6 COMMITTEE VOWS CONTEMPT PROCEEDINGS IF MARK MEADOWS FAILS TO APPEAR\n\nThe vote comes a day after the House Select Committee investigating the Jan. 6 attack on the U.S. Capitol voted 9-0 to recommend Meadows for prosecution after he refused to testify before the panel. The resolution was adopted in a 222-208 vote. Reps. Adam Kinzinger and Liz Cheney voted with Democrats.\n\nThe seven Democrats on the panel were joined by its two Republicans Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois.\n\n‘THIS IS ABOUT DONALD TRUMP’: MARK MEADOWS RESPONDS TO JANUARY 6th CMTE VOTE RECOMMENDING CRIMINAL CHARGES\n\nThe House vote sends the matter to the U.S. attorney's office in Washington, where it will now be up to prosecutors in that office to decide whether to present the case to a grand jury for possible criminal charges.\n\nThe move was seen by some as a game of politics.\n\n\"Americans can barely afford groceries. Gas prices are up. Crime is skyrocketing. And what do Democrats do? Punish their political foe in the dead of night, with no one watching. Pathetic,\" Rep. Jim Jordan, R-Ohio, tweeted.\n\nThe vote occurred after the Jan. 6 Committee Chairman Bennie Thompson, D-Miss., in a 51-page report released late Sunday, blamed Meadows for being in contact with at least some of the private individuals \"who planned and organized a January 6 rally, one of whom reportedly may have expressed safety concerns to Mr. Meadows about January 6 events.\"\n\n\"Mr. Meadows used his personal cell phone to discuss the rally in the days leading up to January 6,\" he wrote.\n\nMeadows responded late Monday to the House committee's vote, telling Fox News host Sean Hannity that the recommendation from the committee is \"disappointing, but not surprising.\"\n\nMEADOWS ATTORNEY SAYS CONTEMPT CHARGE WOULD BE ‘MANIFESTLY UNJUST’\n\n\"Let’s be clear about this, this is not about me, holding me in contempt,\" said Meadows. \"It’s not even about making the Capitol safer. We’ve seen that by the selective leaks that are going on right now. This is about Donald Trump and about actually going after him once again.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nMeadows, a former North Carolina congressman who also served as the chairman of the House Freedom Caucus, was previously cooperating with the committee's investigation into the events surrounding the Jan. 6 attack on the Capitol. He later stopped working with the investigators and is now suing them.\n\nFox News' Edmund DeMarche and the Associated Press contributed to this report"
                },
                {
                    "link": "http://www.foxnews.com/politics/house-passes-uyghur-forced-labor-prevention-act",
                    "title": "Uyghur Forced Labor Prevention Act passed unanimously by the House",
                    "text": "NEW You can now listen to Fox News articles!\n\nThe House of Representatives unanimously passed a new version of a bill banning imports made in Xinjiang region of China, where the Uighur minority community has reportedly been subject to human rights abuses.\n\nThe Uyghur Forced Labor Prevention Act, also known as H.R. 6256, passed by voice vote on Tuesday evening after Republicans and Democrats agreed on a revised version of legislation that stripped out differences between the Senate and the House, according to Reuters .\n\nNEW YORK TIMES SAYS RUBIO'S QUESTIONS ON 'WITHHOLDING' INFORMATION ABOUT UYGHUR GENOCIDE 'RECKLESS AND WRONG'\n\nThe bill will now head to the Senate, and President Biden has already expressed his support.\n\n\"The President welcomes the agreement by Congress on the bipartisan Uyghur Forced Labor Prevention Act,\" the White House said in a statement Tuesday. \"We agree with Congress that action can and must be taken to hold the People’s Republic of China accountable for genocide and human rights abuses and to address forced labor in Xinjiang.\"\n\nThe statement from the White House continued: \"The President also rallied the G7 to commit to ensure all global supply chains are free from the use of forced labor—including from Xinjiang. The Administration will work closely with Congress to implement this bill to ensure global supply chains are free of forced labor.\"\n\nCURRY & ABBAS: CHINA'S WAR ON UYGHUR MUSLIMS – HERE'S WHY THIS PERSECUTION SHOULD MATTER TO CHRISTIANS\n\nThe State Department earlier this year it was \"deeply disturbed\" by allegations that women in China's \"re-education\" camps for Uyghurs were systematically raped and sexually abused, according to a report.\n\n\"These atrocities shock the conscience and must be met with serious consequences,\" a State Department spokeswoman told Reuters.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nAccording to reports last year, up to three million Uighur Muslims in China's western Xinjiang province have been plucked from their homes since 2017 by authorities and disappeared into prison camps, which the Chinese government terms \"re-education\" facilities.\n\nFox News' David Aaro contributed to this report"
                },
                {
                    "link": "http://www.foxnews.com/politics/nyc-mayor-elect-adams-chooses-first-woman-to-be-police-commissioner",
                    "title": "NYC Mayor-elect Eric Adams selects Keechant Sewel as the first woman to be police commissioner",
                    "text": "NEW You can now listen to Fox News articles!\n\nNew York City Mayor-elect Eric Adams selected Nassau County Chief of Detectives Keechant Sewel to serve as commissioner of the New York Police Department, making her the first woman to serve in the role.\n\n\"Keechant Sewell is a proven crime fighter with the experience and emotional intelligence to deliver both the safety New Yorkers need and the justice they deserve,\" Adams said in a statement to the New York Post Tuesday. \"Chief Sewell will wake up every day laser-focused on keeping New Yorkers safe and improving our city, and I am thrilled to have her at the helm of the NYPD.\"\n\nNYC ‘CAREER CRIMINAL’ CHARGED IN BRAZEN SHOOTING THAT WOUNDED TWO OFFICERS: ‘THERE IS NO FEAR ON THE STREETS’\n\nAdams, a former NYPD captain, said the 49-year-old Sewell was a \"gut-choice\" to lead the nation's largest police force of 52,000 members, despite her previously only having led 351 uniformed officers in her role as Nassau County Chief of Detectives for the past 15 months.\n\n\"He’s going on his instinct as an officer for 22 years and being one of the chief critics of the NYPD,\" a source close to Adams told the New York Post.\n\nAdams has long said he would tap a woman to fill the role of commissioner, launching a nationwide search and interviewing dozens of candidates before landing on Sewell. The new commissioner will take over a city that has seen a rise in crime in recent years, a problem she pledged to tackle.\n\n\"I want to let them know that we are absolutely focused on violent crime. Violent crime is the No. 1 priority,\" Sewell said.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSewell indicated she was also aware of the historic nature of her nomination, saying she was \"humbled\" by the chance to become the city's first female police commissioner.\n\n\"I’m here to meet the moment,\" Sewell said. \"I’m very humbled to even be considered for this, and it’s an extraordinary opportunity. And I take it very seriously, the historic nature of this.\""
                },
                {
                    "link": "http://www.foxnews.com/politics/biden-to-dnc-holiday-party-were-going-to-win-in-2022",
                    "title": "Biden to DNC holiday party: 'We're going to win in 2022'",
                    "text": "NEW You can now listen to Fox News articles!\n\nPresident Joe Biden spoke at the Democratic National Committee holiday party on Tuesday night and expressed optimism that his party will prevail in next year’s midterm elections.\n\n\"We have to keep making the case,\" Biden told a crowd of about 400 in Washington, D.C. \"Let me say this again: From the president, we’re going to win in 2022.\"\n\nCNN FLOATS POSSIBLE REPLACEMENTS FOR BIDEN IN 2024\n\n\"I want to tell my Republican friends: Get ready, pal. You’re in for a problem,\" Biden said, explaining that Republicans are \"against everything\" and challenging the crowd to name something the GOP is \"for.\"\n\nMany political analysts expect Republicans to roll up victories in House elections next November.\n\nDuring his speech, Biden touted his recently passed infrastructure spending package as the most significant piece of infrastructure spending since the Eisenhower administration. The president also celebrated that over 200 million Americans are vaccinated.\n\nHouse Speaker Nancy Pelosi also spoke at the event and explained how Biden is the \"perfect\" president to handle the challenging times facing the country.\n\nSEN. BLUMENTHAL SPEAKS AT COMMUNIST AWARD SHOW, TOUTS 'BUILD BACK BETTER'\n\n\"Our country could not be better served than with this most experienced and capable hands than yours, President Biden,\" the San Francisco Democrat told the crowd. \"He’s just perfect. The timing couldn’t be better.\"\n\nPresident Biden 's standing with Americans remains in negative territory heading into the final few weeks of 2021.\n\nThe president stands at 43% approval and 51% disapproval in a NPR/Marist national survey released last Thursday. A day earlier, a national poll from Monmouth University indicated a 40% approval rating and a 50% disapproval rating. Both surveys were conducted in recent days.\n\nAn average of all the most recent national polls compiled by RealClearPolitics puts Biden’s approval rating at 42% and his disapproval rating at 52%. The average included a large survey from The Wall Street Journal conducted last month that had the president well underwater, at 41%-57%.\n\nBiden joked Friday night, during an appearance on NBC's \"Tonight Show,\" that he has stopped following his approval ratings .\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Well, not anymore,\" Biden quipped during the remote interview from the White House after host Jimmy Fallon asked him how much he pays attention to poll numbers.\n\n\"I’m joking,\" the president stressed as Fallon laughed hysterically and the audience clapped. \"I was paying attention when they were in the mid-60s, but now that they’re in the 40s, I don't pay attention.\"\n\nFox News’ Paul Steinhauser and Brie Stimson contributed to this report"
                },
                {
                    "link": "http://www.foxnews.com/us/los-angeles-police-chase-possible-kidnapping-suspect",
                    "title": "Los Angeles possible kidnapping suspect arrested after leading police on chase in city: report",
                    "text": "LOS ANGELES--A suspect wanted in a kidnapping case was taken into custody Tuesday night after leading police on a car chase across the Los Angeles area, according to a report.\n\nPolice cars could be seen following the white SUV as it made its way through residential neighborhoods in the city.\n\nAuthorities had feared that up to two children were potentially inside the vehicle during the chase, according to FOX 11 Los Angeles.\n\nLOS ANGELES CELL PHONE STORES RANSACKED BY SMASH-AND-GRAB THIEVES, LAPD TO INCREASE PATROLS AND ADD DETECTIVES\n\nVideo taken by SkyFOX captured at least one child being escorted away from the scene, the station reported.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nA police spokesman said there are not many details available about the suspect or the other occupants in the vehicle."
                },
                {
                    "link": "http://www.foxnews.com/us/prince-andrew-asks-judge-to-toss-lawsuit-says-alleged-victim-was",
                    "title": "Prince Andrew asks judge to toss sex abuse lawsuit, says accuser was above New York age of consent",
                    "text": "Prince Andrew asked a judge this week to toss out a civil lawsuit that was filed against him in August by Virginia Roberts Giuffre, who claims that the Queen's son sexually abused her when she was 17 years old at Jeffrey Epstein's New York home, as well as in London and the U.S. Virgin Islands.\n\nGiuffre filed the suit under the New York Child Victims’ Act, which was passed in 2019 and temporarily allowed victims to sue their alleged abusers if they were younger than 18 when the abuse took place.\n\nPrince Andrew's attorneys argued in a motion filed Monday that the Child Victims’ Act is unconstitutional and Giuffre's claims are invalid because she was 17 years old when the alleged abuse took place.\n\n\"The [Child Victims’ Act] revives claims for those who allegedly suffered harm as a result of certain sexual offenses they claim were committed against them when they were under the age of eighteen, even though the age of consent in New York is seventeen,\" the attorneys wrote.\n\nThe attorneys also argued that accusers must establish lack of consent by \"implied threat,\" but there are no third parties that can testify to the alleged abuse.\n\n\"Here, the only witnesses to the purported implied threats under which Giuffre allegedly engaged in unconsented sex acts with Prince Andrew are Epstein (deceased), Maxwell (incarcerated), Prince Andrew (the accused) and Giuffre herself,\" Prince Andrew's attorneys wrote.\n\nGHISLAINE MAXWELL ALLEGEDLY TOLD TEEN SHE ‘HAD A GREAT BODY FOR MR. EPSTEIN AND HIS FRIENDS’\n\nJeffrey Epstein killed himself in a Manhattan jail cell in August 2019, a month after he was criminally charged with sex trafficking.\n\nGhislaine Maxwell, Epstein's former girlfriend and a longtime friend of Prince Andrew, is currently on trial in New York. Multiple women have testified that Maxwell groomed them to be sexually abused by Epstein when they were girls.\n\nGiuffre filed the civil lawsuit against Prince Andrew in August, saying at the time she is holding him \"accountable for what he did to me.\"\n\n\"The powerful and rich are not exempt from being held responsible for their actions. I hope that other victims will see that it is possible not to live in silence and fear, but to reclaim one’s life by speaking out and demanding justice,\" Giuffre said in a statement at the time.\n\nGHISLAINE MAXWELL TRIAL: DEFENSE COULD CALL MORE WITNESSES THAN PROSECUTION\n\nThe lawsuit, which seeks unspecified compensatory and punitive damages, says that Giuffre \"feared death or physical injury to herself or another and other repercussions for disobeying\" Epstein, Maxwell, and Prince Andrew because of their \"powerful connections, wealth, and authority.\"\n\nIt also alleges that Prince Andrew knew Giuffre was 17 years old at the time, but still abused her \"for the purpose of gratifying his sexual desires.\"\n\nSeparately, a judge ruled Tuesday that a secret 2008 settlement reached between Giuffre and Epstein should be made public. Prince Andrew's attorneys have argued that deal shields Prince Andrew from Giuffre's lawsuit.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nPrince Andrew has maintained that the allegations against him are false, telling BBC in a widely-mocked 2019 interview that he has \"no recollection\" of ever meeting Giuffre.\n\n\"I can absolutely categorically tell you it never happened,\" Andrew said at the time.\n\nThe Associated Press contributed to this report."
                },
                {
                    "link": "http://www.foxnews.com/us/texas-man-charged-killing-mother-daughter-during-alleged-human-smuggling-attempt-near-border-identified",
                    "title": "Texas man charged with killing mother, daughter during alleged human smuggling attempt near border ID’d",
                    "text": "Mission, Texas, police have identified the suspect who crashed into a vehicle Saturday while fleeing authorities during an alleged human smuggling attempt.\n\nEsteban Cantu Jr., 18, an American citizen, is charged with murder and aggravated assault in the deaths of Mission resident Carmen Huerta Sosa, 59, and her daughter, 22-year-old Viridiana Charon Lloyd. He was charged Saturday with felony evading and human smuggling.\n\nCantu ran a stop sign Saturday while fleeing from Border Patrol agents and Texas Department of Public Safety troopers and T-boned Sosa’s car, police said.\n\nCBP OFFICERS IN TEXAS SEIZE MORE THAN $3M WORTH OF METHAMPHETAMINE AT US-MEXICO BORDER\n\nPolice said six illegal immigrants were in his vehicle. One of the immigrants flew through the windshield upon impact but survived. Cantu and the immigrants were transported to an area hospital, police said.\n\nnext Image 1 of 3\n\nprev next Image 2 of 3\n\nprev Image 3 of 3\n\nCantu was arrested, formerly charged and arraigned before Mission Municipal Court Judge Jonathan Wehrmeister after he was released from the hospital, police said. He was remanded to the Hidalgo County jail in lieu of the bonds set by Judge Wehrmeister.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nTexas Lt. Gov. Dan Patrick weighed in on Saturday’s incident, saying the blood of Sosa and Lloyd are on the hands of President Biden and Vice President Kamala Harris for their refusal to secure the border.\n\nFox News’ Peter Aitken contributed to this report."
                }
            ]
        }
    }
}