[
    {
        "Text": "NEW You can now listen to Fox News articles!\n\nPresident Joe Biden spoke at the Democratic National Committee holiday party on Tuesday night and expressed optimism that his party will prevail in next year’s midterm elections.\n\n\"We have to keep making the case,\" Biden told a crowd of about 400 in Washington, D.C. \"Let me say this again: From the president, we’re going to win in 2022.\"\n\nCNN FLOATS POSSIBLE REPLACEMENTS FOR BIDEN IN 2024\n\n\"I want to tell my Republican friends: Get ready, pal. You’re in for a problem,\" Biden said, explaining that Republicans are \"against everything\" and challenging the crowd to name something the GOP is \"for.\"\n\nMany political analysts expect Republicans to roll up victories in House elections next November.\n\nDuring his speech, Biden touted his recently passed infrastructure spending package as the most significant piece of infrastructure spending since the Eisenhower administration. The president also celebrated that over 200 million Americans are vaccinated.\n\nHouse Speaker Nancy Pelosi also spoke at the event and explained how Biden is the \"perfect\" president to handle the challenging times facing the country.\n\nSEN. BLUMENTHAL SPEAKS AT COMMUNIST AWARD SHOW, TOUTS 'BUILD BACK BETTER'\n\n\"Our country could not be better served than with this most experienced and capable hands than yours, President Biden,\" the San Francisco Democrat told the crowd. \"He’s just perfect. The timing couldn’t be better.\"\n\nPresident Biden 's standing with Americans remains in negative territory heading into the final few weeks of 2021.\n\nThe president stands at 43% approval and 51% disapproval in a NPR/Marist national survey released last Thursday. A day earlier, a national poll from Monmouth University indicated a 40% approval rating and a 50% disapproval rating. Both surveys were conducted in recent days.\n\nAn average of all the most recent national polls compiled by RealClearPolitics puts Biden’s approval rating at 42% and his disapproval rating at 52%. The average included a large survey from The Wall Street Journal conducted last month that had the president well underwater, at 41%-57%.\n\nBiden joked Friday night, during an appearance on NBC's \"Tonight Show,\" that he has stopped following his approval ratings .\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Well, not anymore,\" Biden quipped during the remote interview from the White House after host Jimmy Fallon asked him how much he pays attention to poll numbers.\n\n\"I’m joking,\" the president stressed as Fallon laughed hysterically and the audience clapped. \"I was paying attention when they were in the mid-60s, but now that they’re in the 40s, I don't pay attention.\"\n\nFox News’ Paul Steinhauser and Brie Stimson contributed to this report",
        "Score": 1.4846787924922384,
        "freq_terms_in_query": {
            "president": 9
        },
        "doc_idx": "16"
    },
    {
        "Text": "NEW You can now listen to Fox News articles!\n\nPresident Joe Biden spoke at the Democratic National Committee holiday party on Tuesday night and expressed optimism that his party will prevail in next year’s midterm elections.\n\n\"We have to keep making the case,\" Biden told a crowd of about 400 in Washington, D.C. \"Let me say this again: From the president, we’re going to win in 2022.\"\n\nCNN FLOATS POSSIBLE REPLACEMENTS FOR BIDEN IN 2024\n\n\"I want to tell my Republican friends: Get ready, pal. You’re in for a problem,\" Biden said, explaining that Republicans are \"against everything\" and challenging the crowd to name something the GOP is \"for.\"\n\nMany political analysts expect Republicans to roll up victories in House elections next November.\n\nDuring his speech, Biden touted his recently passed infrastructure spending package as the most significant piece of infrastructure spending since the Eisenhower administration. The president also celebrated that over 200 million Americans are vaccinated.\n\nHouse Speaker Nancy Pelosi also spoke at the event and explained how Biden is the \"perfect\" president to handle the challenging times facing the country.\n\nSEN. BLUMENTHAL SPEAKS AT COMMUNIST AWARD SHOW, TOUTS 'BUILD BACK BETTER'\n\n\"Our country could not be better served than with this most experienced and capable hands than yours, President Biden,\" the San Francisco Democrat told the crowd. \"He’s just perfect. The timing couldn’t be better.\"\n\nPresident Biden 's standing with Americans remains in negative territory heading into the final few weeks of 2021.\n\nThe president stands at 43% approval and 51% disapproval in a NPR/Marist national survey released last Thursday. A day earlier, a national poll from Monmouth University indicated a 40% approval rating and a 50% disapproval rating. Both surveys were conducted in recent days.\n\nAn average of all the most recent national polls compiled by RealClearPolitics puts Biden’s approval rating at 42% and his disapproval rating at 52%. The average included a large survey from The Wall Street Journal conducted last month that had the president well underwater, at 41%-57%.\n\nBiden joked Friday night, during an appearance on NBC's \"Tonight Show,\" that he has stopped following his approval ratings .\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Well, not anymore,\" Biden quipped during the remote interview from the White House after host Jimmy Fallon asked him how much he pays attention to poll numbers.\n\n\"I’m joking,\" the president stressed as Fallon laughed hysterically and the audience clapped. \"I was paying attention when they were in the mid-60s, but now that they’re in the 40s, I don't pay attention.\"\n\nFox News’ Paul Steinhauser and Brie Stimson contributed to this report",
        "Score": 1.4846787924922384,
        "freq_terms_in_query": {
            "president": 9
        },
        "doc_idx": "96"
    },
    {
        "Text": "Many congressional Democrats are increasingly fleeing the shadow of their party's leader, President Biden, while the United States continues to socioeconomically falter under his leadership amid anxiety over a possible 2010-like Republican wave in the quickly approaching 2022 midterms.\n\nThe panel on \"The Five\" discussed how Biden's ineffective and unpopular leadership is becoming even more of a drag on a fractured Democratic Party.\n\nOne notable Democrat, Maine Rep. Jared Golden – who holds a seat in an expansive, mostly rural district with a Cook PVI of Republican+6 – said he is not concerned with Biden's popularity because he is personally eclipsing the president by 30 points in his region.\n\nGolden was also the only House Democrat to join Republicans and vote against Biden's socioeconomic overhaul package dubbed \"Build Back Better.\" In 2018, he voted against Rep. Nancy Pelosi, D-Calif., in her bid to remain Speaker of the House, instead casting a vote for Illinois Democratic Sen. Tammy Duckworth.\n\n\"Things [are] getting pretty lonely for President Biden in his own party. Democrats are worried Biden scary poll numbers will lead to a midterm bloodbath and some are making sure to distance themselves from the commander-in-chief,\" host Dana Perino said. Perino added that people in \"vulnerable\" districts like Golden's are distancing themselves from the president.\n\nShe also pointed out that left-wing elected prosecutors in Democratic-run cities nationwide continue to propagate soft-on-crime policies.\n\n\"We saw … with ‘Uncle Larry’ Krasner in Philadelphia spending his whole press conference saying ‘we don’t have a problem, there is nothing happening here, you don’t believe your own eyes, the crime is not up,'\" she said, alluding to recent remarks by the Philadelphia district attorney amid what is the highest murder rate in Pennsylvania's largest city since 1990.\n\nPhiladelphia recently surpassed 500 homicides this year under the watch of Krasner and fellow Democrat Mayor James Kenney. Last week, Kenney blamed Pennsylvania's Second Amendment-friendly Republican-led House and Senate in part for the spike in gun crime, claiming they \"don't care how many people get killed.\"\n\n]Perino and the rest of \"The Five\" panelists said it is also local Democratic officials like Krasner and his Los Angeles counterpart George Gascon who are creating a political issue for national Democrats.\n\nHost Jesse Watters, a Philadelphia native, ripped both Krasner and Biden, saying that the district attorney should \"feel the pain, not spin the pain\" of southeastern Pennsylvanians, while the president separately appears \"out of touch\" with the fears of Americans living with a national crime spike.\n\n\"The [people] feel like the country is going down, down, down and that’s where he looks like he is out of touch,\" Watters said. \"If I was a Democrat running for the reelection, you know what I would do? I would retire and become a lobbyist.\"\n\n\"[W]hy would I want to sit around and dial for dollars if I’m going to get smoked in the midterms? … The donors don’t want to give me any money, they know I’m getting smoked, so what am I going to run for reelection [for]?\"\n\nCLICK TO GET THE FOX NEWS APP\n\nHe added that few Democrats outside of safe districts will want the president to campaign with them, which is a blow to the typical support felt by lawmakers aligned with a president's party.\n\nWatters said that if he were a Democratic lawmaker, he might instead invite Michelle Obama or Secretary of Transportation Pete Buttigieg as a proxy for Biden.\n\n\"[Biden] is not Barack [Obama] … he is not Donald Trump – they were historic and both had huge bases and both of their parties got crushed in the midterms,\" he argued. \"What does Joe have going for him?\"",
        "Score": 1.4113613212580534,
        "freq_terms_in_query": {
            "president": 7
        },
        "doc_idx": "18"
    },
    {
        "Text": "Fox News contributor Joe Concha predicted there will be a \"red tsunami\" during the 2022 midterm elections as President Biden's approval nosedives to new lows among various topics. Concha joined \"Fox & Friends First\" on Monday, arguing the Biden White House does not want to \"answer the tough questions\" and American voices \"will be heard\" during the elections next year as a result.\n\nBIDEN'S APPROVAL RATING ON CRIME TANKS AMID RISE IN SMASH-AND-GRAB ROBBERIES\n\nJOE CONCHA: We had a massacre in Waukesha, grandmothers and children run over by a murderous madman who never should have been out on bail, and at a time where we can tenuously [have] smash-and-grab looting. We're at a time [when] homicides are skyrocketing in cities from Philadelphia to Chicago to Austin to Los Angeles, and dozens in between. The president doesn't offer up that solution… He takes the weekend off outside of running to Jimmy Fallon on Friday night and then to an award show at the Kennedy Center on Sunday night. Kamala Harris, also at the Kennedy Center, can't be bothered to visit the U.S. southern border or speak with any leaders from Mexico or Nicaragua or Guatemala. Nor she, as a former district attorney and attorney general in California, can be bothered to address crime in any way, shape or form. This is an administration who believes they could ignore a problem or lie about it, and it will eventually go away. They don't want to do the hard work or answer the tough questions and poll after poll, after poll, the American people show they know it and their voices will be heard, believe me, in 2022 in the form of a red tsunami in the House and the Senate.\n\nCLICK HERE TO WATCH THE FULL INTERVIEW:",
        "Score": 1.209738275364046,
        "freq_terms_in_query": {
            "president": 2
        },
        "doc_idx": "20"
    },
    {
        "Text": "CNN's Chris Cillizza on Monday published an article in which he names Democrats who could possibly replace President Biden in the 2024 presidential elections.\n\nCillizza listed Biden's age and current political problems as the reason why he might be replaced on the Democrat ticket in 2024.\n\n\"Combine President Joe Biden's age (he'll be 82 shortly after the 2024 election) and his ongoing political struggles (he's mired in the low 40s in job approval) and you get this: a series of stories examining whether Biden runs again and, if not, who might take his place,\" Cillizza wrote.\n\n‘CNN HEROES’ FALLS FLAT WITH ONLY 422K VIEWERS FOR NETWORK’S SECOND-LEAST WATCHED SUNDAY NIGHT SINCE 1997\n\nAlthough White House Press Secretary Jen Psaki said, \"the President has every intention of running for reelection,\" Cillizza suggested Democrats who could run in Biden’s place.\n\nPossible replacements included Vice President Kamala Harris and Transportation Secretary Pete Buttigieg, both have been discussed as potential rivals for the 2024 election.\n\nRegarding Harris, Cillizza wrote that she’s \"undoubtedly struggled as vice president but she's still the most likely Democrat not named Biden to wind up as the Democratic nominee in 2024.\"\n\nCillizza also complimented Buttigieg writing, \"The most naturally talented candidate in the 2024 field, ‘Mayor Pete’ has also been front and center selling Biden's infrastructure bill.\"\n\nCillizza also listed include failed gubernatorial candidate Stacey Abrams, who recently announced another campaign for Georgia governor in 2022. Despite her previous failed run for higher office, Cillizza pushed her name as a possibility if she wins the governor’s race next year.\n\n\"Abrams talked openly about running in 2020 before passing on the race; but she needs to win the Georgia governor's mansion in 2022 before thinking too much about 2024,\" Cillizza wrote.\n\nOther Democrats Cillizza mentioned are Massachusetts Sen. Elizabeth Warren, Illinois Gov. J.B. Pritzker, Minnesota Sen. Amy Klobuchar, North Carolina Gov. Roy Cooper, former New Orleans mayor Mitch Landrieu, Commerce Secretary Gina Raimondo, Michigan Gov. Gretchen Whitmer, and New Jersey Gov. Phil Murphy.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"If Biden decides not to run, chances are we would be looking at a very crowded field of Democrats seeking to replace him,\" Cillizza concluded.\n\nPresident Biden has been facing plenty of speculation over whether he’ll run again for president due to his age and health.",
        "Score": 1.1547501719384075,
        "freq_terms_in_query": {
            "president": 7
        },
        "doc_idx": "37"
    },
    {
        "Text": "A federal judge on Tuesday rejected former President Donald Trump’s attempt to block House Democrats from obtaining his personal tax records.\n\nDistrict Court Judge Trevor McFadden, a Trump appointee, dismissed the case, citing Supreme Court precedent. Trump’s attorneys claimed executive privilege and argued the Democrat-led efforts to obtain his tax records were politically motivated.\n\n\"Even if the former President is right on the facts, he is wrong on the law,\" McFadden said in his ruling. \"A long line of Supreme Court cases requires great deference to facially valid congressional inquiries. Even the special solicitude accorded former Presidents does not alter the outcome. The Court will therefore dismiss this case.\"\n\nThe House Ways and Means Committee, led by Rep. Richard Neal, D-Mass., asked the IRS to release Trump’s tax returns in April 2019, kick-starting a lengthy court battle. Trump was the first sitting president not to release his tax records upon entering office in decades.\n\nThe judge paused enforcement of his ruling for 14 days to allow further discussions between the two parties and the potential filing of an appeal. McFadden said Trump’s returns should not be released during that period.\n\nIn his ruling, McFadden suggested that Neal should refrain from making Trump’s tax information public, though he noted it was the \"chairman’s right to do so.\"\n\n\"If Chairman Neal’s true interest in the former President’s tax returns is indeed to better understand the Presidential Audit Program, he will doubtless be able to accomplish this objective without publishing the returns,\" McFadden said.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nNeal praised the judge’s ruling.\n\n\"This ruling is no surprise; the law is clearly on the Committee’s side,\" Neal said in a statement. \"I am pleased that we’re now one step closer to being able to conduct more thorough oversight of the IRS’s mandatory presidential audit program.\"",
        "Score": 1.0369185217406107,
        "freq_terms_in_query": {
            "president": 4
        },
        "doc_idx": "35"
    },
    {
        "Text": "After Wyoming GOP Rep. Elizabeth Cheney read texts from three Fox News hosts to then-White House Chief of Staff Mark Meadows into the Congressional Record during the latest House January 6 Committee hearing, Laura Ingraham pushed back on claims and insinuations that she was being irresponsible, hypocritical or not publicly professing her true opinion of the rioting that was going on at the time.\n\nEarlier Tuesday, Cheney -- previously appointed the vice-chair of the committee by its leader, Mississippi Democratic Rep. Bennie Thompson after most of the party-leadership-assigned Republicans were blocked from participating earlier this year – read aloud text messages between Ingraham, Sean Hannity, and Brian Kilmeade to Meadows individually on the day of the riot.\n\n\"This sent the left-wing media hacks into ‘Spin & Defame’ mode. Of course the regime media was trying to twist this message to try and tar me as a liar and hypocrite who privately sounded the alarm on January 6 but privately downplayed it,\" she said.\n\nCheney, a vocal opponent of former President Trump, said in Congress Tuesday that Ingraham and others \"knew [Donald Trump] needed to act immediately\".\n\n\"Mark, the president needs to tell people in the Capitol this is hurting all of us – he is destroying his legacy,\" she read from Ingraham's messages. Meadows has since been pursued on contempt charges from the committee after halting cooperation most recently.\n\nIngraham said late Tuesday that the insinuated idea that she publicly egged on the rioters, ostensibly as a supporter of the purported pro-Trump cause, was a \"big lie\" being disseminated by Cheney and newspaper reporters like Aaron Blake of the Washington Post.\n\nShe pointed to a lengthy tweet from Blake from earlier in the day, saying he \"grossly mischaracterized what I said in an attempt to smear me.\"\n\n\"[Blake] was not alone. CNN’s chief propagandist Brian Stelter joined on the smearfest writing that ‘they all knew the truth right away by the night of January 6, Ingraham was spouting conspiracy theories… based on a lie she pushed over and over again’,\" she said, reading from Stelter's comments at one point.\n\nIngraham said she never supported election \"conspiracy theories\" about a stolen 2020 election as accused by Stelter.\n\nShe added that claims Stelter made about her claiming the Marxist group Antifa had infiltrated the protesters were indeed clarified by Ingraham upon further reportage as \"not substantiated.\"\n\n\"Another inconvenient fact those little men left out: Had they bothered to actually watch what I said the night of January 6 or read any of my public tweets from the afternoon of January 6, they couldn't have denied the truth.\n\nShe then replayed parts of her \"Angle\" from that evening's show:\n\n\"The Capitol was under siege by people who can only be described as antithetical to the MAGA movement. Now they were likely not all Trump supporters, and there were some reports that Antifa sympathizers may have been sprinkled throughout the crowd.\n\n\"The point remains, if you were a Trump supporter trying to display your support for the president, today's antics at the Capitol did just the opposite.\n\n\"Those who breached the Capitol Hill security today, whoever they were, they were criminals. I’ve been to literally dozens of Trump events, and the criminal actions we saw today do not represent this movement.\"\n\n\"Does that sound like I was downplaying it to you,\" she asked. Ingraham then read her public tweets from January 6 as well:\n\n\"Security breach at the Capitol is disgraceful and the president needs to tell everyone to leave the building now. 2:44 P.M. Anyone thinks this is gonna the MAGA movement is delusional. It hurts the movement, the Trump legacy and of course the country.\"\n\n\"The president should order [National Guard] to secure the Capitol immediately.\"\n\n\"When there’s any big crowd there will invariably be bad actors, but blame will be laid at the feet of the White House if Capitol not cleared quickly.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Now this is all public record, kids,\" Ingraham concluded. \"The real big lie is the expansive narrative of January 6th that these clowns have made the center of the political existence. So it’s time to face facts, shut down the false narrative and treat Cheney and her clique the way the American people treat them: by tuning them out.\"",
        "Score": 0.9073037065230344,
        "freq_terms_in_query": {
            "president": 5
        },
        "doc_idx": "31"
    },
    {
        "Text": "Democrats are headed toward a \"Thelma and Louise\"-like ending, Laura Ingraham said in Friday's opening monologue of \"The Ingraham Angle.\"\n\n\"The old party of FDR and JFK is now more like the party of Thelma and Louise,\" the host said, referencing the 1991 buddy crime movie. Like its titular characters, \"the Democrats are headed full speed ahead to the cliff’s edge,\" she said.\n\n'BOOMING' BIDEN ECONOMY? 'THE FIVE' BLAST LIBERAL MEDIA, DEMS FOR FLATTERING INFLATION COVERAGE\n\nIngraham reported the Republican Party boasts a double-digit lead over Democrats on the generic midterm ballot for the first time ever in the CNBC All-America Economic survey.\n\nWith President Biden's approval rating at 41% and his economic approval rating down 19%, Ingraham noted that suburban residents \"like safe streets, a strong economy and strong border.\"\n\nShe cited a poll that found \"the most important issues for voters are inflation [and] immigration. Dems have bombed on each one,\" she added.\n\nnext Image 1 of 3\n\nprev next Image 2 of 3\n\nprev Image 3 of 3\n\nThe Fox News host continued, saying that Vice President Harris puts the left \"between a rock and a hard place,\" calling her \"an unqualified, unintelligent and unlikable woman as [the] presumptive front-runner\" if Biden does not run for reelection.\n\nSecretary of Transportation Pete Buttigieg puts Democrats \"in even deeper trouble,\" with a predicted 11-percentage-point loss to former President Trump if he ran in 2024.\n\n\"This is what happens when you put diversity over merit,\" Ingraham said. \"Talent and experience always win out.\"\n\n\"The lesson for Republicans is obvious: Trump’s policies worked. There’s no going back to the old perpetual war, open borders, globalist views of yesteryear,\" she continued.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nIngraham said Republicans should \"[U]nveil a new 21st-century contract with America — cut middle class taxes, revive the oil and gas industry through exploration, shake up education, advance small businesses [and] re-invigorate American manufacturing.\"",
        "Score": 0.9073037065230344,
        "freq_terms_in_query": {
            "president": 3
        },
        "doc_idx": "19"
    },
    {
        "Text": "After Wyoming GOP Rep. Elizabeth Cheney read texts from three Fox News hosts to then-White House Chief of Staff Mark Meadows into the Congressional Record during the latest House January 6 Committee hearing, Laura Ingraham pushed back on claims and insinuations that she was being irresponsible, hypocritical or not publicly professing her true opinion of the rioting that was going on at the time.\n\nEarlier Tuesday, Cheney -- previously appointed the vice-chair of the committee by its leader, Mississippi Democratic Rep. Bennie Thompson after most of the party-leadership-assigned Republicans were blocked from participating earlier this year – read aloud text messages between Ingraham, Sean Hannity, and Brian Kilmeade to Meadows individually on the day of the riot.\n\n\"This sent the left-wing media hacks into ‘Spin & Defame’ mode. Of course the regime media was trying to twist this message to try and tar me as a liar and hypocrite who privately sounded the alarm on January 6 but privately downplayed it,\" she said.\n\nCheney, a vocal opponent of former President Trump, said in Congress Tuesday that Ingraham and others \"knew [Donald Trump] needed to act immediately\".\n\n\"Mark, the president needs to tell people in the Capitol this is hurting all of us – he is destroying his legacy,\" she read from Ingraham's messages. Meadows has since been pursued on contempt charges from the committee after halting cooperation most recently.\n\nIngraham said late Tuesday that the insinuated idea that she publicly egged on the rioters, ostensibly as a supporter of the purported pro-Trump cause, was a \"big lie\" being disseminated by Cheney and newspaper reporters like Aaron Blake of the Washington Post.\n\nShe pointed to a lengthy tweet from Blake from earlier in the day, saying he \"grossly mischaracterized what I said in an attempt to smear me.\"\n\n\"[Blake] was not alone. CNN’s chief propagandist Brian Stelter joined on the smearfest writing that ‘they all knew the truth right away by the night of January 6, Ingraham was spouting conspiracy theories… based on a lie she pushed over and over again’,\" she said, reading from Stelter's comments at one point.\n\nIngraham said she never supported election \"conspiracy theories\" about a stolen 2020 election as accused by Stelter.\n\nShe added that claims Stelter made about her claiming the Marxist group Antifa had infiltrated the protesters were indeed clarified by Ingraham upon further reportage as \"not substantiated.\"\n\n\"Another inconvenient fact those little men left out: Had they bothered to actually watch what I said the night of January 6 or read any of my public tweets from the afternoon of January 6, they couldn't have denied the truth.\n\nShe then replayed parts of her \"Angle\" from that evening's show:\n\n\"The Capitol was under siege by people who can only be described as antithetical to the MAGA movement. Now they were likely not all Trump supporters, and there were some reports that Antifa sympathizers may have been sprinkled throughout the crowd.\n\n\"The point remains, if you were a Trump supporter trying to display your support for the president, today's antics at the Capitol did just the opposite.\n\n\"Those who breached the Capitol Hill security today, whoever they were, they were criminals. I’ve been to literally dozens of Trump events, and the criminal actions we saw today do not represent this movement.\"\n\n\"Does that sound like I was downplaying it to you,\" she asked. Ingraham then read her public tweets from January 6 as well:\n\n\"Security breach at the Capitol is disgraceful and the president needs to tell everyone to leave the building now. 2:44 P.M. Anyone thinks this is gonna the MAGA movement is delusional. It hurts the movement, the Trump legacy and of course the country.\"\n\n\"The president should order [National Guard] to secure the Capitol immediately.\"\n\n\"When there’s any big crowd there will invariably be bad actors, but blame will be laid at the feet of the White House if Capitol not cleared quickly.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Now this is all public record, kids,\" Ingraham concluded. \"The real big lie is the expansive narrative of January 6th that these clowns have made the center of the political existence. So it’s time to face facts, shut down the false narrative and treat Cheney and her clique the way the American people treat them: by tuning them out.\"",
        "Score": 0.9073037065230344,
        "freq_terms_in_query": {
            "president": 5
        },
        "doc_idx": "91"
    },
    {
        "Text": "Mission, Texas, police have identified the suspect who crashed into a vehicle Saturday while fleeing authorities during an alleged human smuggling attempt.\n\nEsteban Cantu Jr., 18, an American citizen, is charged with murder and aggravated assault in the deaths of Mission resident Carmen Huerta Sosa, 59, and her daughter, 22-year-old Viridiana Charon Lloyd. He was charged Saturday with felony evading and human smuggling.\n\nCantu ran a stop sign Saturday while fleeing from Border Patrol agents and Texas Department of Public Safety troopers and T-boned Sosa’s car, police said.\n\nCBP OFFICERS IN TEXAS SEIZE MORE THAN $3M WORTH OF METHAMPHETAMINE AT US-MEXICO BORDER\n\nPolice said six illegal immigrants were in his vehicle. One of the immigrants flew through the windshield upon impact but survived. Cantu and the immigrants were transported to an area hospital, police said.\n\nnext Image 1 of 3\n\nprev next Image 2 of 3\n\nprev Image 3 of 3\n\nCantu was arrested, formerly charged and arraigned before Mission Municipal Court Judge Jonathan Wehrmeister after he was released from the hospital, police said. He was remanded to the Hidalgo County jail in lieu of the bonds set by Judge Wehrmeister.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nTexas Lt. Gov. Dan Patrick weighed in on Saturday’s incident, saying the blood of Sosa and Lloyd are on the hands of President Biden and Vice President Kamala Harris for their refusal to secure the border.\n\nFox News’ Peter Aitken contributed to this report.",
        "Score": 0.7258429652184276,
        "freq_terms_in_query": {
            "president": 2
        },
        "doc_idx": "38"
    },
    {
        "Text": "Mission, Texas, police have identified the suspect who crashed into a vehicle Saturday while fleeing authorities during an alleged human smuggling attempt.\n\nEsteban Cantu Jr., 18, an American citizen, is charged with murder and aggravated assault in the deaths of Mission resident Carmen Huerta Sosa, 59, and her daughter, 22-year-old Viridiana Charon Lloyd. He was charged Saturday with felony evading and human smuggling.\n\nCantu ran a stop sign Saturday while fleeing from Border Patrol agents and Texas Department of Public Safety troopers and T-boned Sosa’s car, police said.\n\nCBP OFFICERS IN TEXAS SEIZE MORE THAN $3M WORTH OF METHAMPHETAMINE AT US-MEXICO BORDER\n\nPolice said six illegal immigrants were in his vehicle. One of the immigrants flew through the windshield upon impact but survived. Cantu and the immigrants were transported to an area hospital, police said.\n\nnext Image 1 of 3\n\nprev next Image 2 of 3\n\nprev Image 3 of 3\n\nCantu was arrested, formerly charged and arraigned before Mission Municipal Court Judge Jonathan Wehrmeister after he was released from the hospital, police said. He was remanded to the Hidalgo County jail in lieu of the bonds set by Judge Wehrmeister.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nTexas Lt. Gov. Dan Patrick weighed in on Saturday’s incident, saying the blood of Sosa and Lloyd are on the hands of President Biden and Vice President Kamala Harris for their refusal to secure the border.\n\nFox News’ Peter Aitken contributed to this report.",
        "Score": 0.7258429652184276,
        "freq_terms_in_query": {
            "president": 2
        },
        "doc_idx": "99"
    },
    {
        "Text": "On Day 24 of his 100-day rooftop vigil, Pastor Corey Brooks addressed the damage he said the Jussie Smollett spectacle did to Chicago and America-at-large. Many political leaders weighed in on Smollett’s hate crime accusation, from the beginning of the hoax to the trial that found him guilty last week. But all the while, serious issues like gang violence plague the South Side where Brooks works every day to build a community center with the goal of creating more opportunities for the locals.\n\nBrooks began his rooftop revelations by reading a tweet from GQ magazine that was posted in 2019: \"The racist, homophobic attack on Jussie Smollett is far-right America’s endgame.\"\n\n\"I wonder how they must feel now after supporting a man who tried to racially divide all of America,\" Brooks said. \"Supporting someone who was not trying to make America better, but was looking at all the evil intentions and trying to abuse them to divide us even further apart.\"\n\nCHICAGO ROOFTOP REVELATIONS: DAY 23 WITH PASTOR COREY BROOKS\n\nHe continued: \"When we have so much stuff going on with all the violence, with all the shooting, [Smollett] comes to our city and uses the race card to divide us. He didn’t come here to help us deal with the issues that we're faced with, to help us deal with the violence that we're dealing with every single day. He used the race card to further divide us as an American people.\"\n\nJussie Smollett garnered sympathy from leaders like President Biden and Vice President Harris. Neither apologized for their apparent rush to judgment.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"I'm glad he got caught in his lie,\" said the pastor. He went on to say that the biggest problem that we face in America is not the racism that Smollett would argue is everywhere.\n\nInstead, the pastor said, \"learning how to be more neighborly\" is the greatest problem America faces. \"How to treat our brothers and sisters decently, learning how to be the best that we can possibly be, regardless of race, regardless of party, regardless of our economic affiliations.\"\n\nFor more information, please visit Project H.O.O.D .",
        "Score": 0.604869137682023,
        "freq_terms_in_query": {
            "president": 2
        },
        "doc_idx": "76"
    },
    {
        "Text": "NEW You can now listen to Fox News articles!\n\nThe House of Representatives unanimously passed a new version of a bill banning imports made in Xinjiang region of China, where the Uighur minority community has reportedly been subject to human rights abuses.\n\nThe Uyghur Forced Labor Prevention Act, also known as H.R. 6256, passed by voice vote on Tuesday evening after Republicans and Democrats agreed on a revised version of legislation that stripped out differences between the Senate and the House, according to Reuters .\n\nNEW YORK TIMES SAYS RUBIO'S QUESTIONS ON 'WITHHOLDING' INFORMATION ABOUT UYGHUR GENOCIDE 'RECKLESS AND WRONG'\n\nThe bill will now head to the Senate, and President Biden has already expressed his support.\n\n\"The President welcomes the agreement by Congress on the bipartisan Uyghur Forced Labor Prevention Act,\" the White House said in a statement Tuesday. \"We agree with Congress that action can and must be taken to hold the People’s Republic of China accountable for genocide and human rights abuses and to address forced labor in Xinjiang.\"\n\nThe statement from the White House continued: \"The President also rallied the G7 to commit to ensure all global supply chains are free from the use of forced labor—including from Xinjiang. The Administration will work closely with Congress to implement this bill to ensure global supply chains are free of forced labor.\"\n\nCURRY & ABBAS: CHINA'S WAR ON UYGHUR MUSLIMS – HERE'S WHY THIS PERSECUTION SHOULD MATTER TO CHRISTIANS\n\nThe State Department earlier this year it was \"deeply disturbed\" by allegations that women in China's \"re-education\" camps for Uyghurs were systematically raped and sexually abused, according to a report.\n\n\"These atrocities shock the conscience and must be met with serious consequences,\" a State Department spokeswoman told Reuters.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nAccording to reports last year, up to three million Uighur Muslims in China's western Xinjiang province have been plucked from their homes since 2017 by authorities and disappeared into prison camps, which the Chinese government terms \"re-education\" facilities.\n\nFox News' David Aaro contributed to this report",
        "Score": 0.604869137682023,
        "freq_terms_in_query": {
            "president": 3
        },
        "doc_idx": "94"
    },
    {
        "Text": "Leonardo DiCaprio didn’t want Meryl Streep stripping down in their film \"Don’t Look Up.\"\n\nThe claim was made by the film’s director, Adam McKay, who said the actor, 47, felt the actress, 72, was too much of an icon to go nude in front of cameras for the comedy.\n\nStreep stars as President Janie Orlean, who is seen naked from behind in one scene. While the Oscar winner employed a body double, DiCaprio allegedly still felt uneasy about the idea.\n\n\"She is fearless,\" McKay recently told The Guardian. \"And yes, that is a body double. But you know who had a problem with it? Leo [DiCaprio]. Leo views Meryl as film royalty… although maybe royalty is not a compliment… but as such a special figure in the history of film.\"\n\nJULIANNE HOUGH SAID LEONARDO DICAPRIO WAS NOT ‘GOOD IN BED,’ HER NIECE CLAIMS\n\n\"He didn’t like seeing her with the lower back tattoo, walking for a second naked,\" McKay continued. \"He said something to me like, ‘Do you really need to show that?’ And I was like, ‘It’s President Orlean; it’s not Meryl Streep.’ But she didn’t even blink. She didn’t even bring it up.\"\n\nReps for DiCaprio and Streep didn’t immediately respond to Fox News’ request for comment.\n\nThe two stars have known each other for decades now. Streep played DiCaprio’s mother in the 1996 drama \"Marvin’s Room.\"\n\nDiCaprio recently told E! News that the rest of the \"Don’t Look Up\" cast was nervous to work alongside the veteran leading lady. The film also stars Jennifer Lawrence, Jonah Hill, Cate Blanchett, Tyler Perry, Ron Perlman and Timothée Chalamet among others.\n\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\n\"You get to work with the greatest living actor in the world,\" DiCaprio shared. \"Everyone’s on their toes. Everyone’s prepared, and we’re just trying to keep up with her.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nDespite her lengthy career in Hollywood, Streep has never done a full-frontal nude scene. In 1982, she was seen topless on a massage table in the film \"Still of the Night.\" However, the actress was expertly covered with a towel.\n\nIn her 1983 film \"Silkwood,\" Streep’s character flashes at her co-worker. In 1994’s \"The River Wild,\" Streep strips down for a skinny-dipping scene. And then in 1995, she had a steamy sex scene with co-star Clint Eastwood in \"The Bridges of Madison County.\"",
        "Score": 0.4536518532615172,
        "freq_terms_in_query": {
            "president": 2
        },
        "doc_idx": "26"
    },
    {
        "Text": "Miranda Devine slammed the liberal media for not asking Vice President Kamala Harris tough questions when they get interviews with her on \"Tucker Carlson Tonight\" Tuesday.\n\nOne of the pressing issues of the day, in Devine's view, is the border crisis. In March, President Biden appointed Harris to handle the border crisis amid rising encounters between illegal immigrants and Border Patrol.\n\nAmid an exodus from her office, a report the veep is a \"bully,\" and a crisis at the border, the San Francisco Chronicle instead focused on Harris' new office design in a recent article.\n\nSURGE OF MIGRANTS CROSSING INTO US CREATES LOGISTICS NIGHTMARE FOR BORDER AGENTS\n\nDevine said that the piece focused on the color of Harris' walls and the art pieces she chose rather than the issue with which she is tasked – overseeing the border.\n\n\"It's pretty rare to get a one-on-one interview with Kamala Harris and the San Francisco Chronicle – to their great credit – managed to score one. But they didn't ask [Harris] … about the border crisis … [which] is supposed to be something she's fixing. Apparently, there was nothing to talk about,\" she said.\n\nOn the design, Tucker Carlson remarked, \"Kamala Harris has horrible taste. Don't let her near your house.\"\n\nTucker asked, \"She's this feminist leader, she's breaking glass ceilings, she's inspiring America's women … And yet the one interview she gives us is about interior decorating?\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Yeah … it's pretty sexist … when you think about … [Harris] should be up in arms. But that's what she's all about,\" said Devine. \"She's all about … frivolity, and she never wants to talk about anything serious like the border. [She has] no plan to visit [and] no plan to fix it … It's all about her décor.\"",
        "Score": 0.4536518532615172,
        "freq_terms_in_query": {
            "president": 2
        },
        "doc_idx": "45"
    },
    {
        "Text": "NEW You can now listen to Fox News articles!\n\nHappy Tuesday everyone. It's time for my favorite show: The But-Heads.\n\nOur world is run by buttheads. These are people who tell you one thing, then follow up with a \"but,\" that contradicts what they just said. They start with a panic line, but then condition it with: \"but we still don’t know.\" That way they get to scare your ass, then cover their own. So let's follow the \"buts\", and see where these asses take us.\n\nAccording to Axios, the website, not my Pilates instructor, the country is bracing for a terrifying wave of omicron. But, the new variant seems to be much less severe. But Boris Johnson says there is a tidal wave coming. But one of his experts adds: only ten people have been admitted to the hospital with it. But we should have known: never believe anything a person says who doesn't own a comb.\n\nHOW IS COVID GOING TO END?\n\nStill, you must get a third dose to bring the level of protection back up! Because the variant seems to spread among people who've received two jabs. But it's not a big deal for those who get it. Still, you gotta mask up and get another dose.\n\nBut this is nothing like the previous strains. Compared to delta -- you barely notice it, and it’s much less powerful. If Alec Baldwin were the first strain, this one is Billy... Or Danny... Or Steven.\n\nBut! -- new data from Europe \"hint\" that omicron is poised to explode in the US. True, they said the same thing about the metric system. But the variant is less likely to lead to hospitalization in adults! So this is the PG version of an R-rated film. Like when they cut out all the swearing and boobs from \"Old Yeller.\"\n\nFact is, more people are hospitalized for putting power tools in their butts, according to emergency rooms located near Home Depots. But two doses of Pfizer’s vaccine appear to be much less effective against severe disease -- but you should still get a booster. Although - we have not seen anyone with severe disease -- but hold on, it's coming! But, so was the medical device I ordered online, and I’m still waiting. I had to make my own using an attachment from an old vacuum.\n\nOMICRON IS BETTER AT EVADING VACCINES, NEW COVID-19 TRANSMISSIBILITY DATA CONFIRMS\n\nBut a senior Biden flack told Axios omicron will come fast! But it won't be as severe... But... There will be hospitalizations! But -- the analysis of South Africa data said that the risk of hospital admission was 30 percent lower than the first wave. But- a two-dose regimen was 70 percent effective against severe disease requiring hospital admission. But only 33 percent effective against omicron.\n\nSo- omicron is less severe – good. But it could still overwhelm the health care system even if a small percentage require hospital care! (s***!) The cases could reach a million a day here in America (s***!) But those cases could be asymptomatic and mild. (hooray!)\n\nBut --the growth of the cases could double quickly- - but it also appears to be already slowing down in other countries. But it's too soon to tell. But don't panic. But also, panic.\n\nBut maybe even in hospitalizations, adults are less sick than previous waves. But while vaccinations do help reduce infection -- but not transmission.\n\nOMICRON COVID-19 VARIANT NOW ACCOUNTS FOR 2.9% OF ALL CASES IN THE UNITED STATES\n\nIn Denmark, 75 percent of omicron cases are among fully-vaccinated people. But you can't compare countries – except when you do. But you can't!\n\nSo omicron has high transmissibility. But it appears to be mild. But it could lead to a huge projection of cases. But we don't have nearly enough data to make any firm predictions. So the people who are telling you to do something, are the same people who are talking you out of it! These people are sending more mixed messages than a straight hairdresser. So maybe call us when you know what the f*** you're talking about!\n\nBecause to quote Axios, again-- \"there is certainly a strong possibility that a lot of Americans are about to get sick... Soon.\" Someone actually wrote that sentence. Imagine if your doctor had that mentality.\n\nSkit of doctor sending mixed signals to a patient\n\nSo what's the bottom line for all the buttheads? Omicron is like that carton of Chinese food in the back of the fridge. It could be dangerous, but we can't find anyone who died from it. But we don't have enough data. So just in case, get a booster and mask up now, whether you're vaxxed or not.\n\nDR. OZ LAMENTS POLITICIZATION OF COVID, VACCINES ON ‘HANNITY’\n\nBut I thought that's why we got vaxxed? To stop with the masks. Not anymore. Look at Joe Biden. He's gotten three shots, but he still wears a mask. He's like one giant walking butt.\n\nSo even if you're alone at your desk, or alone driving a truck, or alone having sex... Mask up! But -- not if you're a politician! Then you can go to bars, parties, galas -- and do whatever you want.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSo these buttheads cover their asses by temporarily covering their mouths when a camera is near. Problem is -- how can they tell the two holes apart? You can't go by the smell of their breath.\n\nSo turns out the only thing that all these different viruses can't penetrate are the immune systems of habitual liars. But it would be nice if they could. No ifs, ands, or buts.\n\nThis article is adapted from Greg Gutfeld's opening monologue on the December 14, 2021 edition of \"Gutfeld!\"",
        "Score": 0.45011541161761953,
        "freq_terms_in_query": {
            "dangerous": 1
        },
        "doc_idx": "42"
    },
    {
        "Text": "NEW You can now listen to Fox News articles!\n\nIf you live in Manchester, New Hampshire, first of all, congratulations, it's a really nice place. But second, we thought we'd give you an explanation for what you may have just seen. So if you live there and last month, you thought you saw Liz Cheney wandering around downtown Manchester, no, you were not hallucinating. Liz Cheney was there. And that's pretty weird if you think about it. Not a lot of people go to Manchester, New Hampshire, in November, so it probably wasn't a family vacation. Nor is it likely that Liz Cheney went up there by accident. Manchester is an eight-hour drive from her home in the D.C. suburbs, and more to the point, it's also eight hours from the CNN studios in downtown Washington that she inhabits more often than most of us go to church and much more reverently.\n\nManchester is also, not that it matters to her, more than 2,000 miles from Wyoming. That's the state that she supposedly represents in the U.S. Congress.\n\nSo the question is: What was Liz Cheney doing in Manchester, New Hampshire, and of course, there's only one conceivable answer. Liz Cheney plans to run for President of the United States.\n\nMARK MEADOWS RESPONDS TO POTENTIAL CONTEMPT CHARGES FROM JANUARY 6 COMMITTEE: ‘FISHING EXPEDITION’\n\nNow, if that sounds demented, yeah, it’s because it is, but it's also real. Now, you may be wondering if Liz Cheney were to run for president, what exactly would she run on? She doesn't like Trump. OK. But what would her platform be? We know the answer to that because Liz Cheney only cares about one thing and only ever has, and that is starting pointless wars in faraway countries. The more pointless the war, the farther away, the better it is. Droning peasants makes Liz Cheney feel powerful. It's been the great cause of her life.\n\nBut you have to ask, do a lot of voters agree with her on that? Is there a massive national constituency for more Iraq invasions? We've seen the polling on that, and in a word, no. There's not a massive national constituency for Liz Cheney's foreign policy views. Just the opposite, in fact. People live outside D.C. do not support more pointless wars that do nothing for the United States or its core interests. They're not eager to send their kids to die for eastern Ukraine, and the reason they're not is they've already done it. They fought a lot of wars like this because Liz Cheney told them to and they've had enough.\n\nYet apparently, Liz Cheney is the last person who doesn't know this. She has literally no idea. She believes she has a shot at the Republican nomination for president, and she believes that fervently enough to fly to Manchester, New Hampshire, in the middle of November. So what can we conclude from this behavior? Not looking at what she says, but what she's doing? And the only answer is Liz Cheney is delusional. She's living on another planet, and on that planet with her is the Republican Party's fading leadership class. The people who stopped assessing reality are having new thoughts of any kind, right, around 2003. That's the era in which they are frozen in amber.\n\nAnd those people are sending Liz Cheney a ton of money, huge amounts of money because they wanted to run for president. Cheney has raised millions of dollars just this year, in part from political action committees run by Mitt Romney and Mitch McConnell, and, needless to say, Lindsey Graham. Apparently, all of these geniuses think that Liz Cheney has a good shot of being president.\n\nSo Liz Cheney is this cycle's Jeb Bush, who, by the way, has also given her money because of course he has. Now you should know that none of these people, and they are the very same people who feel perfectly empowered to lecture you about what's conservative and what's not, not one of these people has said a single word about Liz Cheney’s performance on the House of Representatives January 6th Commission. That commission is now in the process of trying to hunt down and destroy anyone to the right of Adam Kinzinger, who himself is on the committee, and we should tell you, still bursting into tears quite a bit.\n\nLET THE PEOPLE BACK INTO THEIR CAPITOL\n\nThe Jan. 6 Committee has become the American version of a Soviet show trial or overstating it. You think? Well watch it for yourself on C-SPAN? Come to your own conclusions. We'll tell you this: The Jan. 6 committee has somehow awarded itself the power to seize the personal communications of its political enemies and then make them public. The arguments really simple: Turn over your text messages or we're going to send you to jail.\n\nLet's not lie about this. The point of this exercise is not to uncover crimes. The January 6 committee hasn't found any crimes, and at this point will not find any crimes. The point is to harm and humiliate the people you disagree with politically, and that's what they're doing.\n\nSo yesterday, in case you missed it, Liz Cheney found herself with a list of text messages to and from Mark Meadows. Meadows was Donald Trump's last White House chief of staff. Now, those texts showed no evidence of any crime whatsoever. But since she had them, Liz Cheney thought they might be embarrassing to conservatives, so she read them on television. Some of those texts, it turns out, were from anchors here at Fox News, and Liz Cheney took special delight in reading those.\n\nCHENEY: According to the records, multiple Fox News hosts knew the president needed to act immediately. They texted Mr. Meadows and he has turned over those texts.\n\nNotice the faux seriousness, according to the record. Now, before we get into the details of what is in those texts, just step back for a second and consider what we just saw. We now live in a country where none of your private communications are safe from the eyes of power-drunk politicians like Liz Cheney. Liz Cheney can harness the awesome power of the national security state to seize your personal text messages and then read them into the congressional record. And guess what? There's nothing you can do about it, Mr. Citizen. We don't care.\n\n‘THIS IS ABOUT DONALD TRUMP’: MARK MEADOWS RESPONDS TO JANUARY 6TH CMTE VOTE RECOMMENDING CRIMINAL CHARGES\n\nSo your texts, effectively your daily diary, now belong to Liz Cheney. And the question all of us, no matter who we voted for, have to ask ourselves is: Do we really want to live in a country like that? Well, probably we don't.\n\nPrivacy isn't just a nice thing to have, it's not an ancillary concern, privacy is morally essential. Privacy is a prerequisite for freedom. You can't have liberty without privacy. And that, needless to say, is the whole point of the spectacle. To let you know that we don't have freedom anymore, and Liz Cheney is really in charge.\n\nBut what's extra amazing about what Liz Cheney just did, and this is the reason you know this is a show trial, purely political and totally disconnected from reality, much less law, is that the text message that she read yesterday were exculpatory. They didn't make her case. They undercut her case.\n\nThree Fox anchors sent messages to Mark Meadows, and none of them cheered what was happening at the Capitol on Jan. 6. In fact, they were upset by it, even in private, when they assume no one was listening. And that shouldn't surprise you. These are principled people, what they say in public is not that far from what they say over text message.\n\nIf you get a text from Brian Kilmeade, it sounds pretty much identical to Brian Kilmeade on Fox & Friends. These are not phonies. We can personally confirm that. Whether you like them or not, they're real.\n\nSo Fox anchors on TV and in private opposed the BLM riots in the summer of 2020. Fox anchors opposed the riot on Capitol Hill in January 2021. It turns out that Fox anchors opposed riots. All riots. No matter who's rioting. And we're the only news anchors in the United States of America who do this. The other channels wait to see who the rioters voted for, and then they respond accordingly, as you may have noticed.\n\nSo the texts that Liz Cheney read aloud yesterday were a tribute to the people who wrote them, but because she is a liar, Liz Cheney attempted to twist these texts into proof of some kind of conspiracy. Part of the insurrection storyline, which, by the way, is getting very old. If Jan. 6 was an insurrection, we'll believe anything, where’s the evidence of that?\n\nCNN FLOATS POSSIBLE REPLACEMENTS FOR BIDEN IN 2024\n\nHas Liz Cheney shown that a single prominent Republican in the United States of America plotted to overthrow the government of the United States? Well, no, she hasn't. Not one. As with the prosecution of Kyle Rittenhouse, Liz Cheney is proving the defendant's case inadvertently, and of course, she's lying. They all are. The entire Jan. 6 committee is lying, and they're not even lying very artfully repeatedly in just the last few days, nearly a year after it happened. The record is settled. We know the facts, Democrats have continued to claim, contrary to the facts, that many people were killed at the Capitol on January 6th.\n\nSandy Cortez, who has some kind of power in American society, wrote that \"138 were injured, almost 10 dead\" in what she called the \"terror attack on the Capitol.\" Meanwhile, Ayanna Pressley of Massachusetts told America that the insurrection quote \"brought great trauma, injury and loss of life.\"\n\nReally great loss of life? Who are all these dead people? Can you be a lot more specific? Ayanna Pressley? AOC? Jan. 6 committee? No they can't because they're lying. Only one person was intentionally killed on January 6th. Who was that? Well, she was a Trump supporter. She was called Ashli Babbitt, and she was shot in the chest without warning by one of Liz Cheney's bodyguards. Those are the facts that they are lying about.\n\nSo how can you trust a congressional committee that tells lies this obvious? You can't. And yet the White House has endorsed all of this. Joe Biden himself claims on the basis of no evidence whatsoever that Jan. 6 was an outbreak of White supremacy.\n\nJoe Biden, October: We’re confronting the stains of what remains — the deep stain on the soul of the nation: hate and white supremacy. // The violent, deadly insurrection on the Capital nine months ago was about white supremacy in my view.\n\nSo that's just ugly race politics. By the way, that was in October, when we know all the facts. There was no racial angle to January 6. What was January 6th? Well, there was destruction of property which were totally opposed to. But what motivated why were all those people there?\n\nWell, for the most part, a year later, it's very clear January 6th was essentially what it appeared to be. Thousands of ordinary American citizens, voters, people who believe in our democracy far more fervently than Liz Cheney ever has, came to Washington because they sincerely believed democracy had been thwarted. They believed the presidential election was unfair, and they have a right to believe that, and by the way, in many ways, they were correct. The presidential election was unfair, and you don't have to get into anything about voting machines to believe that.\n\nConsider the facts that we know. As Election Day approached, Verizon, T-Mobile and AT&T shut down the Trump campaign's ability to send text messages and then Google, this has never even been reported, but it is widely known, Google prevented the Trump campaign from raising money over Gmail. There's no precedent for that. The Trump reelection campaign lost millions in donations. That was the whole point of it.\n\nSo the most powerful companies on planet Earth, heavily regulated by the government benefiting from government contracts, swung behind Joe Biden and tried to stop Donald Trump, the sitting president, in his tracks.\n\nIs that fair? Is that the democracy that Liz Cheney is always lecturing you about? Honestly, what's the answer? These are legitimate questions. Instead of answering them, Cheney has pushed to throw protesters in jail. OK, if someone broke the law, punish that person. That applies to BLM activists as much as it does to QAnon people. We’re for enforcing the law fairly, equitably. But we also think that as you do that, if a mass of people show up angry at the Capitol, you should least pause for a second if you believe in democracy and ask ‘what are they angry about?’ Maybe we should address their concerns.\n\nBut Liz Cheney won't. And those aren't the only questions that she won't answer. Here are a few other questions she won't answer. Who is the person dressed in black who we were told dropped pipe bombs all over Capitol Hill the night before on January 5th? That person, the mad bomber, is on his cell phone. Well, that's interesting because according to criminal indictments that we have seen, the feds have used cell phone geolocation to arrest dozens of people who are present on Jan. 6th. But not this person. They haven't found this person. They haven't even identified this person. They've stopped talking about this person. Why is that? Liz Cheney?\n\nAnd while we're at it, here's another question. What exactly was the role of Ray Epps in the chaos of Jan. 6th? We ask because Ray Epps is on video on both January 5th and January 6th, encouraging people to enter the Capitol building, which is to say to break federal law. And as he says this in this video, you'll notice, people in the crowd immediately identify him as a \"Fed.\"\n\nRAY EPPS JAN. 5: We need to go into the Capitol. … I’m going to put it out there, I’m probably going to go to jail for it okay? Tomorrow we need to go into the Capitol! Into the Capitol!\n\nCROWD: What? No! (chant) Fed! Fed! Fed! Fed!\n\nRAY EPPS, JAN. 6: Ok folks, spread the word. As soon as the president is done speaking, we go to the Capitol. The Capitol is this direction.\n\nWell, that's amazing. Look, we're not prosecutors, but by the standards of Jan. 6, if you take a look at what people are spending a year in jail for, that looks like a crime. Ray Epps encouraged others to breach the Capitol.\n\nAnd yet, as far as we know, Ray Epps has not been prosecuted or even charged. I mean, maybe he has. Tell us if you know differently. Liz Cheney.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nBut if he hasn't, how come? Did reps have any contact with federal law enforcement agencies before the Capitol was stormed on Jan. 6th? Liz Cheney has called us \"unpatriotic\" for asking that question. But it's not an unpatriotic question. It's a legitimate, very straightforward question. And American citizens have a right to know the answer, but Liz Cheney won't answer it. Why?\n\nWe asked her to come on our show and explain. She refused, of course, because she's a coward. Most neocons are. But until Liz Cheney answers that basic question, there is no reason to play along with her charade. There is certainly no reason that any American citizen should even consider surrendering personal text messages to her or the Jan. 6th committee. If they're going to lie to us and hide essential information from the public, there's no reason to participate, no matter what they say.\n\nThis article is adapted from Tucker Carlson's opening commentary on the December 14, 2021 edition of \"Tucker Carlson Tonight.\"",
        "Score": 0.3629214826092138,
        "freq_terms_in_query": {
            "president": 8
        },
        "doc_idx": "27"
    },
    {
        "Text": "The U.S. House of Representatives voted to lift the federal debt ceiling by $2.5 trillion early Wednesday and will send the bill to President Biden's desk for final approval.\n\nThe House voted 221-209 in favor of the increase after the Senate voted to avoid a U.S. default. The votes followed months of discord on Capitol Hill. The Senate vote was also along party lines, 50-49.\n\nLawmakers expect the increase, which raises the debt ceiling to roughly $31.5 trillion, to last beyond the upcoming midterm elections and into 2023. Treasury Secretary Janet Yellen said lawmakers had until Wednesday to raise the debt ceiling or risk a potential default on U.S. obligations.\n\nEarlier, Republicans agreed to a one-time exception to the filibuster, allowing the Democrats to pass the debt hike by a simple majority vote rather than meeting the 60-vote threshold.\n\n\"This is about paying debt accumulated by both parties, so I’m pleased Republicans and Democrats came together,\" Senate Majority Leader Chuck Schumer, D-NY, said on the floor ahead of the vote.\n\nThe House is expected to sync up with the Senate in a vote on raising the debt limit that could occur as soon as Tuesday. From there, the bill will proceed to President Biden’s desk for final approval.\n\nThe Senate vote followed weeks of contentious negotiations between Schumer and Minority Leader Mitch McConnell, R-Ky. Many Republicans say Democrats should raise the debt ceiling without their help, arguing any increase will facilitate increased spending on social and climate programs the country can’t afford.\n\n\"Later today, every Senate Democrat is going to vote on party lines to raise our nation's debt limit by trillions of dollars,\" McConnell said ahead of the vote. \"If they jam through another reckless taxing and spending spree, this massive debt increase will just be the beginning.\"\n\nThe one-time exception to filibuster rules allowed Democrats to avoid raising the debt ceiling through the budget reconciliation process. Schumer said that process would be too risky and complicated.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nMcConnell faced some Republican pushback over the agreement, with GOP critics accusing the minority leader of caving to political pressure.\n\nFox News' Edmund DeMarche and the Associated Press contributed to this report.",
        "Score": 0.3629214826092138,
        "freq_terms_in_query": {
            "president": 2
        },
        "doc_idx": "52"
    },
    {
        "Text": "NEW You can now listen to Fox News articles!\n\nPresident Joe Biden’s job approval rating is in free fall – and it’s not just Republicans saying so.\n\nA recent USA TODAY/Suffolk Poll found 59% of voters disapprove of Biden’s job performance, while Vice President Kamala Harris’ approval rating sits at an embarrassing 28%. A stunning 46% of those surveyed believe Biden is doing a worse job as president than expected, including 16% who supported him at the ballot box last year.\n\nThe latest Harvard- Harris Poll found that voters overwhelmingly reject Biden’s agenda, too, with nearly 60% of voters opposing Biden’s socialist spending package. And according to CNN’s latest poll, a majority of Americans say Biden isn't paying attention to the nation's most important issues.\n\nBIDEN BLAMES SOARING GAS PRICES ON BIG OIL AS HE KEEPS UP HIS WAR ON FOSSIL FUELS\n\nThese results shouldn’t be a surprise. The Biden-Harris administration has failed at every opportunity.\n\nJust look at our economy. November’s jobs report was the worst of the year and the lowest number of Biden’s administration. The economy added back just 210,000 jobs – less than half what economists had predicted. Nearly four million Americans who lost their jobs during the pandemic are still jobless.\n\nMeanwhile, the latest data from the Labor Department shows consumer prices skyrocketed 6.2% in October – the largest spike in more than 30 years. Rising prices are making everything more expensive: gasoline is up almost 50% since last year and used vehicles have risen by 26%. And if you hosted a holiday dinner last month, you might’ve emptied your wallet: according to the Farm Bureau, Thanksgiving dinner cost families 14% more than last year.\n\nDespite Biden’s assurances that inflation was temporary, the latest numbers indicate that inflation is here to stay – and will likely get worse. Economists project that high inflation will last well into 2022.\n\nAs we look ahead to the 2022 midterm elections, Democrats have every reason to worry.\n\nBut these aren’t just statistics. Higher prices have a tangible impact on family finances and hit lower and middle-class Americans the most. Joe Biden’s disastrous economic policies punish hard-working Americans and demonstrate just how out of touch they are with average citizens.\n\nThere’s also the crisis unfolding at our southern border. A stunning 164,303 illegal immigrants were caught trying to illegally enter the U.S. in October, making it the highest October number in the history of the Department of Homeland Security. In fact, more than 1.4 million illegal migrants have been apprehended crossing the border since Biden took office, while at least 400,000 have successfully snuck into the U.S. illegally in the last 12 months.\n\nThe consequences are serious. The massive influx of migrants has prompted a humanitarian crisis that has overwhelmed our border agents and a national security nightmare that poses a threat to our citizens. And yet, Biden has proved himself either unable or unwilling to act, while \"border czar\" Kamala Harris has consistently avoided a trip to the epicenter of the crisis.\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nAs if these issues weren’t bad enough, consider the Biden administration’s open disdain for parents alarmed by public schools’ radical indoctrination of their children. In a letter to the Biden Department of Justice, the National School Boards Association complained of threats made to school board members by outraged parents and suggested the federal government investigate them as domestic terrorists. In response, Attorney General Merrick Garland announced the DOJ would look into the matter and potentially prosecute parents.\n\nThe public backlash came so quickly that the NSBA apologized, but the DOJ has yet to do the same. In fact, internal emails reveal that the NSBA coordinated with the White House to give the federal government cause for investigation.\n\nAnd while Garland told lawmakers that the DOJ and FBI did not use counterterrorism measures against parents, whistleblower emails reveal that the FBI’s Counterterrorism and Criminal Divisions created a \"threat tag\" to track troublesome parents. Far from legitimate concerns about violence, it seems the letter was a despicable political ploy to intimidate parents into silence.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nScandals and crises like these are why voters in cities and states across the country cast their ballots for Republicans earlier this month. GOP candidates swept all three of Virginia’s top offices and gained the majority in the state legislature. In deep blue Seattle, voters elected a Republican city attorney for the first time in more than 30 years. And all over the Empire State, New Yorkers backed Republican candidates in races for city council, mayor and district attorney. The reason is clear. In less than a year, voters have seen enough of Joe Biden and Democrats to know their policies have failed the American people.\n\nWith Biden underwater, a red wave is coming. As we look ahead to the 2022 midterm elections, Democrats have every reason to worry.",
        "Score": 0.3202248375963651,
        "freq_terms_in_query": {
            "president": 3
        },
        "doc_idx": "17"
    },
    {
        "Text": "NEW You can now listen to Fox News articles!\n\nA federal judge in the Southern District of New York denied a motion Tuesday from New York City public school employees for a preliminary injunction against COVID-19 mandates on the basis of religious exemption.\n\nDistrict Judge Valerie Caproni ruled that because the plaintiffs \"have not shown irreparable harm or a likelihood of success on the merits, their motion for a preliminary injunction is DENIED,\" according to her ruling.\n\n\"With no basis for a preliminary injunction, the Court also denies Plaintiffs’ motion that Defendants be ordered to immediately reinstate them to their original positions prior to the enforcement of the vaccine mandate,\" the judge continued.\n\nIf Caproni, who was appointed by former President Barack Obama, had granted the motion, her injunction would have blocked the city from mandating vaccinations for public school employees while they await the court to hear other arguments for vaccine exemptions on religious grounds.\n\nNYC MAYOR DE BLASIO ANNOUNCES COVID-19 VACCINE MANDATE FOR PRIVATE SECTOR WORKERS\n\nCaproni also denied the requests from the plaintiffs for provisional certification of a class of all Department of Education (DOE) employees who assert religious objections to the vaccine mandate.\n\n\"IT IS FURTHER ORDERED that Plaintiffs’ motion to certify a class of all DOE employees who assert religious objections to the vaccine mandate is DENIED without prejudice because it is premature,\" she said.\n\nNEW YORKERS REACT TO DE BLASIO'S VACCINE MANDATES ON PRIVATE SECTOR: ‘DISASTER’ OR ‘ABOUT TIME’?\n\nCaproni's ruling comes a day after the Supreme Court refused to block a New York regulation mandating COVID-19 vaccinations for health care workers.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe vaccine mandate for health care workers, which went into effect in August, allows for medical exemptions but not religious ones. The Supreme Court turned away two applications from doctors and nurses in the state for injunctive relief to allow religious exemptions while litigation continues in the lower courts over the mandate's constitutionality.\n\nFox News' Marta Dhanis and Jessica Chasmar contributed to this report.",
        "Score": 0.2592296304351527,
        "freq_terms_in_query": {
            "president": 1
        },
        "doc_idx": "49"
    }
]